<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo Comum</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        <li class="nav-item">
          <a class="nav-link" id="acessilibityMain" href="#body">Ir para conteúdo 1</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="" href="#header">Ir para o menu 2</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo 3</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé 4</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo Comum - Cultura digital e Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Possibilidades das rela&ccedil;&otilde;es entre cultura digital e EPT</strong></p>


<div id="recursos-azul" class="feat-box-foto">
<div class="container-fluid image-paragraph">
<div class="row justify-content-center paragrafo-com-card-curso">
<div class="col-sm-12 col-md-12 col-lg-7 col-xl-8">

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa">&Eacute; poss&iacute;vel que voc&ecirc; esteja esperando que seja trazido receitas para fazer isso, tanto no &acirc;mbito das pr&aacute;ticas pedag&oacute;gicas quanto em rela&ccedil;&atilde;o &agrave; gest&atilde;o t&eacute;cnico-administrativa.&nbsp;</p>
<div class="author citacao-longa-autoria">Luciane Penteado Chequime</div>
</div>

</div>
<div class="col-sm-6 col-md-8 col-lg-5 col-xl-4"><img class="card-curso-topo-image" src="medias/foto autora.png" alt="card do curso" width="100%" /></div>
</div>
</div>
</div>

<p>As rela&ccedil;&otilde;es que se estabelecem socialmente, tal qual a educa&ccedil;&atilde;o, s&atilde;o constru&iacute;das a partir de princ&iacute;pios como a autonomia, a criticidade, a &eacute;tica e o respeito &agrave;s diferen&ccedil;as, dentre outros. Esses princ&iacute;pios ir&atilde;o embasar as rela&ccedil;&otilde;es se a inten&ccedil;&atilde;o &eacute; promover uma <strong>educa&ccedil;&atilde;o transformadora</strong>, isto &eacute;, <span style="background-color: #c2e0f4;">que vise &agrave; supera&ccedil;&atilde;o da desigualdade e da opress&atilde;o.</span></p>
<p class="paragrafo">Entretanto, <span style="color: #000000;">ao inv&eacute;s de lhe of</span>erecer modelos, instru&ccedil;&otilde;es ou um tutorial, no que diz respeito &agrave; doc&ecirc;ncia que objetiva a forma&ccedil;&atilde;o omnilateral e emancipadora de trabalhadores e trabalhadoras, posso lhe trazer elementos para refletirmos sobre o processo de ensino-aprendizagem na e para a cultura digital.</p>
<p class="paragrafo">Para tanto, pedirei a ajuda do professor<span class="modal-button button" data-toggle="modal" data-target="#modal-1">&nbsp;Dermeval Saviani</span>. Ele nos explica que o <span style="background-color: #c2e0f4;">trabalho pedag&oacute;gico consiste num trabalho de media&ccedil;&atilde;o</span><strong> </strong>que cria condi&ccedil;&otilde;es para a</p>
<p><!-- Citação longa --></p>
<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo"><strong>Dermeval Saviani</strong></h5>
</div>
<div class="modal-body nota">Dermeval Saviani nasceu em Santo Ant&ocirc;nio da Posse (S&atilde;o Paulo), em 25 de dezembro de 1943. Ele &eacute; professor, fil&oacute;sofo e pedagogo. Ele &eacute; o idealizador da Pedagogia Hist&oacute;rico-Cr&iacute;tica. Nesta teoria pedag&oacute;gica, ele defende o acesso ao conhecimento sistematizado e sua compreens&atilde;o por parte do estudante como instrumento de reflex&atilde;o e transforma&ccedil;&atilde;o da sociedade, em contraponto ao modelo conteudista de ensino. Demerval Saviani publicou v&aacute;rios livros e artigos sobre a rela&ccedil;&atilde;o entre trabalho e educa&ccedil;&atilde;o, influenciando assim o pensamento brasileiro sobre esse tema. <img style="max-width: 100%;" src="medias/TE1_MNT_003.png" alt="" /><strong> Imagem: </strong>T&iacute;tulo: Dermeval Saviani Fonte: Elza Fi&uacute;za/Ag&ecirc;ncia Brasil. Elabora&ccedil;&atilde;o: Prosa (2024).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">&ldquo;passagem dos educandos de uma inser&ccedil;&atilde;o <strong>acr&iacute;tica e inintencional </strong>no &acirc;mbito da sociedade a uma inser&ccedil;&atilde;o <strong>cr&iacute;tica e intencional</strong>&rdquo;&nbsp;</p>
<div class="author citacao-longa-autoria">(Saviani, 2019, p. 75).</div>
</div>

<p>Esse trabalho de media&ccedil;&atilde;o, segundo o autor, desenrola-se em <strong>cinco momentos</strong>. Vejamos.</p>

<p class="paragrafo">O <strong>primeiro momento </strong>consiste em tomar a <strong>pr&aacute;tica social comum a professores e a estudantes </strong>como ponto de partida, uma vez que ambos s&atilde;o agentes sociais. Todavia, &eacute; importante considerar que, em virtude de seu conhecimento e da sua experi&ecirc;ncia, o posicionamento que estudantes e professores ocupam em rela&ccedil;&atilde;o &agrave; pr&aacute;tica social &eacute; desigual neste momento. Assim, por n&atilde;o conseguirem prever os n&iacute;veis de conhecimento e experi&ecirc;ncia dos estudantes para planejar sua atua&ccedil;&atilde;o pedag&oacute;gica, a compreens&atilde;o do professor configura-se numa s&iacute;ntese prec&aacute;ria.</p>
<p class="paragrafo">J&aacute; os estudantes, embora tenham experi&ecirc;ncias e conhecimentos, sua condi&ccedil;&atilde;o de estudantes n&atilde;o lhes permite, ainda, articular a experi&ecirc;ncia pedag&oacute;gica &agrave; pr&aacute;tica social na qual est&atilde;o inseridos.&nbsp;</p>


<p class="paragrafo">Ao contextualizarmos o primeiro momento proposto por Saviani (2019, 2021), podemos considerar a <strong>cultura digital como o ponto de partida </strong>para o trabalho pedag&oacute;gico na EPT. Nesse sentido, h&aacute; uma diferen&ccedil;a de posicionamento de professores e estudantes em rela&ccedil;&atilde;o aos conhecimentos e experi&ecirc;ncias como agentes da e na cultura digital. Isso ocorre n&atilde;o apenas porque t&ecirc;m n&iacute;veis diversos de compreens&atilde;o sobre as pr&aacute;ticas sociais da e na cibercultura, como produtores, consumidores e disseminadores de informa&ccedil;&atilde;o, mas porque h&aacute; nativos e imigrantes digitais entre estudantes da EPT e, tamb&eacute;m, entre professores que atuam na modalidade.</p>

<p class="paragrafo">Desse modo, &eacute; importante que os <strong>professores se apropriem das tecnologias digitais</strong>, isto &eacute;, sejam alfabetizados e letrados digitalmente, para que possam, por um lado, fazer<strong> </strong>uso delas como<strong> recursos pedag&oacute;gicos </strong>em suas aulas<strong> </strong>e, por outro lado, promover reflex&otilde;es e formar trabalhadoras e trabalhadores para o uso cr&iacute;tico, &eacute;tico e emancipat&oacute;rio no mundo do trabalho.</p>

<p>O <strong>segundo momento </strong>&eacute; a <strong>problematiza&ccedil;&atilde;o</strong>, ou seja,&nbsp;</p>
<p><!-- Citação curta --></p>

<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa">&ldquo;detectar que quest&otilde;es precisam ser resolvidas no &acirc;mbito da pr&aacute;tica social e, em consequ&ecirc;ncia, que conhecimento &eacute; necess&aacute;rio dominar&rdquo;.&nbsp;</p>
<div class="author citacao-longa-autoria">(Saviani, 2021, p. 57)</div>
</div>

<p>Fazendo um paralelo com a cultura digital, esse &eacute; o momento para que <strong>temas relevantes na atualidade</strong>, como <em>cyberbullying,<span class="modal-button button" data-toggle="modal" data-target="#modal-2">&nbsp;intelig&ecirc;ncia artificial</span>, fake news,</em> redes sociais, tecnologias digitais em si, entre in&uacute;meros outros, <strong>sejam enfocados de maneira questionadora</strong>, isto &eacute;, com vistas a desvelar suas m&uacute;ltiplas determina&ccedil;&otilde;es e implica&ccedil;&otilde;es na vida social.</p>

<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Saiba mais</h5>
</div>
<div class="modal-body nota">O tema da intelig&ecirc;ncia artificial tem ganhado cada dia mais popularidade, concorda? Ent&atilde;o, enfoc&aacute;-la, problematiz&aacute;-la, discutindo seus limites e potencialidades, especialmente no &acirc;mbito educacional e na EPT, &eacute; premente. Assim, para que voc&ecirc; possa se aprofundar na tem&aacute;tica, sugiro o estudo dos seguinte materiais: <br /><br /><a rel="noopener" href="https://unesdoc.unesco.org/ark:/48223/pf0000390241" target="_blank">Guia para a IA generativa na educa&ccedil;&atilde;o e na pesquisa</a><br /><br /><a rel="noopener" href="https://www.portaldaindustria.com.br/publicacoes/2024/1/inteligencia-artificial-aplicada-educacao-profissional-e-tecnologica/" target="_blank">Intelig&ecirc;ncia artificial aplicada &agrave; Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica. Novas tecnologias para apoiar a personaliza&ccedil;&atilde;o do ambiente de ensino-aprendizagem e o processo de atualiza&ccedil;&atilde;o curricular</a></div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo">A partir da&iacute;, chegamos ao <strong>terceiro momento</strong>, a <strong>instrumentaliza&ccedil;&atilde;o</strong>, isto &eacute;, a</p>
<p class="paragrafo"><!-- Citação curta --></p>

<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa">&ldquo;apropria&ccedil;&atilde;o por parte dos estudantes dos instrumentos te&oacute;ricos e pr&aacute;ticos necess&aacute;rios ao equacionamento dos problemas detectados na pr&aacute;tica social&rdquo;.</p>
<div class="author citacao-longa-autoria">(Saviani, 2019, p. 76.)</div>
</div>

<p class="paragrafo">&Eacute; aqui que o professor entra com todo o seu <strong>conhecimento espec&iacute;fico da &aacute;rea de forma&ccedil;&atilde;o</strong> para propiciar aos estudantes conceitos, teorias, t&eacute;cnicas, procedimentos, enfim, todo o <strong>arcabou&ccedil;o te&oacute;rico-pr&aacute;tico </strong>para apreender e intervir na realidade.</p>
<p class="paragrafo">Essas interven&ccedil;&otilde;es na realidade podem incluir o pr&oacute;prio uso das tecnologias digitais como ferramentas. Por exemplo, a cria&ccedil;&atilde;o de blogues e sites, postagens de textos e v&iacute;deos em redes sociais, desenvolvimento de aplicativos e <em>softwares</em> etc.</p>

<p class="paragrafo">Ao tratar da instrumentaliza&ccedil;&atilde;o, Saviani (2021, p. 57) coloca, claramente, que os instrumentos te&oacute;ricos e pr&aacute;ticos resultam da produ&ccedil;&atilde;o hist&oacute;rica e social. Assim, sua apropria&ccedil;&atilde;o pelos estudantes depende da <strong>&ldquo;transmiss&atilde;o direta ou indireta por parte do professor&rdquo;</strong>. Explicando melhor,</p>
<p class="paragrafo"><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa">&ldquo;o professor tanto pode transmiti-los diretamente como pode indicar os meios pelos quais a transmiss&atilde;o venha a se efetivar&rdquo;.</p>
<div class="author citacao-longa-autoria">(Saviani, 2021, p. 57).</div>
</div>


<p class="paragrafo">Assim, se o objetivo &eacute; formar futuros trabalhadores que hajam cr&iacute;tica e eticamente na e para a cultura digital, &eacute; fundamental que os professores mobilizem e orientem a intelig&ecirc;ncia coletiva<strong> </strong>(L&eacute;vy, 2010, 2011), <span style="background-color: #c2e0f4;">inserindo as tecnologias digitais no processo de ensino-aprendizagem</span><strong> </strong>e valorizando os saberes singulares de cada estudante.&nbsp;</p>

<div id="recursos-azul" class="feat-box-foto">

<p>&ldquo;A express&atilde;o intelig&ecirc;ncia coletiva foi cunhada por Pierre L&eacute;vy [...] para designar uma <strong>intelig&ecirc;ncia distribu&iacute;da em toda parte</strong>, que deve ser valorizada e coordenada, a fim de resultar na mobiliza&ccedil;&atilde;o de compet&ecirc;ncias. A no&ccedil;&atilde;o de intelig&ecirc;ncia coletiva pressup&otilde;e a identifica&ccedil;&atilde;o das habilidades distribu&iacute;das em todos os indiv&iacute;duos com o prop&oacute;sito de coorden&aacute;-las por meio do emprego das tecnologias da informa&ccedil;&atilde;o e comunica&ccedil;&atilde;o, para utiliza&ccedil;&atilde;o em prol da coletividade nos planos cognitivo, social, pol&iacute;tico e econ&ocirc;mico. N&atilde;o se deve conceber a intelig&ecirc;ncia coletiva simplesmente como uma fus&atilde;o de intelig&ecirc;ncias individuais, mas como uma revitaliza&ccedil;&atilde;o das singularidades. A<strong> intelig&ecirc;ncia coletiva</strong> faz do saber a principal base para as rela&ccedil;&otilde;es humanas&rdquo;. (Andretta; Paje&uacute;, 2018, p. 367).</p>

</div>

<p>Para tanto, coadunam com a EPT no contexto da cultura digital&nbsp;</p>
<ul>
<li>&ldquo;o planejamento, execu&ccedil;&atilde;o e avalia&ccedil;&atilde;o de conte&uacute;dos educacionais que se apropriem de diferentes linguagens comunicacionais em uma constru&ccedil;&atilde;o multifacetada&rdquo; (Montanaro, 2018, p. 207) na perspectiva da <strong>educa&ccedil;&atilde;o transm&iacute;dia</strong>,</li>
<li>escolha de <strong>estrat&eacute;gias metodol&oacute;gicas </strong>que propiciem maior envolvimento e que promovam a autonomia</li>
<li>o <strong>compartilhamento de conhecimentos </strong>e o di&aacute;logo entre os estudantes.</li>
</ul>


<p class="paragrafo">Chegamos, ent&atilde;o, ao <strong>quarto momento </strong>da media&ccedil;&atilde;o: a <strong>catarse</strong>,</p>
<p class="paragrafo"><!-- Citação curta --></p>
<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">&ldquo;o ponto culminante do processo pedag&oacute;gico, quando ocorre a efetiva incorpora&ccedil;&atilde;o dos instrumentos culturais, transformados em elementos ativos de transforma&ccedil;&atilde;o social&rdquo;.</p>
<div class="author citacao-longa-autoria">(Saviani, 2019, p. 76).</div>
</div>

<p><span style="font-size: 1em;">Por fim, o </span><strong style="font-size: 1em;">ponto de chegada </strong><span style="font-size: 1em;">&eacute; a </span><strong style="font-size: 1em;">pr&oacute;pria pr&aacute;tica social</strong><span style="font-size: 1em;">, por&eacute;m compreendida, agora, de maneira qualitativamente diferente do ponto de partida, pois </span><strong style="font-size: 1em;">a <span class="modal-button button" data-toggle="modal" data-target="#modal-3">s&iacute;ncrese</span> inicial tornou-se s&iacute;ntese</strong><span style="font-size: 1em;">. Assim, os estudantes, apropriados dos conhecimentos te&oacute;rico-pr&aacute;ticos constru&iacute;dos socialmente pelo ser humano ao longo da Hist&oacute;ria, </span><span style="background-color: #c2e0f4;"><span style="font-size: 1em; background-color: #c2e0f4;">rompem o senso comum</span><span style="font-size: 1em; background-color: #c2e0f4;">, mudando sua vis&atilde;o de mundo, passando a </span><span style="font-size: 1em; background-color: #c2e0f4;">enxergar a sociedade a partir de suas m&uacute;ltiplas determina&ccedil;&otilde;es e a si pr&oacute;prios como sujeitos atuantes e transformadores da realidade.</span></span></p>

<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-3" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Para saber mais...</h5>
</div>
<div class="modal-body nota">Em linhas gerais, na perspectiva da pedagogia hist&oacute;rico-cr&iacute;tica, a "s&iacute;ncrese" diz respeito ao ponto de partida do processo de ensino-aprendizagem, em que os estudantes possuem conhecimentos pr&eacute;vios fragmentados, baseados no senso comum, sobre a pr&aacute;tica social. Assim, a vis&atilde;o de mundo nesse momento ainda &eacute; ca&oacute;tica. Ao longo do processo de ensino-aprendizagem, por meio da media&ccedil;&atilde;o anal&iacute;tica realizada pelo professor, essas pr&eacute;-no&ccedil;&otilde;es s&atilde;o gradualmente organizadas, tornando-se s&iacute;ntese, uma compreens&atilde;o mais estruturada, fundamentada em conhecimentos cient&iacute;ficos sobre a realidade. A pr&aacute;tica social pode ser vista, ent&atilde;o, a partir dos m&uacute;ltiplos fatores que nela interferem, isto &eacute;, como o concreto pensado.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><strong style="font-size: 1em;"><!-- Fim nota modal --></strong></p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/CD_INF_039.png" alt="card do curso" width="75%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Os 5 momentos da media&ccedil;&atilde;o pedag&oacute;gica de Demerval Saviani<br /><strong>Elabora&ccedil;&atilde;o:</strong> Prosa (2024).<strong><br /></strong></p>


<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="parte4-capitulo0.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="parte4-capitulo2.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 21 de 25</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>