<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Planejamento Educacional e Avaliação Institucional na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page">

<p class="content paragrafo quote citacao-curta strong"><strong>Institucionaliza&ccedil;&atilde;o da participa&ccedil;&atilde;o &eacute; um dever pedag&oacute;gico </strong></p>

<p><span style="font-weight: 400;">Os documentos institucionais, como <span style="background-color: #bfedd2;">Plano de Desenvolvimento Institucional (PDI), Projeto Pol&iacute;tico-Pedag&oacute;gico Institucional (PPI), Plano(s) de Curso(s) (PCs), Projeto Pedag&oacute;gico do Curso (PPC), Estatutos, Regimentos</span> e outros instrumentos, devem garantir o </span><strong>direito &agrave; participa&ccedil;&atilde;o</strong><span style="font-weight: 400;">, organizar e prever os processos e as rela&ccedil;&otilde;es entre os diversos segmentos, priorizando o desenvolvimento integral dos estudantes e a ensinagem em detrimento da burocracia e do legalismo.</span></p>
<p><span style="font-weight: 400;">Inst&acirc;ncias formais de participa&ccedil;&atilde;o, como <span style="background-color: #bfedd2;">Conselhos Escolares, Associa&ccedil;&otilde;es de Pais e M&atilde;es, Organiza&ccedil;&otilde;es Estudantis (Gr&ecirc;mios ou Associa&ccedil;&otilde;es), Associa&ccedil;&otilde;es de Docentes e ou Funcion&aacute;rios, Comiss&otilde;es Pr&oacute;prias de Avalia&ccedil;&atilde;o (CPAs), Conselhos de Classe, Colegiados de Curso, Conselhos</span> Acad&ecirc;micos e Universit&aacute;rios, entre outros, dinamizam e viabilizam aprendizagens participativas e coletivas.&nbsp;</span></p>
<p><span style="font-weight: 400;">&Eacute; na escola, seja na educa&ccedil;&atilde;o infantil, no ensino fundamental, na educa&ccedil;&atilde;o profissional ou no ensino superior, que aprendemos a participar. &Eacute; na escola que se forma pessoas, l&iacute;deres, gestores democr&aacute;ticos, l&iacute;deres comunit&aacute;rios, lideran&ccedil;as sociais e pol&iacute;ticas e, inclusive, empreendedores individuais e coletivos.</span></p>
<p><span style="font-weight: 400;">J&aacute; nas pol&iacute;ticas e processos de <strong>Avalia&ccedil;&atilde;o Institucional Participativa (AIP)</strong>, &eacute; necess&aacute;rio que as institui&ccedil;&otilde;es de ensino superem as meras participa&ccedil;&otilde;es formais, regulat&oacute;rias e de desempenho, geralmente alinhadas &agrave;s concep&ccedil;&otilde;es de mercado que induzem a competi&ccedil;&atilde;o entre os estudantes, com compara&ccedil;&otilde;es baseadas no ranqueamento e na meritocracia, e desenvolvam uma efetiva avalia&ccedil;&atilde;o participativa, processual e formativa com qualidade social.&nbsp;<br /></span></p>

<div id="recursos-azul" class="feat-box-foto">
<p><span style="font-weight: 400;">Nesta perspectiva, a <strong>avalia&ccedil;&atilde;o institucional</strong> n&atilde;o pode ser entendida como cumprimento de exig&ecirc;ncias burocr&aacute;ticas oriundas das regula&ccedil;&otilde;es, e sim como um movimento a partir do qual a <strong>institui&ccedil;&atilde;o</strong> se coloca<strong> </strong>comprometida com o trabalho desenvolvido e<strong> se organiza coletivamente</strong> para visualizar seus desafios, definir as a&ccedil;&otilde;es poss&iacute;veis e tomar decis&otilde;es para super&aacute;-los.</span></p>
</div>

<p>Anna Bondioli <span style="font-weight: 400;">(2004) adverte que, se a avalia&ccedil;&atilde;o n&atilde;o possibilitar um processo de repensar, reorganizar e renovar, ela se reduz ao desempenho de uma a&ccedil;&atilde;o burocr&aacute;tica, perdendo</span></p>
<p><span style="font-weight: 400;"><!-- Citação curta --></span></p>

<div id="recursos-azul" class="quote-1">
<p class="quote citacao-curta" style="display: block;"><span style="font-weight: 400;">todo o seu valor e o seu sentido, que &eacute; o de colocar-se a servi&ccedil;o de um projetar cada vez mais consciente, assumido e pass&iacute;vel de renova&ccedil;&atilde;o</span></p>
<div class="author citacao-curta-autoria"><span style="font-weight: 400;"><strong>(Bondioli, 2004, p. 146)</strong>.</span></div>
</div>

<p><span style="font-weight: 400;">Com essa perspectiva, a <strong>AIP</strong> baseia-se em um modelo que se compromete com a </span><strong>mobiliza&ccedil;&atilde;o interna e externa das escolas</strong><span style="font-weight: 400;"> em busca da negocia&ccedil;&atilde;o e qualifica&ccedil;&atilde;o de seu trabalho. Respaldada por uma responsabiliza&ccedil;&atilde;o participativa, <span style="background-color: #bfedd2;">incentiva a comunidade escolar a identificar seus problemas e a pensar solu&ccedil;&otilde;es</span>, objetivando, assim, a qualidade do trabalho desenvolvido pela escola. Nesse sentido, </span><span class="primary-color">Maria Simone Ferraz Pereira</span><span style="font-weight: 400;">&nbsp;e Mara Regina Lemos de Sordi (2020) concebem a AIP como </span><strong>resist&ecirc;ncia propositiva</strong><span style="font-weight: 400;">&nbsp;numa &eacute;poca em que a vida coletiva tem sido cada vez mais anulada em fun&ccedil;&atilde;o de interesses individuais. O elemento que nos aproximou desse modelo avaliativo relaciona-se &agrave; capacidade de participa&ccedil;&atilde;o de todos os segmentos na constru&ccedil;&atilde;o da qualidade da escola p&uacute;blica, inclusive dos estudantes.</span></p>
<p><span style="font-weight: 400;">Para Grabowski (2019), a fun&ccedil;&atilde;o da educa&ccedil;&atilde;o, no Brasil e em qualquer parte do mundo, &eacute; formar e desenvolver os estudantes em sua </span><strong>autonomia intelectual</strong><span style="font-weight: 400;">&nbsp;(pensar pr&oacute;prio), </span><strong>autonomia pol&iacute;tica </strong><span style="font-weight: 400;">(cidadania e participa&ccedil;&atilde;o na vida pol&iacute;tica) e </span><strong>autonomia &eacute;tica</strong><span style="font-weight: 400;">&nbsp;(forma&ccedil;&atilde;o de princ&iacute;pios e valores), com vistas &agrave; inser&ccedil;&atilde;o social e profissional em um mundo globalizado e diversificado. Ou seja, desenvolver o protagonismo estudantil e juvenil.</span></p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PA.3 ILU 3 (com fundo).png" alt="card do curso" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: <span style="font-weight: 400;">Protagonismo estudantil<br /></span></strong><strong>Fonte: <span style="font-weight: 400;">Prosa (2025c).</span></strong></p>

<p><span style="font-weight: 400;">A participa&ccedil;&atilde;o juvenil se torna genu&iacute;na quando se desenvolve em um ambiente democr&aacute;tico. A participa&ccedil;&atilde;o sem democracia &eacute; manipula&ccedil;&atilde;o e, em vez de contribuir para o desenvolvimento pessoal e social do jovem, pode prejudicar a sua forma&ccedil;&atilde;o &ndash; principalmente quando se tem o prop&oacute;sito de formar o jovem aut&ocirc;nomo, solid&aacute;rio e competente.</span></p>
<p><span style="font-weight: 400;">Portanto, </span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">educar e pensar as juventudes hoje, em suas m&uacute;ltiplas determina&ccedil;&otilde;es e express&otilde;es, obriga-nos a pensar e falar no &ldquo;plural&rdquo; &ndash; juventudes, culturas juvenis &ndash; e acreditar no enorme potencial delas para o desenvolvimento da sociedade.</span></span><span style="font-weight: 400;"> Isso implica adotar tr&ecirc;s atitudes frente aos jovens na sociedade, na escola e nas universidades:&nbsp;</span></p>
<div id="recursos-azul" class="feat-box-foto">
<ol style="list-style-type: lower-roman;">
<li><span style="font-weight: 400;">primeiro, perceber os jovens estudantes como solu&ccedil;&atilde;o e n&atilde;o como problema;&nbsp;</span></li>
<li><span style="font-weight: 400;">segundo, v&ecirc;-los como fonte de iniciativa e como possibilidade de criatividade e inova&ccedil;&atilde;o e n&atilde;o como recept&aacute;culo;&nbsp;</span></li>
<li><span style="font-weight: 400;">terceiro, consider&aacute;-los como parceiros e interlocutores das decis&otilde;es nos processos educativos e n&atilde;o como destinat&aacute;rios das a&ccedil;&otilde;es voltadas a eles.&nbsp;</span></li>
</ol>
</div>

<p><span style="font-weight: 400;">Nesta perspectiva, o mundo adulto &eacute; convidado a desenvolver uma vis&atilde;o e uma nova atitude em rela&ccedil;&atilde;o aos estudantes, caso contr&aacute;rio continuaremos privando-os no desenvolvimento de suas potencialidades. <span style="background-color: #bfedd2;">Tratar os estudantes como &ldquo;idiotas &uacute;teis&rdquo; e manipulados por pais, educadores, redes sociais e governantes &eacute; refor&ccedil;ar o estigma que os torna cada vez mais filhos do medo.</span> Medo de ficarem fora da universidade, medo de ficarem fora do mundo do trabalho, medo da viol&ecirc;ncia que os v&iacute;tima, medo de ficarem &agrave; margem das decis&otilde;es pol&iacute;ticas que afetam seus sonhos e projetos de vida.</span></p>
<p>&nbsp;</p>
<p><span style="font-size: 24pt;"><strong>Refer&ecirc;ncia inspiradora</strong></span></p>

<p><span style="font-weight: 400;">Existem muitas experi&ecirc;ncias de <strong>planejamento participativo e avalia&ccedil;&atilde;o institucional na perspectiva emancipat&oacute;ria</strong> tanto de institui&ccedil;&otilde;es de ensino, como de redes e sistemas de ensino, conforme a ampla literatura existente. Apresentamos o exemplo de uma escola da rede p&uacute;blica de ensino do munic&iacute;pio de Novo Hamburgo, estado do Rio Grande do Sul.&nbsp;</span></p>
<p><span style="font-weight: 400;">Trata-se da Escola Municipal de Educa&ccedil;&atilde;o B&aacute;sica <strong>Prof&ordf; Adolfina J. M. Diefenth&auml;ler</strong>, que desenvolve h&aacute; v&aacute;rios anos uma gest&atilde;o democr&aacute;tica com efetiva participa&ccedil;&atilde;o de toda a comunidade escolar. A inst&acirc;ncia m&aacute;xima de decis&atilde;o &eacute; a </span><strong>Assembleia Geral da Escola</strong>,<span style="font-weight: 400;">&nbsp;com todos os segmentos, em que s&atilde;o decididos desde os pequenos investimentos at&eacute; as principais pol&iacute;ticas internas da escola.&nbsp;</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">Segundo Zucchetti, Grabowski e Lamb (2023), </span><strong>tudo se inicia na participa&ccedil;&atilde;o democr&aacute;tica</strong><span style="font-weight: 400;">.</span><span style="font-weight: 400;"> N&atilde;o &eacute; poss&iacute;vel construir uma comunidade de aprendizagem enquanto ela &eacute; s&oacute; ideia. Nem as melhores pessoas com as melhores inten&ccedil;&otilde;es conseguem construir um processo colaborativo a partir apenas de conceitos de como deveria ser, sendo at&eacute; ing&ecirc;nuo acreditar que isso possa acontecer.&nbsp;</span></p>
<p><span style="font-weight: 400;">Na Escola Municipal Adolfina, do exemplo acima, a possibilidade do </span><span style="font-weight: 400; background-color: #bfedd2;">trabalho colaborativo come&ccedil;a quando se instala o processo de assembleias, que garante a participa&ccedil;&atilde;o democr&aacute;tica como um direito</span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">.</span> A partir deste momento, a a&ccedil;&atilde;o das pessoas envolvidas constr&oacute;i aquilo que essas pessoas querem construir, que pode ser uma comunidade de aprendizagem ou outra coisa que n&atilde;o pensamos ainda. Em um espa&ccedil;o verdadeiramente democr&aacute;tico, as pessoas s&atilde;o livres para falar, para pensar e para agir, e essa </span><strong>liberdade coletiva se autorregula</strong><span style="font-weight: 400;">, porque &eacute; sempre mediada pelos outros. Em um processo como este, n&atilde;o h&aacute; necessidade de termos medo de que a liberdade seja &ldquo;excessiva&rdquo; ou que fa&ccedil;a mal para algu&eacute;m.&nbsp;</span></p>
<p><span style="font-weight: 400;">Ent&atilde;o, conforme Zucchetti, Grabowski e Lamb (2023), na Escola Municipal</span><span style="font-weight: 400;"> </span><span style="font-weight: 400;">Adolfina, existe uma grande <strong>comunidade de aprendizagem</strong> que inclui a escola inteira, mas tamb&eacute;m se divide em outras menores, como as comiss&otilde;es, os grupos de pesquisa, as assembleias, as turmas. Cada uma suprindo necessidades diferentes, em diferentes tempos e com diferentes pessoas.</span></p>

<div id="recursos-azul"><!-- Box Refletir - titulo video texto -->
<div id="box-refletir">
<div class="box-refletir-blue">
<div class="header-box-refletir">
<p class="caixa-de-destaque-titulo titulo">Para refletir: participa&ccedil;&atilde;o e gest&atilde;o democr&aacute;tica</p>
</div>
<div class="box-refletir-container">
<div><iframe title="YouTube video player" width="100%" height="415" src="https://www.youtube.com/embed/wm4nZtTLvNE?si=4RpHSXIuo4Pq4gcS" data-mce-fragment="1"></iframe></div>
<div>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Participa&ccedil;&atilde;o e gest&atilde;o democr&aacute;tica na <span style="font-weight: 400;">Prof&ordf; Adolfina J. M. Diefenth&auml;ler</span><strong><span><br />Fonte:&nbsp;</span></strong>T4 Education (2022).</p>
</div>
<div>
<p>Sugerimos que voc&ecirc; assista o video acima e possa refletir:</p>
<p>a) Quais os desafios em sua institui&ccedil;&atilde;o de EPT voc&ecirc; observa em rela&ccedil;&atilde;o ao desenvolvimento ao planejamento participativo e a avalia&ccedil;&atilde;o institucional?</p>
<p>b) Quais elementos do seu contexto de atua&ccedil;&atilde;o ajudariam a concretizar uma participa&ccedil;&atilde;o emancipat&oacute;ria que fortale&ccedil;a a constru&ccedil;&atilde;o de comunidades de aprendizagem na EPT?</p>
<p class="destaque texto">Registre suas ideias em seu&nbsp;<strong>Memorial&nbsp;</strong>e/ou siga as instru&ccedil;&otilde;es de seu tutor.</p>
</div>
</div>
</div>
</div>
</div>
</div>
<p>&nbsp;</p>
<div class="col-md-6 offset-md-3 content-page">

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina12.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="consideracoes.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 13 de 18</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>