<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo Comum</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        <li class="nav-item">
          <a class="nav-link" id="acessilibityMain" href="#body">Ir para conteúdo 1</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="" href="#header">Ir para o menu 2</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo 3</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé 4</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo Comum - Trabalho e Educação: Fundamentos teóricos e didáticos II
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>A politecnia e sua efetiva&ccedil;&atilde;o na EPT</strong></p>

<p>A hist&oacute;ria da EPT no Brasil evidencia, atrav&eacute;s de discursos, legisla&ccedil;&otilde;es, programas e planos implementados, as disputas por hegemonia que ora s&atilde;o de cunho liberal, ora neoliberal, ora progressista. Quando essa modalidade educacional surgiu no pa&iacute;s, preponderaram finalidades assistencialistas e de conten&ccedil;&atilde;o social. Contudo, com o crescimento e a diversifica&ccedil;&atilde;o das atividades econ&ocirc;micas, ela passou a ser regulada pelas for&ccedil;as do mercado, ampliando seu car&aacute;ter de educa&ccedil;&atilde;o instrumental, tecnicista e dual.</p>


<div id="recursos-azul" class="feat-box-foto">

<p>No entanto, para ser efetivamente um instrumento de aut&ecirc;ntica representa&ccedil;&atilde;o da classe trabalhadora, &eacute; preciso reivindicar espa&ccedil;os e perspectivas de emancipa&ccedil;&atilde;o humana e de transforma&ccedil;&atilde;o social embasadas em propostas de educa&ccedil;&atilde;o omnilateral e tamb&eacute;m <strong>polit&eacute;cnica</strong>.</p>
<p>Mas, afinal, o que vem a ser politecnia? Como pensar a sua efetiva&ccedil;&atilde;o na EPT?</p>

</div>

<p>Podemos inferir, pois, que o alcance de uma educa&ccedil;&atilde;o profissional e tecnol&oacute;gica cr&iacute;tica e emancipat&oacute;ria requer a <span style="background-color: #c2e0f4;">supera&ccedil;&atilde;o do discurso e das pr&aacute;ticas pedag&oacute;gicas hegem&ocirc;nicas e o deslocamento da centralidade no mercado de trabalho para a primordialidade do mundo do trabalho.</span> Esse deslocamento &eacute; fundamental &agrave; forma&ccedil;&atilde;o de trabalhadores cr&iacute;ticos, socialmente ativos e emancipados.</p>
<p>Nesse sentido, voc&ecirc; conseguiria reconhecer os indicadores do discurso hegem&ocirc;nico dificultadores da sua supera&ccedil;&atilde;o? E, tamb&eacute;m, as no&ccedil;&otilde;es que fundamentam esse discurso transformando-as em objeto de reflex&atilde;o? Conseguiria esclarecer outros enunciados e pr&aacute;ticas capazes de abrir caminho para estrat&eacute;gias contra-hegem&ocirc;nicas, em favor da EPT emancipat&oacute;ria? Seria capaz de desnudar a discursividade hegem&ocirc;nica e como ela escamoteia a realidade na forma de senso comum? Como desvendar as formas dominantes de impor a obedi&ecirc;ncia e da explora&ccedil;&atilde;o do trabalho assalariado?</p>
<p>Em seus processos formativos, a EPT deve ampliar a vis&atilde;o de mundo dos estudantes por meio de reflex&otilde;es e pr&aacute;ticas fundamentadas pelas &ldquo;[...] tens&otilde;es no campo das ideias, inspirando e orientando a a&ccedil;&atilde;o pol&iacute;tica de toda a classe trabalhadora&rdquo; (Barros; Silva, 2021, p.128). Valores, cren&ccedil;as, impress&otilde;es, sentimentos e concep&ccedil;&otilde;es remetem a diferentes percep&ccedil;&otilde;es do mundo do trabalho e das diferentes dimens&otilde;es que o comportam, dentre elas a l&oacute;gica mercantil que preside a compra e venda da for&ccedil;a de trabalho com todas as suas contradi&ccedil;&otilde;es.</p>
<p>O que est&aacute; em quest&atilde;o, aqui, &eacute; <span style="background-color: #c2e0f4;">a necessidade de desenvolvimento da EPT capaz de p&ocirc;r em pr&aacute;tica uma educa&ccedil;&atilde;o omnilateral, tecnol&oacute;gica ou polit&eacute;cnica formadora de sujeitos aut&ocirc;nomos e protagonistas da cidadania ativa.</span></p>
<p>Dotada da perspectiva do trabalho como princ&iacute;pio educativo e da forma&ccedil;&atilde;o dos sujeitos por meio do desenvolvimento do pensamento reflexivo mais complexo e cr&iacute;tico, a EPT se imp&otilde;e &agrave; condu&ccedil;&atilde;o da interpreta&ccedil;&atilde;o das contradi&ccedil;&otilde;es da realidade com vistas &agrave; sua supera&ccedil;&atilde;o e &agrave; forma&ccedil;&atilde;o de sujeitos n&atilde;o mais ref&eacute;ns do discurso hegem&ocirc;nico como &uacute;nica e &uacute;ltima possibilidade.</p>

<div id="recursos-azul" class="feat-box-foto">
<div class="container-fluid image-paragraph">
<div class="row justify-content-center paragrafo-com-card-curso">
<div class="col-sm-12 col-md-12 col-lg-7 col-xl-8">

<div id="recursos-azul" class="quote-2" style="display: block;">
<p class="quote citacao-longa" style="text-align: left;"><span style="color: #000000;">Nessa altura, voc&ecirc; deve perceber que a busca por esse movimento contra-hegem&ocirc;nico n&atilde;o &eacute; uma a&ccedil;&atilde;o simples. <br /><br />Isso ocorre porque se trata de uma busca que passa pela perspectiva do desenvolvimento humano em suas m&uacute;ltiplas dimens&otilde;es (omnilateralidade), da escola unit&aacute;ria e polit&eacute;cnica, como forma de efetivar a supera&ccedil;&atilde;o das dicotomias entre educa&ccedil;&atilde;o geral versus espec&iacute;fica, humanista versus t&eacute;cnica, te&oacute;rica versus pr&aacute;tica, profissional t&eacute;cnico versus pol&iacute;tico etc. <br /><br />Voc&ecirc; saberia dizer quais s&atilde;o as medidas que a Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica precisa adotar urgentemente? Vamos refletir juntos.</span></p>
<br />
<div class="author citacao-longa-autoria">Maria Cristina Caminha de Castilhos Fran&ccedil;a<br /><br /></div>
</div>

</div>
<div class="col-sm-6 col-md-8 col-lg-5 col-xl-4"><img class="card-curso-topo-image" src="medias/Foto autora.png" alt="card do curso" width="100%" /></div>
</div>
</div>
</div>

<p>Para come&ccedil;o de conversa, seria necess&aacute;rio que as propostas pedag&oacute;gicas partissem dos saberes e das experi&ecirc;ncias j&aacute; adquiridos pelos estudantes e das suas experi&ecirc;ncias de pr&aacute;ticas laborais. Um passo al&eacute;m seria dado pela satura&ccedil;&atilde;o de saberes sobre o uso e as finalidades dos instrumentos de trabalho, fazendo-os interagir com os conhecimentos cient&iacute;ficos e tecnol&oacute;gicos. Tudo isso considerando aspectos de ordem cultural, &eacute;tica e pol&iacute;tica para que os estudantes se vejam concretamente como sujeitos ativos.</p>
<p>Aqui entra a proposta da <strong>educa&ccedil;&atilde;o polit&eacute;cnica </strong>como alternativa para a supera&ccedil;&atilde;o da dualidade estrutural e fragmentadora da educa&ccedil;&atilde;o profissional e tecnol&oacute;gica; portanto, da &ldquo;[...] dicotomia entre trabalho manual e trabalho intelectual, entre instru&ccedil;&atilde;o profissional e instru&ccedil;&atilde;o geral&rdquo; (Saviani, 1989, p. 13).</p>
<p>A educa&ccedil;&atilde;o polit&eacute;cnica, conforme explica Saviani (1989), entende o <span style="background-color: #c2e0f4;">trabalho como unidade indissoci&aacute;vel, n&atilde;o sendo poss&iacute;vel a separa&ccedil;&atilde;o entre elementos manuais e intelectuais nele envolvidos.</span> Essa dissocia&ccedil;&atilde;o somente seria permitida como produto hist&oacute;rico-social a ser superado; portanto, n&atilde;o absoluta, mas relativa. Desse modo, a educa&ccedil;&atilde;o n&atilde;o poderia ser dividida entre geral e espec&iacute;fica, j&aacute; que a forma&ccedil;&atilde;o ampla do trabalhador precisa ter em vista sua capacidade de apropria&ccedil;&atilde;o da t&eacute;cnica como ci&ecirc;ncia e cultura.</p>
<p>Saviani (1989, p. 17) recorda que a <strong>politecnia </strong>est&aacute; vinculada ao &ldquo;[...] dom&iacute;nio dos fundamentos cient&iacute;ficos das diferentes t&eacute;cnicas que caracterizam o processo de trabalho produtivo moderno&rdquo;. Nesses termos,</p>
<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Sup&otilde;e-se que, dominando esses fundamentos, esses princ&iacute;pios, o trabalhador est&aacute; em condi&ccedil;&otilde;es de desenvolver as diferentes modalidades de trabalho, com a compreens&atilde;o do seu car&aacute;ter, da sua ess&ecirc;ncia. N&atilde;o se trata de um trabalhador que &eacute; adestrado para executar com perfei&ccedil;&atilde;o determinada tarefa, e que se encaixe no mercado de trabalho para desenvolver aquele tipo de habilidade. Ele ter&aacute; um desenvolvimento multilateral, um desenvolvimento que abarca todos os &acirc;ngulos da pr&aacute;tica produtiva moderna, na medida em que ele domina aqueles princ&iacute;pios, aqueles fundamentos, que est&atilde;o na base da organiza&ccedil;&atilde;o da produ&ccedil;&atilde;o moderna.</p>
<div class="author citacao-longa-autoria">(Saviani, 1989, p. 17)</div>
</div>
<p>&nbsp;</p>


<p><img class="card-curso-topo-image" src="medias/TE2_ILU_005.png" alt="card do curso" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>A complexidade do trabalho <span style="font-weight: 400;">t&eacute;cnico envolvendo diferentes saberes<br /></span><span style="font-weight: 400;"><strong>Fonte: </strong>Prosa (2024e).</span></p>

<p>A politecnia &eacute; um conceito realmente muito interessante e relevante, por sua pr&oacute;pria natureza, no &acirc;mbito da EPT. Voc&ecirc; pode aprofundar seu entendimento desse conceito e seus impactos atrav&eacute;s da leitura do artigo <a rel="noopener" href="https://www.scielo.br/j/tes/a/zLgxpxrzCX5GYtgFpr7VbhG/" target="_blank">O choque te&oacute;rico da politecnia</a>, do professor Dermeval Saviani (2003).</p>
<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="parte1.pagina4.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="parte1.pagina6.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 7 de 24</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>