<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo Comum</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        <li class="nav-item">
          <a class="nav-link" id="acessilibityMain" href="#body">Ir para conteúdo 1</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="" href="#header">Ir para o menu 2</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo 3</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé 4</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo Comum - Trabalho e Educação: Fundamentos teóricos e didáticos II
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Voc&ecirc; sabe o que &eacute; o ensino integrado?</strong></p>

<p class="content paragrafo"><span style="color: #000000;">Agora, vamos aprofundar o que &eacute; <strong>ensino integrado. </strong>F</span>rigotto e Ara&uacute;jo assinalam que, para al&eacute;m da educa&ccedil;&atilde;o profissional de n&iacute;vel m&eacute;dio, o ensino integrado<!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">[...] &eacute; uma proposi&ccedil;&atilde;o pedag&oacute;gica que se compromete com a utopia de uma forma&ccedil;&atilde;o inteira, que n&atilde;o se satisfaz com a socializa&ccedil;&atilde;o de fragmentos da cultura sistematizada e que compreende como direito de todos o acesso a um processo formativo, inclusive escolar, que promova o desenvolvimento de suas amplas faculdades f&iacute;sicas e intelectuais.</p>
<div class="author citacao-longa-autoria">(Frigotto e Ara&uacute;jo, 2018, p. 50)&nbsp;</div>
</div>


<p class="paragrafo">De forma a complementar, Ciavatta (2010) afirma que integrar vai &ldquo;[...] no sentido de completude, de compreens&atilde;o das partes no seu todo ou da unidade no diverso, de tratar a educa&ccedil;&atilde;o [...] nas m&uacute;ltiplas media&ccedil;&otilde;es hist&oacute;ricas que concretizam os processos educativos&rdquo; (p.84).&nbsp;</p>
<p class="paragrafo">A forma&ccedil;&atilde;o integral pressup&otilde;e o desenvolvimento integrado dos sujeitos mediante uma proposta de ensino que preconiza a amplia&ccedil;&atilde;o cognitiva, a partir da correla&ccedil;&atilde;o das diversas dimens&otilde;es estruturantes da vida: <strong>trabalho, ci&ecirc;ncia, tecnologia e cultura.</strong></p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/TE2_INFO_011.png" alt="card do curso" width="75%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>As correla&ccedil;&otilde;es entre as estruturas de vida do indiv&iacute;duo<strong><br />Fonte: </strong>Prosa (2024e).</p>

<p class="paragrafo">A import&acirc;ncia dessa perspectiva est&aacute; na supera&ccedil;&atilde;o da fragmenta&ccedil;&atilde;o que, historicamente, foi imposta ao ser humano pela divis&atilde;o social do trabalho, pela cis&atilde;o da sociedade de classes e todas as contradi&ccedil;&otilde;es promovidas pelo modo de produ&ccedil;&atilde;o capitalista.</p>
<p class="paragrafo">Retomamos, aqui, a <strong>vis&atilde;o dual ou fragmentada </strong>apresentada no <span style="color: #000000;">cap&iacute;tulo I</span>, que &eacute; a express&atilde;o da totalidade social segmentada desde o<strong> </strong>Brasil Col&ocirc;nia<strong> </strong>e que resulta das rela&ccedil;&otilde;es materiais, sociais e culturais de produ&ccedil;&atilde;o.&nbsp;</p>
<div class="container-fluid image-paragraph">
<div class="row justify-content-center paragrafo-com-card-curso">
<div class="col-sm-12 col-md-12 col-lg-7 col-xl-8">
<p>Vamos iniciar essa reflex&atilde;o, quest&atilde;o que surge ainda no Imp&eacute;rio. Segundo Salm (1986, p. 74), o problema que assalta o pensamento conservador &eacute;: &ldquo;o que fazer com os pobres? E a resposta sempre foi: ensinar um of&iacute;cio&rdquo;.&nbsp;</p>
<p class="paragrafo">&nbsp;</p>
<p class="paragrafo">A receita educacional remete, hoje, &agrave; proposta de profissionaliza&ccedil;&atilde;o sob a perspectiva economicista da educa&ccedil;&atilde;o e da pedagogia tecnicista, atualizada &agrave; medida que se alteram as demandas de forma&ccedil;&atilde;o da for&ccedil;a de trabalho feitas pelo sistema produtivo e na sociedade de classes brasileira.&nbsp;</p>
<p class="paragrafo">&nbsp;</p>
<p class="paragrafo">Ou seja, isso quer dizer que a prepara&ccedil;&atilde;o para o trabalho &eacute; reduzida ao aspecto puramente <strong>operacional</strong>, simplificado e esvaziado dos conhecimentos de ordem <strong>reflexiva e emancipat&oacute;ria</strong>. &Eacute;, em s&iacute;ntese, a forma&ccedil;&atilde;o da classe trabalhadora subordinada aos interesses da classe dos propriet&aacute;rios dos meios de produ&ccedil;&atilde;o, voltada ao trabalho manual, ao praticismo, ao trabalho simples.</p>
<p class="paragrafo">&nbsp;</p>
<p class="paragrafo"><strong>Para compreender melhor a perspectiva economicista da educa&ccedil;&atilde;o, retornamos no tempo.</strong></p>
<p class="paragrafo">&nbsp;</p>
<p class="paragrafo">&Eacute; a partir da d&eacute;cada de 1940, com as leis org&acirc;nicas (Reforma Capanema) criadas para organizar a educa&ccedil;&atilde;o nacional, que o dualismo da educa&ccedil;&atilde;o (segundo a orienta&ccedil;&atilde;o de classe) se afirma com seu car&aacute;ter estrutural. Al&eacute;m disso, os ensinos profissionais s&atilde;o concebidos como subsistemas e &agrave; parte do ensino com car&aacute;ter proped&ecirc;utico, ou seja, preparat&oacute;rio &agrave; continuidade dos estudos.&nbsp;</p>
<p class="paragrafo">&nbsp;</p>
<p class="paragrafo">Das leis org&acirc;nicas do ensino decorre, ent&atilde;o, a seguinte segmenta&ccedil;&atilde;o: de um lado, uma vertente dirigida &agrave; forma&ccedil;&atilde;o proped&ecirc;utica das elites dirigentes e &agrave; continuidade dos seus estudos nas universidades; de outro, o ensino profissional, destinado aos segmentos sociais populares e menos favorecidos.&nbsp;</p>

</div>
<div class="col-sm-6 col-md-8 col-lg-5 col-xl-4">
<div id="recursos-azul" class="feat-box-foto" style="font-size: smaller;">
<div class="title caixa-de-destaque-titulo">Saiba mais...</div>

<p class="content destaque" style="padding-top: 0px !important; line-height: 1.7;">&Eacute; nessa estrutura colonial que as ra&iacute;zes do dualismo das classes sociais e a desigualdade de acesso aos bens e servi&ccedil;os socialmente produzidos se fixam no tecido social. Um dos aspectos que fundamentam essa estrutura &eacute; o escravismo e a discrimina&ccedil;&atilde;o do trabalho manual.<br />Para saber mais, sugere-se CIAVATTA, Maria.<strong> </strong>A forma&ccedil;&atilde;o integrada: a escola e o trabalho como lugares de mem&oacute;ria e de identidade.<em><a href="https://www.researchgate.net/publication/325954886_A_FORMACAO_INTEGRADA_A_ESCOLA_E_O_TRABALHO_COMO_LUGARES_DE_MEMORIA_E_DE_IDENTIDADE">&nbsp;</a></em></p>

</div>
</div>
</div>
</div>




<p><img class="card-curso-topo-image" src="medias/TE2_ILU_012.PNG" alt="card do curso" width="100%" /></p>
<p class="legenda" style="line-height: 1.2; text-align: center;"><strong>T&iacute;tulo: </strong>Forma&ccedil;&atilde;o proped&ecirc;utica das elites X ensino profissional<br /><strong>Fonte:</strong> Prosa (2024g).</p>


<p class="paragrafo">A Reforma Capanema se perpetuou por 20 anos e contribuiu para consolidar o dualismo na educa&ccedil;&atilde;o em conson&acirc;ncia com a estrutura social brasileira.&nbsp;</p>

<div id="recursos-azul" class="feat-box-foto">
<p>A Reforma Capanema (refer&ecirc;ncia a Gustavo Capanema, ent&atilde;o Ministro da Educa&ccedil;&atilde;o e Sa&uacute;de, 1934-1945, no governo de Get&uacute;lio Vargas), sob o nome de Leis Org&acirc;nicas do Ensino, que compreendem um conjunto de decretos-lei, estruturou o ensino industrial, reformou o ensino comercial e criou o Servi&ccedil;o Nacional de Aprendizagem Industrial &ndash; SENAI, como tamb&eacute;m trouxe mudan&ccedil;as no ensino secund&aacute;rio.&nbsp;<br />Foram publicados os seguintes decretos-lei:</p>
<ul>
<li>Decreto-lei n. 4.073, de 30 de janeiro de 1942, que organizou o ensino industrial;</li>
<li>Decreto-lei n. 4.048, de 22 de janeiro de 1942, que instituiu o SENAI;</li>
<li>Decreto-lei n. 4.244 de 9 de abril de 1942, que organizou o ensino secund&aacute;rio em dois ciclos: o ginasial, com quatro anos, e o colegial, com tr&ecirc;s anos;</li>
<li>Decreto-lei n. 6.141, de 28 de dezembro de 1943, que reformou o ensino comercial.</li>
</ul>
<p>O conjunto desses decretos teve, para a educa&ccedil;&atilde;o profissional, a determina&ccedil;&atilde;o expressa da heran&ccedil;a dualista, quando determinou que o ensino secund&aacute;rio e o ensino normal tinham como objetivo &ldquo;formar as elites condutoras do pa&iacute;s&rdquo;, enquanto ao ensino profissional o objetivo era oferecer &ldquo;forma&ccedil;&atilde;o adequada aos filhos dos oper&aacute;rios, aos desvalidos da sorte e aos menos afortunados, aqueles que necessitam ingressar precocemente na for&ccedil;a de trabalho&rdquo;. Observa-se que a Reforma Capanema, por meio das suas diretrizes, promoveu a organiza&ccedil;&atilde;o e a padroniza&ccedil;&atilde;o da dualidade do aparelho escolar.</p>
<p>O processo de industrializa&ccedil;&atilde;o no Brasil, ainda que desenvolvido de forma lenta, exigia uma nova forma&ccedil;&atilde;o de trabalhadores voltada &agrave; ind&uacute;stria: uma aprendizagem que introduzisse a adapta&ccedil;&atilde;o do trabalhador &agrave;s necessidades e ao ritmo da m&aacute;quina e de maneira a disciplinar a for&ccedil;a de trabalho. No entanto, a subdivis&atilde;o e a fragmenta&ccedil;&atilde;o do trabalho promoveram a perpetua&ccedil;&atilde;o do dom&iacute;nio do capital e a amplia&ccedil;&atilde;o da explora&ccedil;&atilde;o do trabalhador (extra&ccedil;&atilde;o da mais-valia), considerando o aumento da intensidade do trabalho.</p>
<p>Para uma discuss&atilde;o mais aprofundada sobre a Reforma Capanema, voc&ecirc; pode ler o artigo <a rel="noopener" href="https://www2.ifrn.edu.br/ojs/index.php/HOLOS/article/view/6981" target="_blank">Organiza&ccedil;&atilde;o e estrutura da educa&ccedil;&atilde;o profissional no Brasil: da Reforma Capanema &agrave;s leis de equival&ecirc;ncia</a>, das professoras Ol&iacute;via Medeiros, Eva L&iacute;dia, Juliana Barbosa e Francinaide Nascimento.</p>

</div>


<p class="paragrafo">Em 1961, foi promulgada a<a rel="noopener" href="https://www2.camara.leg.br/legin/fed/lei/1960-1969/lei-4024-20-dezembro-1961-353722-publicacaooriginal-1-pl.html#:~:text=Fixa%20as%20Diretrizes%20e%20Bases%20da%20Educa%C3%A7%C3%A3o%20Nacional.&amp;text=a%20condena%C3%A7%C3%A3o%20a%20qualquer%20tratamento,de%20classe%20ou%20de%20ra%C3%A7a" target="_blank"> Lei de Diretrizes e Bases da Educa&ccedil;&atilde;o Nacional (LDB)</a>, &nbsp;Lei n&ordm; 4.024 de 20 de dezembro de 1961. Ela contemplou a educa&ccedil;&atilde;o como um <strong>&ldquo;dever e direito de todos&rdquo;</strong> (Art. 2) e a equival&ecirc;ncia dos cursos de n&iacute;vel m&eacute;dio (Art. 51). No entanto, o que predominou foi a omiss&atilde;o em face da realidade educacional e social desigual, traduzida tamb&eacute;m pela falta de escolas, professores e materiais.&nbsp;</p>
<p class="paragrafo">A obrigatoriedade de oferta de educa&ccedil;&atilde;o b&aacute;sica levou &agrave; institucionaliza&ccedil;&atilde;o (pelo menos formal) do princ&iacute;pio da igualdade de oportunidades. Disseminou-se, tamb&eacute;m, a expectativa de mobilidade e ascens&atilde;o social das camadas m&eacute;dias e populares pela via da educa&ccedil;&atilde;o; entretanto, a submiss&atilde;o aos <strong>padr&otilde;es discricion&aacute;rios </strong>de sele&ccedil;&atilde;o escolar as induziu a assumir a culpa pela sua pr&oacute;pria falta de &ecirc;xito. Al&eacute;m disso, as aspira&ccedil;&otilde;es de conquistar um t&iacute;tulo acad&ecirc;mico se esbarram na necessidade de trabalhar para o sustento pr&oacute;prio ou da fam&iacute;lia, levando os setores populares a buscarem cursos de n&iacute;vel m&eacute;dio profissionalizantes, &ldquo;[...] na maioria, ministrados &agrave; noite e menos exigentes quanto ao gin&aacute;sio e ao col&eacute;gio&rdquo; (Freitag, 1984, p.67).&nbsp;</p>
<p class="paragrafo">O setor privado, acolhido favoravelmente pela Lei n&ordm; 4024 de 20 de dezembro de 1961 e motivado a explorar a educa&ccedil;&atilde;o como neg&oacute;cio, apoderou-se dos cursos profissionalizantes que exigiam pouco investimento de infraestrutura, como tamb&eacute;m da contrata&ccedil;&atilde;o de professores n&atilde;o habilitados e pouco qualificados. &nbsp;</p>
<p class="paragrafo">Por conta das demandas do p&uacute;blico-alvo (trabalhadores), ansioso por ascender ao ensino universit&aacute;rio, e das brechas oferecidas pela Lei n&ordm; 4024 de 20 de dezembro de 1961, os cursos profissionalizantes, que deveriam fornecer qualifica&ccedil;&otilde;es m&eacute;dias para o mercado de trabalho, foram gradativamente se aproximando da forma&ccedil;&atilde;o proped&ecirc;utica.</p>
<p class="paragrafo">Assim, o setor produtivo denuncia a inadequa&ccedil;&atilde;o do ensino profissionalizante m&eacute;dio, o qual, por sua vez, passa a exigir a responsabilidade das empresas pela qualifica&ccedil;&atilde;o no pr&oacute;prio ambiente de trabalho. Esse impasse leva &agrave; reivindica&ccedil;&atilde;o de maior participa&ccedil;&atilde;o do sistema educacional na capacita&ccedil;&atilde;o profissional, tanto para contribuir com o aumento da produtividade econ&ocirc;mica quanto para assumir os custos da qualifica&ccedil;&atilde;o da for&ccedil;a de trabalho.</p>
<p class="paragrafo">A partir de 1964, sob as r&eacute;deas do regime militar, o governo brasileiro&nbsp; passou a ajustar o sistema educacional de maneira que fossem cumpridas, da forma mais conveniente ao capital, as fun&ccedil;&otilde;es de reprodu&ccedil;&atilde;o e manuten&ccedil;&atilde;o das rela&ccedil;&otilde;es de produ&ccedil;&atilde;o dominantes. A educa&ccedil;&atilde;o, sob a &eacute;gide da <strong>Teoria do Capital Humano</strong>, que postula a educa&ccedil;&atilde;o principalmente como fator de desenvolvimento econ&ocirc;mico, em uma perspectiva economicista que passou a identificar a educa&ccedil;&atilde;o como um ativo produtor de lucro social e individual. Com tais fundamentos economicistas, o Estado brasileiro passou a bancar os gastos realizados com a qualifica&ccedil;&atilde;o dos trabalhadores e, consequentemente, a atender &agrave;s reivindica&ccedil;&otilde;es dos setores privados nacional e multinacional.&nbsp;</p>


<div id="webstories" class="container">
<div class="row justify-content-center justify-content-md-start">
<div class="col-12 col-sm-12 col-md-12 col-lg-12 col-xl-12" style="padding-top: 15px; padding-bottom: 15px;">
<div id="swiffy-animation" class="swiffy-slider slider-item-ratio slider-item-ratio-16x9 slider-nav-visible slider-nav-animation slider-nav-animation-fadein slider-item-first-visible" style="height: 600px;">
<ul id="container1" class="slider-container">
<li id="slide1" class="slide-visible"><img style="object-fit: contain;" src="medias/TE2_WEB_013.png" alt="..." width="200" /></li>
<li id="slide2"><img style="object-fit: contain;" src="medias/TE2_WEB_013.2.png" alt="..." width="200" /></li>
<li id="slide3"><img style="object-fit: contain;" src="medias/TE2_WEB_013.3.png" alt="..." width="200" /></li>
<li id="slide4"><img style="object-fit: contain;" src="medias/TE2_WEB_013.4.png" alt="..." width="200" /></li>
<li id="slide5"><img style="object-fit: contain;" src="medias/TE2_WEB_013.05.png" alt="..." width="200" /></li>
</ul>
<button class="slider-nav" style="--swiffy-slider-nav-light: #525AD2; outline: none;" aria-label="Go to previous" type="button"></button> <button class="slider-nav slider-nav-next" style="--swiffy-slider-nav-light: #525AD2; outline: none;" aria-label="Go to next" type="button"></button>
<div class="slider-indicators"><button class="active" aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button></div>
</div>
</div>
</div>
</div>



<div id="recursos-azul" class="feat-box-foto">

<p><span style="font-weight: 400;">Leia mais em </span><span style="font-weight: 400;"><a rel="noopener" href="https://www.reveduc.ufscar.br/index.php/reveduc/article/view/4424/1092" target="_blank">Educa&ccedil;&atilde;o e a ditadura civil militar: as reformas educacionais e a teoria do capital humano (1964-85)</a>.</span></p>

</div>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="parte2.pagina1.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="parte2.pagina3.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 11 de 24</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>