<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo Comum</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        <li class="nav-item">
          <a class="nav-link" id="acessilibityMain" href="#body">Ir para conteúdo 1</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="" href="#header">Ir para o menu 2</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo 3</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé 4</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo Comum - Trabalho e Educação: Fundamentos teóricos e didáticos II
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>O que &eacute; pr&aacute;xis?</strong></p>

<p>Ao longo da hist&oacute;ria, atrav&eacute;s do capitalismo, a complexidade das opera&ccedil;&otilde;es de trabalho avan&ccedil;ou para solucionar as necessidades humanas, mas isso foi fundamentado na valoriza&ccedil;&atilde;o do trabalho intelectual em detrimento do trabalho f&iacute;sico. Dessa forma, o trabalho passou a ser referido com base em conceitos abstratos de natureza reflexiva (como valores, moral e &eacute;tica), com expressivas consequ&ecirc;ncias para a hierarquiza&ccedil;&atilde;o entre os saberes te&oacute;rico e pr&aacute;tico.</p>
<p>Essa oposi&ccedil;&atilde;o entre teoria e pr&aacute;tica &eacute; produto do decl&iacute;nio da categoria <strong>pr&aacute;xis</strong>. Isto &eacute;, conforme V&aacute;zquez (2011), <span style="background-color: #c2e0f4;">a pr&aacute;xis n&atilde;o &eacute; um produto da rela&ccedil;&atilde;o entre teoria e pr&aacute;tica, mas sim teoria e pr&aacute;tica como produto da a&ccedil;&atilde;o dial&eacute;tica.</span> Assim, a teoria, por mais que tenha tomado por base o pr&oacute;prio conhecimento te&oacute;rico, sempre &eacute; decorr&ecirc;ncia de uma concep&ccedil;&atilde;o pr&aacute;tica do mundo, ou seja, de uma pr&aacute;xis.&nbsp;<!-- Citação longa --></p>
<p>&nbsp;</p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Enquanto a atividade pr&aacute;tica pressup&otilde;e uma a&ccedil;&atilde;o efetiva sobre o mundo, que tem como resultado uma transforma&ccedil;&atilde;o real deste, a atividade te&oacute;rica apenas transforma a nossa consci&ecirc;ncia dos fatos, nossas ideias sobre as coisas, mas n&atilde;o as pr&oacute;prias coisas. Nesse sentido, cabe falar de uma oposi&ccedil;&atilde;o teoria e pr&aacute;tica.</p>
<div class="author citacao-longa-autoria">(V&aacute;squez, 2011, p. 241)</div>
</div>

<p>Essa oposi&ccedil;&atilde;o &eacute; apenas em termos de finalidade, pois s&atilde;o ocupa&ccedil;&otilde;es diferentes e cada uma possui atribui&ccedil;&otilde;es pr&oacute;prias.</p>
<p>O processo de supera&ccedil;&atilde;o da sociedade dividida, unilateral, do desenvolvimento rompido das individualidades e da humanidade inteira, vir&aacute; da classe social exclu&iacute;da dos bens materiais e intelectuais. Ao libertar-se da aliena&ccedil;&atilde;o, al&eacute;m dos trabalhadores, a classe dominante tamb&eacute;m ser&aacute; liberta da ociosidade que a aliena. Na &ldquo;emancipa&ccedil;&atilde;o do oper&aacute;rio est&aacute; impl&iacute;cita a emancipa&ccedil;&atilde;o humana geral&rdquo; (Manacorda, 2017, p. 87).</p>
<p>Contudo, para que esse movimento de liberta&ccedil;&atilde;o aconte&ccedil;a, uma das condi&ccedil;&otilde;es &eacute; o cuidado com a omnilateralidade no desenvolvimento humano, para o qual &eacute; de fundamental import&acirc;ncia a reunifica&ccedil;&atilde;o das estruturas da ci&ecirc;ncia com as estruturas da produ&ccedil;&atilde;o. Para tanto, concorre a educa&ccedil;&atilde;o tecnol&oacute;gica, te&oacute;rico-pr&aacute;tica. Ou seja,<!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">A concep&ccedil;&atilde;o de homem real n&atilde;o apenas como te&oacute;rico, mas, sim, como ser pr&aacute;tico (ou mais exatamente, te&oacute;rico-pr&aacute;tico) que desenvolve a sua atividade material transformadora como um ser hist&oacute;rico-social. Por conseguinte, a verdadeira caracteriza&ccedil;&atilde;o do marxismo tem que ser feita a partir do reconhecimento do lugar central que nele ocupa a categoria de pr&aacute;xis. [...] Partindo dessa concep&ccedil;&atilde;o de Marx, <strong>entendemos a pr&aacute;xis como atividade material humana transformadora do mundo e do pr&oacute;prio homem. Essa atividade real, objetiva, &eacute;, ao mesmo tempo, ideal, subjetiva e consciente. Por isso, insistimos na unidade entre teoria e pr&aacute;tica, unidade que tamb&eacute;m implica certa distin&ccedil;&atilde;o e relativa autonomia. A pr&aacute;xis n&atilde;o tem para n&oacute;s um &acirc;mbito t&atilde;o amplo que possa, inclusive, englobar a atividade te&oacute;rica em si, nem t&atilde;o limitado que se reduza a uma atividade apenas material.</strong></p>
<div class="author citacao-longa-autoria">(V&aacute;zquez, 2011, p. 398, grifo nosso)</div>
</div>

<p>A categoria pr&aacute;xis &eacute; contr&aacute;ria &agrave; no&ccedil;&atilde;o de experi&ecirc;ncia relacionada ao pragmatismo. Como tal, a pr&aacute;xis deve ser necessariamente &ldquo;apreendida como o princ&iacute;pio filos&oacute;fico e epistemol&oacute;gico estruturante da forma&ccedil;&atilde;o, do que decorre o trabalho como princ&iacute;pio educativo&rdquo; (Ramos, 2013, p. 195).</p>
<p>Como podemos observar, o car&aacute;ter educativo est&aacute; presente nas formula&ccedil;&otilde;es marxistas amplas, mas, aqui, nos deteremos nos conceitos de trabalho e pr&aacute;xis e na proje&ccedil;&atilde;o de um novo homem (re)envolto no processo de humaniza&ccedil;&atilde;o.&nbsp;</p>
<p>A forma&ccedil;&atilde;o pretendida &eacute; a <span style="background-color: #c2e0f4;">emancipa&ccedil;&atilde;o como indiv&iacute;duo social, omnilateral, fruto da associa&ccedil;&atilde;o do trabalho concreto e do ensino em uma escola essencialmente tecnol&oacute;gica.</span> N&atilde;o h&aacute; como desconsiderar que h&aacute; diversas formas de existir/ser da classe trabalhadora. Por conseguinte, a classe dos trabalhadores, resultante da divis&atilde;o social do trabalho, constitui-se permeada por diferentes conhecimentos especializados de acordo com as pr&aacute;ticas profissionais espec&iacute;ficas ou saberes profissionais.</p>
<p>Segundo Sousa Jr. (2009), a educa&ccedil;&atilde;o de base marxista tem os seguintes elementos como pilares: o trabalho, a escola e a pr&aacute;xis pol&iacute;tico-educativa. Estes atuam em contraposi&ccedil;&atilde;o &agrave; realidade alienada/estranhada que preconiza a forma&ccedil;&atilde;o unilateral e a sociabilidade condicionada ao movimento de acumula&ccedil;&atilde;o do capital. Com isso &ndash; e acima de tudo &ndash;, pensar a educa&ccedil;&atilde;o na perspectiva de Marx &eacute; considerar a import&acirc;ncia da pr&aacute;xis pol&iacute;tico-educativa, com base na perspectiva marxiana de educa&ccedil;&atilde;o e seu car&aacute;ter educativo das enuncia&ccedil;&otilde;es sobre trabalho, aliena&ccedil;&atilde;o, pr&aacute;xis e transforma&ccedil;&atilde;o social, cuja finalidade &eacute; a <strong>emancipa&ccedil;&atilde;o social da classe trabalhadora</strong>.</p>
<p>Com vistas &agrave; emancipa&ccedil;&atilde;o humana (que &eacute; poss&iacute;vel por meio da a&ccedil;&atilde;o pol&iacute;tica abrangente e das pr&aacute;ticas pol&iacute;tico-educativas), a uni&atilde;o entre <span style="background-color: #c2e0f4;">trabalho e educa&ccedil;&atilde;o surge como media&ccedil;&atilde;o pedag&oacute;gica e express&atilde;o da fun&ccedil;&atilde;o social da escola</span>, articulada como pr&aacute;xis pol&iacute;tica-educativa em diversos locais do cotidiano e no tempo livre dos trabalhadores, sejam eles fam&iacute;lia, comunidade, moradia, sindicato etc.&nbsp;</p>
<p>Parte-se do fundamento do &ldquo;trabalho como princ&iacute;pio educativo&rdquo;, considerando proporcionar aos sujeitos educandos o acesso aos conhecimentos oriundos do processo hist&oacute;rico de produ&ccedil;&atilde;o cient&iacute;fica, tecnol&oacute;gica e cultural. O prop&oacute;sito de transforma&ccedil;&atilde;o das condi&ccedil;&otilde;es de vida e amplia&ccedil;&atilde;o das capacidades, sentidos e potencialidades humanas passa indubitavelmente pela apreens&atilde;o desse movimento, que &eacute; compreendido pela produ&ccedil;&atilde;o material, pelas rela&ccedil;&otilde;es sociais nele envolvidas e pelas condi&ccedil;&otilde;es de explora&ccedil;&atilde;o do trabalho humano &ndash; imprescind&iacute;vel &agrave; supera&ccedil;&atilde;o da aliena&ccedil;&atilde;o e &agrave; constru&ccedil;&atilde;o de uma nova sociedade.</p>
<p><span style="background-color: #c2e0f4;">A politecnia e a pedagogia hist&oacute;rico-cr&iacute;tica v&atilde;o na mesma dire&ccedil;&atilde;o: a forma&ccedil;&atilde;o humana que, sob a perspectiva de Gramsci e da filosofia da pr&aacute;xis, voltam-se &agrave; emancipa&ccedil;&atilde;o dos trabalhadores e &agrave; consequente transforma&ccedil;&atilde;o da sociedade.</span> A pedagogia hist&oacute;rico-cr&iacute;tica (Saviani, 2005) comporta a s&iacute;ntese da filosofia da pr&aacute;xis, uma vez que tem como fundamento a categoria modo de produ&ccedil;&atilde;o e a orienta&ccedil;&atilde;o voltada aos interesses da classe dominada. Sob o princ&iacute;pio do trabalho, visa a educa&ccedil;&atilde;o omnilateral e polit&eacute;cnica na perspectiva integrada.</p>
<p>No Brasil, a educa&ccedil;&atilde;o profissional integrada enfrenta diversos desafios, refletindo as limita&ccedil;&otilde;es econ&ocirc;micas, sociais e culturais do pa&iacute;s. Prop&otilde;e-se que a EPT integrada ao ensino m&eacute;dio proped&ecirc;utico, por meio da articula&ccedil;&atilde;o entre trabalho, ci&ecirc;ncia, tecnologia e cultura, seja essencial para superar as contradi&ccedil;&otilde;es decorrentes da estrutura dual do ensino.</p>
<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="parte3.pagina3.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="parte3.pagina5.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 19 de 24</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>