<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Gestão Educacional
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul" class="chapter-info">
<div id="content-cover">
<div id="main" class="main">
<div class="container-fluid">
<div class="row"><!-- Marcação de unidade e título -->
<div class="chapter-info col-md-8 offset-md-2">
<h4 class="chapter-label">CAP&Iacute;TULO 5</h4>
<h1 class="chapter-title"><span style="color: #2dc26b;">Constru&ccedil;&atilde;o da Gest&atilde;o Educacional na EPT</span></h1>
</div>
</div>
<div class="row">
<div class="col-md-12 p-0">
<div class="jumbotron"><span style="color: #169179;"><!-- Imagem de fundo --> </span><img src="medias/53297641866_64ba8ca3bd_k.jpg" alt="Logotipo" width="100%" /></div>
</div>
</div>
<div class="row">
<div class="col-md-6 offset-md-3"><!-- Legenda da imagem caso precise -->
<div class="jumbotron-subtitle">
<p>&nbsp;</p>
<p class="content paragrafo" style="text-align: right; padding-left: 200px;">Agora, mais do que nunca em nossa na&ccedil;&atilde;o, precisamos que educadores transformem as escolas em espa&ccedil;os onde as condi&ccedil;&otilde;es para a consci&ecirc;ncia democr&aacute;tica possam se estabelecer e florescer.<br />Em nossa na&ccedil;&atilde;o, os sistemas educacionais t&ecirc;m sido o principal espa&ccedil;o onde liberdade de express&atilde;o, diverg&ecirc;ncias e opini&otilde;es plurais s&atilde;o valorizadas na teoria e na pr&aacute;tica.</p>
</div>
</div>
</div>
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto conteúdo -->
<p style="text-align: right;"><strong>(bell hooks, <em>Ensinando pensamento cr&iacute;tico: sabedoria pr&aacute;tica)</em><br /><br /></strong></p>
<p>Bell Hooks, professora, escritora e <em>intelectual p&uacute;blica, no livro Ensinando pensamento cr&iacute;tico: sabedoria pr&aacute;tica</em> (2021), narrou uma realidade e uma necessidade dos Estados Unidos sobre as escolas tornarem-se espa&ccedil;o por excel&ecirc;ncia para vivenciar a democracia. Acreditamos que &eacute; preciso resgatar estes espa&ccedil;os tamb&eacute;m nas escolas do Brasil e, devido &agrave;s particularidades da Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (EPT), esses ambientes podem, do mesmo modo, ser potenciais espa&ccedil;os para viv&ecirc;ncia de valores democr&aacute;ticos, tanto nos discursos como nas pr&aacute;ticas institucionais e locais, tal como cursos, organiza&ccedil;&atilde;o de professores e grupos de estudantes.</p>
<p>Os espa&ccedil;os da EPT, como lugares de projetos de educa&ccedil;&atilde;o integral e emancipat&oacute;ria, t&ecirc;m o compromisso de proporcionar tempos e espa&ccedil;os para uma gest&atilde;o de fato democr&aacute;tica. Por isso, &eacute; necess&aacute;rio que todos os sujeitos envolvidos no processo educativo compreendam isso como um princ&iacute;pio, assumindo a responsabilidade de defend&ecirc;-lo e vivenci&aacute;-lo de forma coletiva.<br /><br />Assim, acreditamos que esse processo educativo requer uma <strong>gest&atilde;o</strong>&nbsp;que seja devidamente <strong>planejada</strong>. Gabriel Grabowski (2014), ao destacar o tema, ressalta que, na EPT e em outras modalidades e n&iacute;veis, o planejamento e a gest&atilde;o devem ser exercitados n&atilde;o enquanto conte&uacute;dos program&aacute;ticos, mas como espa&ccedil;os de aprendizagem (viv&ecirc;ncias e pr&aacute;ticas pedag&oacute;gicas), operando na perspectiva de integra&ccedil;&atilde;o do conte&uacute;do, com o m&eacute;todo e a forma, ou seja, precisamos aprender diariamente a gerir e a planejar como uma atividade impl&iacute;cita ao nosso trabalho.</p>

<p><img class="card-curso-topo-image" src="medias/GE.5_MTG_1.png" alt="T&iacute;tulo: Quest&otilde;es sobre Gest&atilde;o Educacional na Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica Fonte: Sch&uuml;ler (2023). Elabora&ccedil;&atilde;o: Prosa (2025)." width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Quest&otilde;es sobre Gest&atilde;o Educacional na Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica<br /><strong>Fonte: </strong>Sch&uuml;ler (2023).<br /><strong>Elabora&ccedil;&atilde;o: </strong>Prosa (2025a).</p>

<p class="paragrafo">Este cap&iacute;tulo tem como objetivo compreender a relev&acirc;ncia das rela&ccedil;&otilde;es interpessoais dos envolvidos no processo educativo, por meio do estudo destas rela&ccedil;&otilde;es e da &eacute;tica no exerc&iacute;cio profissional dos gestores, professores e demais profissionais da educa&ccedil;&atilde;o. Ao engajar-se no trabalho na EPT, ser&aacute; poss&iacute;vel construir e viver experi&ecirc;ncias inovadoras que permitam a <span style="background-color: #c2e0f4;"><span style="background-color: #bfedd2;">indissociabilidade entre o ensino, a pesquisa e a extens&atilde;o.</span><br /></span></p>
<p class="paragrafo">No decorrer de todo material desenvolvido para o componente curricular Gest&atilde;o Educacional na EPT, defendemos a valoriza&ccedil;&atilde;o de todos os sujeitos que comp&otilde;em o campo da modalidade e o desenvolvimento de espa&ccedil;os de viv&ecirc;ncia da democracia. Portanto, as rela&ccedil;&otilde;es interpessoais s&atilde;o os espa&ccedil;os mais mobilizadores dessa gest&atilde;o que valoriza o pedag&oacute;gico. Servidores com clareza de sua fun&ccedil;&atilde;o social, com pertencimento em rela&ccedil;&atilde;o aos valores e objetivos da institui&ccedil;&atilde;o, estar&atilde;o mais engajados e dispostos a construir os espa&ccedil;os e a trabalhar para vencer os desafios. Estar&atilde;o tamb&eacute;m motivados a propor inova&ccedil;&otilde;es tanto no ensino, na pesquisa e na extens&atilde;o quanto na gest&atilde;o. &Eacute; muito importante ressaltar que o diretor escolar &eacute; o l&iacute;der da gest&atilde;o, mas todos os servidores e estudantes s&atilde;o correspons&aacute;veis por constru&iacute;-la e viv&ecirc;-la.&nbsp;</p>
<p class="paragrafo">Na pesquisa de doutorado de Mariglei Maraschin, intitulada <a rel="noopener" href="https://repositorio.ufsm.br/bitstream/handle/1/11580/Maraschin%2c%20Mariglei%20Severo.pdf?sequence=1&amp;isAllowed=y" target="_blank">&ldquo;Dial&eacute;tica das Disputas: trabalho pedag&oacute;gico a servi&ccedil;o da classe trabalhadora?&rdquo;</a> (2015), a autora aponta tr&ecirc;s viv&ecirc;ncias junto de estudantes que foram muito significativas: em uma, o estudante disse que n&atilde;o conseguiu dormir na noite anterior devido &agrave; grande motiva&ccedil;&atilde;o pela aula pr&aacute;tica, o que o deixou em &ecirc;xtase; em outra, a estudante relatou que, embora frequentemente pense em desistir por precisar caminhar muitos quil&ocirc;metros at&eacute; o campus, sempre se lembra da palestra do diretor no primeiro dia de aula, quando ele afirmou que era um direito dos estudantes estarem naquele curso, uma mensagem que a motiva a continuar; e em outra, ainda, o estudante ressaltou o trabalho dos professores, mencionando que, desde o primeiro dia, eles estudam sobre trabalho e tecnologia, sendo constantemente desafiados pelos professores a se transformarem.</p>
<p class="paragrafo">A partir desses relatos, podemos compreender que, na EPT, as aulas pr&aacute;ticas s&atilde;o fundamentais e o nosso trabalho &eacute; decisivo para a perman&ecirc;ncia dos estudantes. <span style="background-color: #bfedd2;">Mas como &eacute; poss&iacute;vel chegar a estas experi&ecirc;ncias?</span>&nbsp;Com Trabalho coletivo, forma&ccedil;&atilde;o e clareza dos fundamentos nacionais da pol&iacute;tica de EPT e dos fundamentos institucionais e de curso.</p>

<p><img class="card-curso-topo-image" src="medias/GE.5_ILU2 1.png" alt="T&iacute;tulo: Viv&ecirc;ncias de estudantes da/na EPT Fonte: Maraschin (2015). Elabora&ccedil;&atilde;o: Prosa (2025)." width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Viv&ecirc;ncias de estudantes da/na EPT<br /><strong>Fonte: </strong>Maraschin (2015).<br /><strong>Elabora&ccedil;&atilde;o: </strong>Prosa (2025b).</p>

<p class="paragrafo">Construir uma gest&atilde;o educacional em EPT exige a elabora&ccedil;&atilde;o de propostas e a implementa&ccedil;&atilde;o de a&ccedil;&otilde;es que promovam a <strong>forma&ccedil;&atilde;o integral</strong>, a viv&ecirc;ncia da <strong>gest&atilde;o democr&aacute;tica</strong> e a efetiva <strong>participa&ccedil;&atilde;o de todos</strong>. Assim, retoma-se que o prop&oacute;sito das institui&ccedil;&otilde;es da EPT, segundo Ant&ocirc;nia Bussmann (1995), n&atilde;o &eacute; ser administrada, supervisionada e inspecionada, mas ser o espa&ccedil;o-tempo da pr&aacute;tica pedag&oacute;gica em que os estudantes se relacionam entre si, com professores, com ideias, valores, ci&ecirc;ncia, arte, cultura, livros e equipamentos, com problemas e desafios, concretizando a miss&atilde;o da escola de criar as oportunidades para que eles se desenvolvam, construam e reconstruam o saber. Antes de avan&ccedil;armos, vamos resgatar o conceito de "gest&atilde;o&rdquo;, que vimos no cap&iacute;tulo 1:</p>
<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Gest&atilde;o &eacute; um termo que prov&eacute;m do latim e significa: levar sobre si, carregar, chamar a si, executar, exercer, gerar. Trata-se de algo que implica o sujeito e um dos substantivos derivado deste verbo nos &eacute; muito conhecido. Trata-se de <em>gestatio</em>, ou seja, gesta&ccedil;&atilde;o, isto &eacute;: o ato pelo qual se traz dentro de si algo novo e diferente: um novo ente. Ora, o termo gest&atilde;o tem sua raiz etimol&oacute;gica em ger que significa: fazer brotar, germinar, fazer nascer. Da mesma raiz prov&ecirc;m os termos: genitora, genitor, germen</p>
<div class="author citacao-longa-autoria">(Cury, 2007, p. 493).</div>
</div>
<p class="paragrafo">Portanto, pela gest&atilde;o educacional na EPT, temos a oportunidade de fazer brotar uma nova forma de fazer e viver a educa&ccedil;&atilde;o. Em outras palavras, por meio de um projeto pol&iacute;tico-pedag&oacute;gico interdisciplinar e multidimensional, temos a possibilidade de planejar formas democr&aacute;ticas de organiza&ccedil;&atilde;o e funcionamento da institui&ccedil;&atilde;o, de um curso, de programas e de projetos, incluindo as rela&ccedil;&otilde;es de trabalho que devolvam &agrave; escola seus principais agentes ou trabalhadores: estudantes e professores, coadjuvados direta e permanentemente pelos pais, tamb&eacute;m trabalhadores &ndash; e que representam e trazem consigo a realidade circundante, por dela serem parte (Bussmann, 1995).</p>

<p><img class="card-curso-topo-image" src="medias/GE.5_ILU_3.png" alt="T&iacute;tulo: Novas formas de fazer e viver a educa&ccedil;&atilde;o Fonte: Prosa (2025)." width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Novas formas de fazer e viver a educa&ccedil;&atilde;o<br /><strong>Fonte: </strong>Prosa (2025c).</p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="referencias-parte-4.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="parte5-pagina2.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 18 de 23</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>