<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Gestão Educacional
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page">

<p class="content paragrafo quote citacao-curta strong"><strong>Indicadores de Avalia&ccedil;&atilde;o e Planos de Integra&ccedil;&atilde;o</strong></p>


<p><span style="font-weight: 400;">Permeando a elabora&ccedil;&atilde;o e a efetiva&ccedil;&atilde;o dos instrumentos de gest&atilde;o apresentados no decorrer do cap&iacute;tulo, propomos tamb&eacute;m a </span><span style="font-weight: 400; background-color: #bfedd2;">organiza&ccedil;&atilde;o de indicadores de avalia&ccedil;&atilde;o e planos de integra&ccedil;&atilde;o</span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">.</span>&nbsp;</span></p>
<p><span style="font-weight: 400;">Os indicadores de avalia&ccedil;&atilde;o s&atilde;o processos novos nas institui&ccedil;&otilde;es de EPT e devem estar cada vez mais presentes, dada a sua import&acirc;ncia. Eles s&atilde;o parte da avalia&ccedil;&atilde;o global e podem ser organizados a partir de metas vindas da &aacute;rea de gest&atilde;o, mas devem, essencialmente, dar conta de aspectos pedag&oacute;gicos.&nbsp;</span></p>
<p><span style="font-weight: 400;">&Eacute; comum, na realidade da EPT, serem realizadas reuni&otilde;es de planejamento e avalia&ccedil;&atilde;o de cursos e projetos. Propomos que estas reuni&otilde;es sejam parte da cultura da institui&ccedil;&atilde;o e, para al&eacute;m delas, sejam continuamente elaborados indicadores qualitativos desses processos. Podemos manter espa&ccedil;os de avalia&ccedil;&atilde;o dos avan&ccedil;os na integra&ccedil;&atilde;o curricular, por exemplo, bem como de suas dificuldades. </span><span style="font-weight: 400; background-color: #bfedd2;">Mas por que pensar a integra&ccedil;&atilde;o como algo importante na EPT?</span></p>
<p><span style="font-weight: 400;">Primeiro, porque a integra&ccedil;&atilde;o &eacute; fundamento do Ensino M&eacute;dio Integrado, podendo servir como refer&ecirc;ncia em todas as outras experi&ecirc;ncias de EPT. O desafio da integra&ccedil;&atilde;o curricular na EPT &eacute; uma oportunidade para renovar e inovar processos de ensino e aprendizagem. Estamos falando de propostas e projetos pedag&oacute;gicos comprometidos com a </span><span style="font-weight: 400; background-color: #bfedd2;">articula&ccedil;&atilde;o criativa das dimens&otilde;es do fazer, do pensar e do sentir como base da forma&ccedil;&atilde;o de personalidades cr&iacute;ticas e transformadoras</span><span style="font-weight: 400;">, de modo a possibilitar uma integra&ccedil;&atilde;o capaz de promover o despertar do olhar cr&iacute;tico e a problematiza&ccedil;&atilde;o de dilemas em situa&ccedil;&otilde;es ambivalentes e contradit&oacute;rias e que favore&ccedil;a o processo afirmativo da constru&ccedil;&atilde;o da identidade de estudantes e professores&nbsp; (Machado, 2010).</span></p>
<p><span style="font-weight: 400;">Segundo, porque a integra&ccedil;&atilde;o &eacute; fundamento tamb&eacute;m da Pol&iacute;tica Nacional de Forma&ccedil;&atilde;o de Profissionais para a&nbsp; EPT (Brasil, 2024) e, por isso, deve ter um espa&ccedil;o da gest&atilde;o para avan&ccedil;ar cada vez mais no cotidiano dos cursos.&nbsp;</span></p>
<p><span style="font-weight: 400;">Assim, a integra&ccedil;&atilde;o curricular n&atilde;o deve ser apenas um princ&iacute;pio orientador, mas um eixo efetivo de planejamento e avalia&ccedil;&atilde;o dentro da institui&ccedil;&atilde;o. Para que esse processo avance, &eacute; necess&aacute;rio definir formas de acompanhamento e mensura&ccedil;&atilde;o que permitam identificar os desafios e os avan&ccedil;os alcan&ccedil;ados. Nesse sentido, a seguir, apresentamos um exemplo de organiza&ccedil;&atilde;o de indicadores de avalia&ccedil;&atilde;o para a integra&ccedil;&atilde;o curricular.</span></p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/GE.3_INF_03.png" alt="T&iacute;tulo: Indicadores de Avalia&ccedil;&atilde;o para Integra&ccedil;&atilde;o Curricular Fonte: Maraschin (2024). Elabora&ccedil;&atilde;o: Prosa (2025c)." width="80%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: <span style="font-weight: 400;">Indicadores de Avalia&ccedil;&atilde;o para Integra&ccedil;&atilde;o Curricular<br /></span></strong><strong>Fonte: <span style="font-weight: 400;">Maraschin (2024).<br /></span></strong><strong>Elabora&ccedil;&atilde;o: <span style="font-weight: 400;">Prosa (2025c).</span></strong></p>

<p><span style="font-weight: 400;">Esses indicadores foram pensados para avaliar a experi&ecirc;ncia de integra&ccedil;&atilde;o de um curso de EJA-EPT, seja de forma&ccedil;&atilde;o inicial e continuada (FIC), seja de forma&ccedil;&atilde;o t&eacute;cnica. Assim, ao planejar e desenvolver o curso, pode ser avaliado, nesta ordem: a procura pelo curso (se houve interessados ou n&atilde;o); os &iacute;ndices de perman&ecirc;ncia (ou seja, em qual momento teve maior evas&atilde;o); e quais foram os avan&ccedil;os e as experi&ecirc;ncias de integra&ccedil;&atilde;o. Tamb&eacute;m &eacute; importante avaliar o engajamento dos estudantes na aprendizagem e dos professores com a forma&ccedil;&atilde;o continuada, visto que uma experi&ecirc;ncia de EJA pressup&otilde;e forma&ccedil;&atilde;o continuada de servidores.</span></p>
<p><span style="font-weight: 400;">Os indicadores de avalia&ccedil;&atilde;o podem, ainda, ser organizados a partir de pesquisas e monitoramentos promovidos pela institui&ccedil;&atilde;o, ou serem contratados grupos de pesquisas externos (Maraschin, 2024). Os &iacute;ndices de procura, perman&ecirc;ncia e conclus&atilde;o de cursos t&ecirc;m sido utilizados para acompanhamento da EPT, inclusive com uma plataforma para este monitoramento, a </span><span style="font-weight: 400;"><span class="modal-button button" data-toggle="modal" data-target="#modal-1">Plataforma Nilo Pe&ccedil;anha</span></span><span style="font-weight: 400;">, mas eles podem ser monitorados tamb&eacute;m pela </span><strong><span class="modal-button button" data-toggle="modal" data-target="#modal-2">Comiss&atilde;o Pr&oacute;pria de Avalia&ccedil;&atilde;o</span></strong><span style="font-weight: 400;">.&nbsp;</span></p>
<p><span style="font-weight: 400;">Muitas institui&ccedil;&otilde;es de EPT tamb&eacute;m t&ecirc;m incentivado a pesquisa, seja por oferta de cursos de forma&ccedil;&atilde;o continuada de professores e servidores, seja por programas de forma&ccedil;&atilde;o de pesquisadores em n&iacute;vel de mestrado, como o</span><strong><span class="modal-button button" data-toggle="modal" data-target="#modal-3"> Mestrado Profissional em Educa&ccedil;&atilde;o Profissional em Rede Nacional (ProfEPT)</span></strong><span style="font-weight: 400;">, e de doutorado. Estas experi&ecirc;ncias podem ser espa&ccedil;os de acompanhamento de dados e de pr&aacute;ticas da EPT.</span></p>
<p><span style="font-weight: 400;">Al&eacute;m dos indicadores de avalia&ccedil;&atilde;o, apontamos tamb&eacute;m a import&acirc;ncia da elabora&ccedil;&atilde;o de um</span><strong> </strong><strong>plano de ensino de integra&ccedil;&atilde;o</strong>.<span style="font-weight: 400;"> Planejar aulas faz parte de um planejamento anterior que deve ser coletivo e reflete o PPP e o </span><strong>Projeto Pedag&oacute;gico do Curso (PPC)</strong><span style="font-weight: 400;">, que refere-se a um planejamento do curso que cont&eacute;m os objetivos, metodologias e formas de trabalhar. Nestes documentos j&aacute; est&atilde;o delineadas as metas e os princ&iacute;pios para a forma&ccedil;&atilde;o profissional. Portanto, ter um plano de ensino e de integra&ccedil;&atilde;o &eacute; fundamental para garantir a possibilidade de incorpora&ccedil;&atilde;o, devendo ser momentos que necessariamente fazem parte dos tempos e espa&ccedil;os das institui&ccedil;&otilde;es.</span></p>
<p>Em rela&ccedil;&atilde;o ao <strong>plano de ensino</strong>, geralmente cada institui&ccedil;&atilde;o tem o seu modelo e o documento compreende os objetivos, as metodologias, o processo avaliativo e as principais refer&ecirc;ncias e atividades. J&aacute; o <strong>plano de integra&ccedil;&atilde;o</strong>&nbsp;poder&aacute; ser desenvolvido por semestre ou ano, por &aacute;reas ou por projetos interdisciplinares. Neste plano, s&atilde;o elaboradas pelos docentes e t&eacute;cnicos de ensino, com a m&aacute;xima participa&ccedil;&atilde;o dos estudantes, a&ccedil;&otilde;es de integra&ccedil;&atilde;o sempre ligadas &agrave; &aacute;rea profissional do curso e aos desafios atuais da sociedade. Os planos de integra&ccedil;&atilde;o s&atilde;o excelentes oportunidades para desenvolvimento de projetos de pesquisa e extens&atilde;o, levando em considera&ccedil;&atilde;o a inova&ccedil;&atilde;o, a criatividade, o protagonismo estudantil, a interdisciplinaridade e as mudan&ccedil;as no mundo do trabalho.</p>
<p>O protagonismo e a autonomia dos estudantes s&atilde;o primordiais e os professores precisam assumir a media&ccedil;&atilde;o e desafi&aacute;-los gradativamente. Sabemos o quanto tem sido dif&iacute;cil implementar o curr&iacute;culo integrado e a interdisciplinaridade, mas acreditamos que a Rede Federal tem as condi&ccedil;&otilde;es e possibilidades de implement&aacute;-la.&nbsp;</p>

<p><img class="card-curso-topo-image" src="medias/53472553328_d36f502b58_5k.jpg" alt="" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>Fonte: </strong><span>Gaia Sch&uuml;ler (2024).</span></p>

</div>
<p>&nbsp;</p>
<div class="col-md-6 offset-md-3 content-page">
<p>&nbsp;No plano de integra&ccedil;&atilde;o, <span style="background-color: #bfedd2;">o planejamento da avalia&ccedil;&atilde;o integrada &eacute; um ponto importante e deve ser, tamb&eacute;m, um item a ser organizado no coletivo</span> (Maraschin, 2024). Portanto, entendemos que &eacute; a gest&atilde;o educacional que promove e incentiva o curr&iacute;culo integrado e estas experi&ecirc;ncias de integra&ccedil;&atilde;o. No entanto, se a gest&atilde;o educacional n&atilde;o tem sido uma cultura da institui&ccedil;&atilde;o, torna-se necess&aacute;rio formar os sujeitos e criar os espa&ccedil;os para esta implementa&ccedil;&atilde;o, bem como refletir sobre o trabalho pedag&oacute;gico desenvolvido na EPT e o que pode ser aperfei&ccedil;oado, atualizado e integrado nas diferentes realidades, sejam cursos de FIC, de Ensino M&eacute;dio Integrado, subsequentes ou tecnol&oacute;gicos, sejam licenciaturas ou p&oacute;s-gradua&ccedil;&atilde;o. Cada forma e n&iacute;vel tem sua especificidade e precisa ser considerado no planejamento de planos de ensino e de planos de integra&ccedil;&atilde;o.</p>
<p>Atualmente, v&aacute;rios desafios afligem o Ensino M&eacute;dio, a juventude brasileira e as diferentes classes de trabalhadores. Por isso, promover uma educa&ccedil;&atilde;o com foco na resolu&ccedil;&atilde;o de problemas sociais e instrumentalizar os trabalhadores-estudantes para desafios reais &ndash; como o uso de tecnologias, intelig&ecirc;ncia artificial, problemas econ&ocirc;micos e ambientais, de inclus&atilde;o e diversidade &ndash; n&atilde;o &eacute; uma necessidade te&oacute;rica, mas um tema que precisa permear as aprendizagens e as viv&ecirc;ncias da forma&ccedil;&atilde;o humana e profissional dos estudantes da Educa&ccedil;&atilde;o B&aacute;sica e da EPT.</p>
<p class="paragrafo">Ao planejar, implementar e avaliar a integra&ccedil;&atilde;o curricular na EPT, estaremos caminhando rumo &agrave; educa&ccedil;&atilde;o omnilateral, que &eacute;</p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">a concep&ccedil;&atilde;o de educa&ccedil;&atilde;o ou de forma&ccedil;&atilde;o humana que busca levar em conta todas as dimens&otilde;es que constituem a especificidade do ser humano e as condi&ccedil;&otilde;es objetivas e subjetivas reais para seu pleno desenvolvimento hist&oacute;rico</p>
<div class="author citacao-longa-autoria">(Frigotto, 2008, p. 267).</div>
</div>

<p class="paragrafo">Assim, tamb&eacute;m estaremos contribuindo para a constru&ccedil;&atilde;o de uma educa&ccedil;&atilde;o polit&eacute;cnica em que o trabalho pedag&oacute;gico romper&aacute;, por um lado, com a profissionaliza&ccedil;&atilde;o estreita e, por outro, com uma educa&ccedil;&atilde;o geral, proped&ecirc;utica, livresca e descolada do mundo do trabalho, tal como destaca Rodrigues (2008).</p>

<div id="recursos-azul">
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Plataforma Nilo Pe&ccedil;anha</h5>
</div>
<div class="modal-body nota">A Plataforma Nilo Pe&ccedil;anha (PNP) &eacute; um ambiente virtual de coleta, valida&ccedil;&atilde;o e dissemina&ccedil;&atilde;o das estat&iacute;sticas oficiais da Rede Federal de Educa&ccedil;&atilde;o Profissional, Cient&iacute;fica e Tecnol&oacute;gica. Ela tem como objetivo reunir dados relativos ao corpo docente, discente, t&eacute;cnico-administrativo e de gastos financeiros das unidades da Rede Federal, para fins de c&aacute;lculo dos indicadores de gest&atilde;o monitorados pela Secretaria de Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica do Minist&eacute;rio da Educa&ccedil;&atilde;o (SETEC/MEC).  <br />Veja mais sobre em: <a rel="noopener" href="https://www.gov.br/mec/pt-br/pnp" target="_blank">https://www.gov.br/mec/pt-br/pnp </a></div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>

<div id="recursos-azul">
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Comiss&atilde;o Pr&oacute;pria de Avalia&ccedil;&atilde;o</h5>
</div>
<div class="modal-body nota">A Comiss&atilde;o Pr&oacute;pria de Avalia&ccedil;&atilde;o (CPA) &eacute; uma comiss&atilde;o aut&ocirc;noma que tem como fun&ccedil;&atilde;o coordenar a avalia&ccedil;&atilde;o institucional de uma institui&ccedil;&atilde;o. A CPA &eacute; presente em todas as institui&ccedil;&otilde;es de ensino superior, de acordo com o artigo 11 da Lei n&ordm; 10.861/2004. As principais atribui&ccedil;&otilde;es da CPA s&atilde;o: <br />- conduzir os processos de avalia&ccedil;&atilde;o internos da institui&ccedil;&atilde;o; <br />- sistematizar os resultados da avalia&ccedil;&atilde;o interna; <br />- elaborar relat&oacute;rios para ser encaminhados ao INEP; <br />- propor melhorias relacionadas aos processos educativos; <br />- assessorar a gest&atilde;o na elabora&ccedil;&atilde;o do Relato Institucional (RI). <br />A CPA acompanha o dia a dia da institui&ccedil;&atilde;o, sugerindo melhorias e mudan&ccedil;as inovadoras. Os resultados das pesquisas efetuadas s&atilde;o divulgados para a comunidade acad&ecirc;mica e externa. De modo a descentralizar as a&ccedil;&otilde;es da CPA, podem ser criadas Comiss&otilde;es Setoriais de Avalia&ccedil;&atilde;o (CSAs).</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>

<div id="recursos-azul">
<div id="modal-3" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Mestrado Profissional em Educa&ccedil;&atilde;o Profissional em Rede Nacional (ProfEPT)</h5>
</div>
<div class="modal-body nota">O Mestrado Profissional em Educa&ccedil;&atilde;o Profissional em Rede Nacional (ProfEPT) visa aperfei&ccedil;oar as pr&aacute;ticas educativas e a gest&atilde;o escolar vinculadas &agrave; EPT, em articula&ccedil;&atilde;o com a demanda por qualifica&ccedil;&atilde;o de profissionais da rede, mas tamb&eacute;m abrindo possibilidades de forma&ccedil;&atilde;o qualificada ao p&uacute;blico em geral, aproveitando a grande capilaridade de atua&ccedil;&atilde;o territorial da RFEPCT para otimizar a oferta das vagas do Programa (veja mais em: <a rel="noopener" href="https://profept.ifes.edu.br/" target="_blank">https://profept.ifes.edu.br/ </a>). Este mestrado prop&otilde;e produtos educacionais que na maioria das vezes apresentam dados e experi&ecirc;ncias sobre a EPT. Mais informa&ccedil;&otilde;es podem ser encontradas em: <a rel="noopener" href="https://profept.ifes.edu.br/consulta-de-egressos-dissertacoes-produtos-educacionais" target="_blank"> https://profept.ifes.edu.br/consulta-de-egressos-dissertacoes-produtos-educacionais</a> Ainda, h&aacute; outros programas de p&oacute;s-gradua&ccedil;&atilde;o em Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica que constroem pesquisas com o foco na EPT, tais como o curso de P&oacute;s-Gradua&ccedil;&atilde;o em Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (PPGEPT ) (<a rel="noopener" href="https://www.ufsm.br/cursos/pos-graduacao/santa-maria/ppgept" target="_blank"> https://www.ufsm.br/cursos/pos-graduacao/santa-maria/ppgept </a>) e o curso de P&oacute;s-Gradua&ccedil;&atilde;o em Educa&ccedil;&atilde;o Profissional (PPGEP) (<a rel="noopener" href="https://portal.ifrn.edu.br/institucional/pesquisa-pos-graduacao-e-inovacao/pos-graduacao/pos-graduacao-stricto-sensu/programa-de-pos-graduacao-em-educacao-profissional-/" target="_blank">https://portal.ifrn.edu.br/institucional/pesquisa-pos-graduacao-e-inovacao/pos-graduacao/pos-graduacao-stricto-sensu/programa-de-pos-graduacao-em-educacao-profissional-/</a>).</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>

<div class="nav-pagination">
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="parte3-pagina2.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="parte3-pagina4.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 12 de 23</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>