<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Gestão Educacional
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul" class="chapter-info">
<div id="content-cover">
<div id="main" class="main">
<div class="container-fluid">
<div class="row"><!-- Marcação de unidade e título -->
<div class="chapter-info col-md-8 offset-md-2">
<h4 class="chapter-label">CAP&Iacute;TULO 4</h4>
<h1 class="chapter-title"><span style="color: #2dc26b;">Sujeitos da Gest&atilde;o em EPT</span></h1>
</div>
</div>
<div class="row">
<div class="col-md-12 p-0">
<div class="jumbotron"><span style="color: #169179;"><!-- Imagem de fundo --> </span><img src="medias/53297730631_56b4d95f10_k.jpg" alt="Logotipo" width="100%" /></div>
</div>
</div>
<div class="row">
<div class="col-md-6 offset-md-3"><!-- Legenda da imagem caso precise --></div>
</div>
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto conteúdo -->


<p class="content paragrafo" style="text-align: right; padding-left: 320px;"><em>Considerar o homem como fim implica t&ecirc;-lo como sujeito e n&atilde;o como objeto no processo em que se busca a realiza&ccedil;&atilde;o dos objetivos</em>.</p>
<p class="content paragrafo" style="text-align: right;"><strong>(Vitor Henrique Paro,<em> Administra&ccedil;&atilde;o escolar</em>)</strong></p>


<p class="paragrafo">Na gest&atilde;o educacional da Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (EPT), o mais importante s&atilde;o as pessoas, por isso &eacute; primordial engajar todos os profissionais no desenvolvimento da institui&ccedil;&atilde;o. Quando as pessoas se sentem parte, comprometem-se mais, entendem sua fun&ccedil;&atilde;o e assumem o processo coletivamente. Eis aqui um grande desafio: fazer com que todos se engajem como sujeitos e n&atilde;o como meros executores ou espectadores. Em outras palavras, o desafio consiste em construir o que Cl&aacute;udia Amaral (2016, p. 110) chama de &ldquo;<strong>perten&ccedil;a profissional</strong>&rdquo;, que deve ser elaborado &ldquo;nas rela&ccedil;&otilde;es sociais estabelecidas com os diferentes sujeitos no trabalho&rdquo; por parte n&atilde;o s&oacute; dos professores, como destaca a autora, mas por todos os sujeitos da comunidade educativa. A autora afirma tamb&eacute;m que a perten&ccedil;a profissional se processa socialmente tendo como centralidade a dimens&atilde;o coletiva do trabalho dos servidores, considerando o contexto s&oacute;cio-hist&oacute;rico configurador, a forma&ccedil;&atilde;o inicial, a trajet&oacute;ria profissional individual ou de grupo e a autonomia como aspectos influenciadores (Amaral, 2016).</p>
<p class="paragrafo">Conv&eacute;m lembrarmos aqui a condi&ccedil;&atilde;o humana dos gestores e a quest&atilde;o de inacabamento dos sujeitos, aspectos que tornam o processo de &nbsp;aprender e de desenvolver-se como gestor uma <strong>aprendizagem cont&iacute;nua</strong>. <span class="modal-button button" data-toggle="modal" data-target="#modal-1">Paulo Freire</span>, no cap&iacute;tulo 3 do livro <em>Pedagogia da Autonomia: saberes necess&aacute;rios &agrave; pr&aacute;tica educativa</em> (1996), intitulado "Ensinar &eacute; uma especificidade humana", destaca nove exig&ecirc;ncias do ensinar. Na introdu&ccedil;&atilde;o deste cap&iacute;tulo, o pedagogo enfatiza que uma das qualidades essenciais que o docente democr&aacute;tico deve revelar em suas rela&ccedil;&otilde;es com as liberdades dos estudantes &eacute; a seguran&ccedil;a de si mesmo, que se manifesta na firmeza do seu trabalho, nas decis&otilde;es, no respeito &agrave;s liberdades e na capacidade de discutir suas pr&oacute;prias posi&ccedil;&otilde;es e de rever suas a&ccedil;&otilde;es. Na mesma obra, Freire tamb&eacute;m apresenta a consci&ecirc;ncia do inacabamento dos sujeitos e afirma que o inacabamento do ser humano, ou sua inconclus&atilde;o, &eacute; pr&oacute;prio da vida: "onde h&aacute; vida, h&aacute; inacabamento. Mas s&oacute; entre mulheres e homens o inacabamento se tornou consciente" (Freire, 1996, p. 55). Essas perspectivas em rela&ccedil;&atilde;o &agrave; condi&ccedil;&atilde;o humana refletem a ess&ecirc;ncia da gest&atilde;o educacional, que n&atilde;o se limita a fun&ccedil;&otilde;es administrativas, mas abrange a articula&ccedil;&atilde;o din&acirc;mica do conjunto de trabalhos como pr&aacute;tica social que ocorrem na institui&ccedil;&atilde;o.<br /><br />Nesse contexto, segundo Helo&iacute;sa L&uuml;ck (2014), a gest&atilde;o passa a ser o enfoque orientador da a&ccedil;&atilde;o organizadora e orientadora do ensino, tanto em &acirc;mbito macro (sistema) como micro (escola) e na intera&ccedil;&atilde;o de ambos os &acirc;mbitos. Ainda, &eacute; necess&aacute;rio entender a a&ccedil;&atilde;o de cada profissional como trabalho e compreender os profissionais como trabalhadores a servi&ccedil;o da educa&ccedil;&atilde;o.</p>
<p class="paragrafo">Assim, este cap&iacute;tulo tem como objetivo conhecer e compreender as atribui&ccedil;&otilde;es dos profissionais que exercem fun&ccedil;&otilde;es de gest&atilde;o nas institui&ccedil;&otilde;es educativas, por meio do estudo das atribui&ccedil;&otilde;es dos coordenadores pedag&oacute;gicos das escolas. Para isso, iremos refletir sobre o <span style="background-color: #bfedd2;">desafio de engajar a todos na pol&iacute;tica de EPT</span>, valorizando os diferentes saberes dos profissionais.&nbsp;</p>
<p class="paragrafo">As realidades das institui&ccedil;&otilde;es da EPT mobilizam diferentes profissionais, al&eacute;m de professores de diferentes &aacute;reas. S&atilde;o eles: <strong>servidores de ensino</strong> (pedagogos, t&eacute;cnicos em assuntos educacionais, educadores especiais, assistentes de alunos, t&eacute;cnicos de laborat&oacute;rios) e <strong>servidores da sa&uacute;de</strong> (psic&oacute;logos, m&eacute;dicos, assistentes sociais, enfermeiros, dentistas, t&eacute;cnicos em enfermagem, entre outros). O que cria um elo entre essas diferentes &aacute;reas &eacute; a busca pela <strong>forma&ccedil;&atilde;o integral</strong> e pela educa&ccedil;&atilde;o dos estudantes. Nas palavras de Paro (2008, p. 128),&nbsp;</p>
<p class="paragrafo">&nbsp;</p>
<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo"></h5>
</div>
<div class="modal-body nota">Paulo Freire foi um educador e fil&oacute;sofo brasileiro, nascido em Recife, em 1921. Reconhecido como Patrono da Educa&ccedil;&atilde;o Brasileira, Freire &eacute; conhecido principalmente por sua obra Pedagogia do Oprimido e pelo desenvolvimento de um m&eacute;todo inovador de alfabetiza&ccedil;&atilde;o de adultos, focado no di&aacute;logo e na conscientiza&ccedil;&atilde;o cr&iacute;tica. Outra obra importante foi a Pedagogia da autonomia: saberes necess&aacute;rios &agrave; pr&aacute;tica educativa, publicado em 1996, voltada diretamente para educadores. Neste livro, Freire sintetiza seus princ&iacute;pios pedag&oacute;gicos e oferece reflex&otilde;es pr&aacute;ticas sobre o papel do professor, abordando os saberes fundamentais para uma pr&aacute;tica educativa transformadora. O brasileiro se consagrou como um dos pensadores mais conceituados na hist&oacute;ria da pedagogia mundial, tendo influenciado o movimento chamado pedagogia cr&iacute;tica ao redor do mundo e se tornado refer&ecirc;ncia internacional. <br /><img style="max-width: 100%; padding: 10px;" src="medias/EJA.1_MNT_1.png" alt="" /> <strong> T&iacute;tulo:</strong> Paulo Freire <br /><strong>Fonte:</strong>Novo Horizonte de Economia Solidaria (2011). <br /><strong>Elabora&ccedil;&atilde;o:</strong> Prosa (2024). <br />
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>
<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Sendo o homem um ser que se autocria pelo trabalho, nessa sua autocria&ccedil;&atilde;o produz o <strong>sup&eacute;rfluo</strong>&nbsp;&ndash; ou seja aquilo que transcende a necessidade natural e se apresenta como desej&aacute;vel pelo homem em sua postura &eacute;tica de n&atilde;o indiferen&ccedil;a com rela&ccedil;&atilde;o ao mundo em que se encontra. Essa produ&ccedil;&atilde;o do sup&eacute;rfluo &eacute; que lhe imprime sua <strong>dimens&atilde;o hist&oacute;rica</strong>, possibilitando a cria&ccedil;&atilde;o e acumula&ccedil;&atilde;o da cultura e a transforma&ccedil;&atilde;o e enriquecimento constantes do mundo em que vive. &Eacute; pela educa&ccedil;&atilde;o que cada indiv&iacute;duo apropria-se da cultura, criada historicamente, e adquire condi&ccedil;&otilde;es de desfrutar daquilo que a hist&oacute;ria produziu.</p>
</div>
<p class="paragrafo">&nbsp;</p>
<p class="paragrafo">O gestor educacional da EPT mobiliza e valoriza as diferentes forma&ccedil;&otilde;es e saberes na forma&ccedil;&atilde;o humana e profissional dos estudantes, assim como tamb&eacute;m trabalha no desenvolvimento de espa&ccedil;os que potencializam a democratiza&ccedil;&atilde;o da educa&ccedil;&atilde;o. Assim, a institui&ccedil;&atilde;o estimula o respeito aos diferentes saberes e promove a busca cont&iacute;nua por melhoria e qualidade do ensino e por acesso, perman&ecirc;ncia e inclus&atilde;o. Mas como isso &eacute; poss&iacute;vel?</p>
<p class="paragrafo">N&atilde;o existem receitas nem mesmo regras gerais, mas pressupostos que passam pela valoriza&ccedil;&atilde;o de diferentes saberes, pela participa&ccedil;&atilde;o e pelo desejo de vivenciar e experienciar rela&ccedil;&otilde;es saud&aacute;veis, humanizadoras e democr&aacute;ticas em todo o contexto da institui&ccedil;&atilde;o. Exemplos que podem guiar os gestores na trilha da gest&atilde;o educacional da EPT a partir dos assuntos discutidos neste cap&iacute;tulo podem consistir em reunir os servidores e estudantes e mapear o que mais preocupa a comunidade; refletir e propor a&ccedil;&otilde;es conjuntas para minimizar os problemas, como projetos de ensino, de pesquisa ou de inova&ccedil;&atilde;o, com a maior participa&ccedil;&atilde;o poss&iacute;vel dos diferentes segmentos da comunidade; e planejar espa&ccedil;os de avalia&ccedil;&atilde;o de tais a&ccedil;&otilde;es, lembrando que ensinar exige disponibilidade para o di&aacute;logo e que</p>
<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;"><span style="font-weight: 400;">&eacute; no respeito &agrave;s diferen&ccedil;as entre mim e eles ou elas, na coer&ecirc;ncia entre o que fa&ccedil;o e o que digo, que me encontro com eles ou elas&nbsp;</span></p>
<div class="author citacao-longa-autoria">(Freire, 1996, p. 152).</div>
</div>

<p><span style="font-weight: 400;">Vale considerar que estes pressupostos precisam ser constru&iacute;dos e seguidos no cotidiano escolar, n&atilde;o como utopias, mas como possibilidades de serem viabilizados; considerar que criar estes espa&ccedil;os junto aos estudantes &eacute; proporcionar uma experi&ecirc;ncia democr&aacute;tica e ensinar que, na coletividade, &eacute; poss&iacute;vel crescer e desenvolver-se juntos.&nbsp;</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">Muitas vezes, os profissionais que passam a trabalhar na EPT n&atilde;o t&ecirc;m o conhecimento sobre a modalidade, assim como n&atilde;o conhecem as singularidades de sua &aacute;rea em conex&atilde;o com a Educa&ccedil;&atilde;o Profissional. </span><span style="font-weight: 400; background-color: #bfedd2;">Por isso, sempre &eacute; necess&aacute;rio ter descrito as especificidades do cargo e as expectativas da institui&ccedil;&atilde;o ao receber o profissional.</span></p>
<p class="paragrafo"><span style="font-weight: 400;">Paro (2008), ao ressaltar a import&acirc;ncia da qualidade do ensino, destaca a necessidade da educa&ccedil;&atilde;o ser gerida como media&ccedil;&atilde;o para a forma&ccedil;&atilde;o do homem hist&oacute;rico, e esse processo envolve rela&ccedil;&otilde;es humanas em que a condi&ccedil;&atilde;o de sujeitos precisa ser permanentemente afirmada, uma vez que isso os caracteriza como sujeitos hist&oacute;ricos. Assim, a rela&ccedil;&atilde;o pedag&oacute;gica sup&otilde;e a postura &eacute;tica dos sujeitos nela envolvidos: </span><span style="font-weight: 400; background-color: #bfedd2;">&ldquo;tanto quem educa quanto quem &eacute; educado precisa querer faz&ecirc;-lo para que a rela&ccedil;&atilde;o se efetive como genuinamente pedag&oacute;gica&rdquo;</span><span style="font-weight: 400;">&nbsp;(Paro, 2008, p. 130).</span></p>

<p><img class="card-curso-topo-image" src="medias/GE.4_ILU_1 (1).png" alt="T&iacute;tulo: Engajamento profissional dos sujeitos na EPT Fonte: Prosa (2025)." width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: <span style="font-weight: 400;">Engajamento profissional, aprendizagem e trabalho coletivo dos sujeitos na EPT<br /></span></strong><strong>Fonte: <span style="font-weight: 400;">Prosa (2025b).</span></strong></p>

<p class="paragrafo"><span style="font-weight: 400;">Por isso, a estrutura e a organiza&ccedil;&atilde;o das institui&ccedil;&otilde;es devem assumir sempre uma forma democr&aacute;tica, favorecendo a vontade e a participa&ccedil;&atilde;o dos sujeitos envolvidos no processo pedag&oacute;gico. No entanto, quando n&atilde;o h&aacute; conhecimento do profissional em rela&ccedil;&atilde;o &agrave; sua a&ccedil;&atilde;o na EPT ou clareza da institui&ccedil;&atilde;o no que se quer com o servidor, &eacute; preciso promover essas reflex&otilde;es, buscando a qualidade do ensino e do trabalho do servidor.</span></p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="referencias-parte-3.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="parte4-pagina2.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 15 de 23</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>