<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Gestão Educacional
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->
<p class="paragrafo quote citacao-curta strong"><strong>Dimens&atilde;o Pedag&oacute;gica</strong></p>



<p class="paragrafo"><span style="font-weight: 400;">A segunda dimens&atilde;o &ndash; </span><strong>pedag&oacute;gica</strong><span style="font-weight: 400;">&nbsp;&ndash; est&aacute; ligada &agrave; identidade da institui&ccedil;&atilde;o, &agrave; sua miss&atilde;o social, ao p&uacute;blico, aos resultados e, por isso, ao projeto pol&iacute;tico-pedag&oacute;gico em sua ess&ecirc;ncia. Para Neves (1995), a dimens&atilde;o pedag&oacute;gica tem como prioridade a </span><span style="font-weight: 400; background-color: #bfedd2;">melhoria da qualidade do ensino e o atendimento &agrave;s necessidades b&aacute;sicas de aprendizagem em seus diversos n&iacute;veis.</span></p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/GE.2_INF_04.png" alt="T&iacute;tulo: Dimens&otilde;es do Pedag&oacute;gico na Gest&atilde;o Fonte: Neves (1995). Elabora&ccedil;&atilde;o: Prosa (2025d)." width="80%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Dimens&otilde;es do Pedag&oacute;gico na Gest&atilde;o<br /><strong>Fonte: </strong>Porto Alegre (2017), Neves (1995).<br /><strong>Elabora&ccedil;&atilde;o: </strong>Prosa (2025d).</p>

<p><span style="font-weight: 400;">Nessa dimens&atilde;o, entra com for&ccedil;a o trabalho pedag&oacute;gico dos servidores da institui&ccedil;&atilde;o, desenvolvido como a&ccedil;&otilde;es, rela&ccedil;&otilde;es e transforma&ccedil;&otilde;es: as </span><strong>a&ccedil;&otilde;es</strong><span style="font-weight: 400;"> dos sujeitos envolvidos, tais como diretores, professores, t&eacute;cnicos administrativos em educa&ccedil;&atilde;o e estudantes; as </span><strong>rela&ccedil;&otilde;es</strong><span style="font-weight: 400;"> como as estabelecidas entre o planejamento, o di&aacute;logo de professores e alunos, bem como o curr&iacute;culo em disputa e as viv&ecirc;ncias; e as </span><strong>transforma&ccedil;&otilde;es</strong><span style="font-weight: 400;">&nbsp;dos agentes participantes, os quais: professores, estudantes e sistemas institucionais e pol&iacute;ticos (Maraschin, 2015).</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">A dimens&atilde;o pedag&oacute;gica &eacute;, muitas vezes, a que mais fica esquecida nas institui&ccedil;&otilde;es, sendo delegada ao setor de ensino ou apenas aos professores, deixando de lado o vi&eacute;s educativo de todos os processos. A depender da concep&ccedil;&atilde;o de educa&ccedil;&atilde;o, de ensino e de avalia&ccedil;&atilde;o da institui&ccedil;&atilde;o e dos servidores, ser&aacute; poss&iacute;vel caminhar para a democracia e para a gest&atilde;o democr&aacute;tica ou para o refor&ccedil;o de uma institui&ccedil;&atilde;o que n&atilde;o reflete sobre seus processos e apenas promove uma educa&ccedil;&atilde;o banc&aacute;ria, fragmentada e classificat&oacute;ria.</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">Ao promover a centralidade na dimens&atilde;o pedag&oacute;gica e no trabalho pedag&oacute;gico, &eacute; garantido aos educadores </span><span style="font-weight: 400; background-color: #bfedd2;">&ldquo;a liberdade de conceber, planejar e executar o ensino de forma org&acirc;nica e tecnicamente consistente&rdquo;</span><span style="font-weight: 400;">&nbsp;e &agrave; pr&oacute;pria escola </span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">&ldquo;as condi&ccedil;&otilde;es adequadas de realizar o ensino de acordo com suas peculiaridades pol&iacute;ticas e pedag&oacute;gicas&rdquo;</span> </span><span style="font-weight: 400;">(Paro, 2015, p. 69). Uma escola que vive a dimens&atilde;o pedag&oacute;gica contribui para a forma&ccedil;&atilde;o integral dos estudantes ao promover espa&ccedil;os de participa&ccedil;&atilde;o e reflex&atilde;o coletiva, al&eacute;m de assumir o trabalho como princ&iacute;pio educativo e a pesquisa como pressuposto pedag&oacute;gico. Nesta &uacute;ltima, h&aacute; processos cont&iacute;nuos de elabora&ccedil;&atilde;o e discuss&atilde;o do projeto pol&iacute;tico-pedag&oacute;gico, bem como compromisso com o ensino de qualidade, al&eacute;m de replanejamento do processo educativo e, sobretudo, da valoriza&ccedil;&atilde;o dos professores e dos diferentes profissionais e seus trabalhos. Por consequ&ecirc;ncia, o estudante faz-se sujeito-autor, processando seu aprendizado e educando-se, ora pelos conhecimentos constru&iacute;dos, ora pelas viv&ecirc;ncias e transforma&ccedil;&otilde;es promovidas.</span></p>
<p class="paragrafo"><span style="font-weight: 400;">Ainda, com a assun&ccedil;&atilde;o do trabalho como princ&iacute;pio educativo e da pesquisa como pressuposto pedag&oacute;gico, as avalia&ccedil;&otilde;es s&atilde;o cont&iacute;nuas. Quando a dimens&atilde;o pedag&oacute;gica est&aacute; no centro das pr&aacute;ticas institucionais, a avalia&ccedil;&atilde;o deixa de ser um mecanismo punitivo ou classificat&oacute;rio. Uma institui&ccedil;&atilde;o que entende e valoriza essa dimens&atilde;o compreende a </span><span style="font-weight: 400; background-color: #bfedd2;">avalia&ccedil;&atilde;o como parte de todo o processo de forma&ccedil;&atilde;o dos sujeitos e n&atilde;o a resume a notas e conceitos, fazendo com que, ao experienciar avalia&ccedil;&otilde;es cont&iacute;nuas, integradas e que fazem parte de um processo, todos comprometam-se em ensinar e em aprender.</span><span style="font-weight: 400;"> Assim, em vez de gerar inseguran&ccedil;a e estresse em docentes e estudantes, principalmente nos finais de semestres e anos letivos, a avalia&ccedil;&atilde;o torna-se uma ferramenta de aprendizado cont&iacute;nuo, integrada &agrave;s experi&ecirc;ncias docentes e discentes.</span></p>

<p class="paragrafo quote citacao-curta strong"><strong>Dimens&atilde;o Pol&iacute;tica</strong></p>



<p><span style="font-weight: 400;">A terceira dimens&atilde;o &ndash; </span><span style="font-weight: 400;"><strong>pol&iacute;tica</strong></span><span style="font-weight: 400;"> &ndash; recupera quest&otilde;es fundamentais da institui&ccedil;&atilde;o escolar, componentes de sua fun&ccedil;&atilde;o social. Aqui entra um ponto muito importante na EPT, que s&atilde;o os princ&iacute;pios e as finalidades da rede ou sistema em que se est&aacute; inserido &ndash; al&eacute;m da perspectiva filos&oacute;fica e humana do processo educativo. A </span><strong>qualidade pol&iacute;tica</strong><span style="font-weight: 400;">&nbsp;&eacute; uma condi&ccedil;&atilde;o essencial para a participa&ccedil;&atilde;o, estando ela, segundo o professor Pedro Demo (</span><em><span style="font-weight: 400;">apud</span></em><span style="font-weight: 400;">&nbsp;Veiga, 1995), relacionada aos objetivos, valores e conte&uacute;dos, referindo-se &agrave; capacidade do sujeito de se construir e atuar na hist&oacute;ria, em conson&acirc;ncia com os prop&oacute;sitos hist&oacute;ricos da sociedade.</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">Portanto, a dimens&atilde;o pol&iacute;tica integra-se &agrave; pedag&oacute;gica e reflete sobre o papel e a fun&ccedil;&atilde;o da institui&ccedil;&atilde;o e dos seus gestores, podendo fazer da institui&ccedil;&atilde;o mais uma que apenas implementa as pol&iacute;ticas vindas de cima ou a que trabalha com a sociedade para a transforma&ccedil;&atilde;o e a melhoria das realidades.</span><span style="font-weight: 400;"> Vive-se a dimens&atilde;o pol&iacute;tica da gest&atilde;o quando todos os servidores, estimulados pelos gestores, refletem sobre a fun&ccedil;&atilde;o do seu trabalho, sobre a miss&atilde;o e os valores da institui&ccedil;&atilde;o em conson&acirc;ncia com os objetivos legais e refer&ecirc;ncias cr&iacute;ticas do campo da EPT.</span></p>
<p><span style="font-weight: 400;">Essa dimens&atilde;o se alinha &agrave; constru&ccedil;&atilde;o de um ambiente educacional que favorece a participa&ccedil;&atilde;o ativa e o desenvolvimento integral dos estudantes, tendo como objetivo transformar a escola em um espa&ccedil;o de participa&ccedil;&atilde;o cidad&atilde;. Assim, a dimens&atilde;o pol&iacute;tica promove uma cultura de autonomia e de compromisso com a justi&ccedil;a social, no qual os processos de ensino e de tomada de decis&atilde;o refletem o valor da coletividade, ajudando, inclusive, na constru&ccedil;&atilde;o de uma gest&atilde;o democr&aacute;tica.</span></p>
<p><span style="font-weight: 400;">No entanto, para que essa dimens&atilde;o seja efetiva, &eacute; essencial que ela esteja articulada &agrave;s demais, especialmente com as dimens&otilde;es pedag&oacute;gica e administrativa, possibilitando uma gest&atilde;o integrada e coerente com os objetivos educativos. A gest&atilde;o pol&iacute;tica cria condi&ccedil;&otilde;es para pr&aacute;ticas pedag&oacute;gicas que valorizam a pesquisa e o desenvolvimento cr&iacute;tico dos sujeitos, contribuindo para <span style="background-color: #bfedd2;">uma educa&ccedil;&atilde;o que n&atilde;o apenas forma para o trabalho, mas que tamb&eacute;m capacita cidad&atilde;os cr&iacute;ticos e conscientes de seu papel transformador na sociedade.</span><br /></span></p>

<p class="paragrafo quote citacao-curta strong"><strong>Dimens&atilde;o Financeira</strong></p>


<p><span style="font-weight: 400;">A quarta dimens&atilde;o &ndash; </span><strong>financeira</strong><span style="font-weight: 400;"> &ndash; diz respeito aos recursos necess&aacute;rios e financeiros para a operacionaliza&ccedil;&atilde;o da institui&ccedil;&atilde;o. N&atilde;o &eacute; poss&iacute;vel pensar nas outras dimens&otilde;es sem considerar os recursos necess&aacute;rios para implementar e garantir a sobreviv&ecirc;ncia da institui&ccedil;&atilde;o, pois uma institui&ccedil;&atilde;o sem o m&iacute;nimo de recursos necess&aacute;rios desvia sua aten&ccedil;&atilde;o do que &eacute; essencial para algo que funciona apenas como acess&oacute;rio (Paro, 2016).</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">De acordo com Neves (1995), a dimens&atilde;o financeira considera a gest&atilde;o dos recursos patrimoniais, dos recursos via sistema educacional, do que &eacute; or&ccedil;amento pr&oacute;prio e da capacidade de negociar e atrair parcerias e recursos externos que possam vir tamb&eacute;m a contribuir com o processo educativo.</span></p>


<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/GE.2_INF_05 (1).png" alt="T&iacute;tulo: Vertentes do eixo Financeiro Fonte: Neves (1995). Elabora&ccedil;&atilde;o: Prosa (2025e)." width="80%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo:&nbsp;</strong>Vertentes do eixo Financeiro<br /><strong>Fonte: </strong>Neves (1995), Volpe (2016).<br /><strong>Elabora&ccedil;&atilde;o: </strong>Prosa (2025e).</p>

<p class="paragrafo"><span style="font-weight: 400;">A dimens&atilde;o financeira precisa ser constantemente incentivada pela gest&atilde;o, no sentido de que todos os servidores devem atrair recursos com frequ&ecirc;ncia, por via de </span><strong>projetos de ensino</strong><span style="font-weight: 400;">, </span><strong>pesquisa</strong><span style="font-weight: 400;">, </span><strong>extens&atilde;o</strong><span style="font-weight: 400;"> ou, ainda, de </span><strong>desenvolvimento institucional</strong><span style="font-weight: 400;">. Al&eacute;m disso, o desenvolvimento da dimens&atilde;o financeira precisa ser informado regularmente &agrave; comunidade externa e interna com um vi&eacute;s de </span><strong>transpar&ecirc;ncia</strong><span style="font-weight: 400;">, servindo para incentivar novas possibilidades e investimentos.<br /></span></p>

<p class="paragrafo quote citacao-curta strong"><strong>Dimens&atilde;o Comunicacional</strong></p>


<p><span style="font-weight: 400;">A quinta dimens&atilde;o &ndash; </span><strong>comunicacional</strong><span style="font-weight: 400;">&nbsp;&ndash; &eacute; fundamental e est&aacute; diretamente ligada a todas as outras. Essa dimens&atilde;o &eacute; essencial tanto no ambiente interno da institui&ccedil;&atilde;o, promovendo </span><span style="font-weight: 400; background-color: #bfedd2;">transpar&ecirc;ncia nas a&ccedil;&otilde;es e processos</span><span style="font-weight: 400;">&nbsp;da dire&ccedil;&atilde;o e sua comunica&ccedil;&atilde;o aos servidores, quanto no ambiente externo, ao </span><span style="font-weight: 400; background-color: #bfedd2;">divulgar o que &eacute; desenvolvido internamente</span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">.</span> Isso contribui para despertar o interesse da sociedade em fazer parte dessa comunidade educativa, seja participando dos cursos como estudantes, seja como parceiros em projetos.&nbsp;</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">Observamos que a dimens&atilde;o comunicacional &eacute; a menos trabalhada nas institui&ccedil;&otilde;es, deixando uma lacuna significativa principalmente nas rela&ccedil;&otilde;es entre os servidores e entre a institui&ccedil;&atilde;o e a comunidade. Essa lacuna impacta diretamente o engajamento e a identidade institucional, tornando essencial a implementa&ccedil;&atilde;o de estrat&eacute;gias que deem visibilidade &agrave;s a&ccedil;&otilde;es da institui&ccedil;&atilde;o. Uma estrat&eacute;gia de comunica&ccedil;&atilde;o na EPT que pode ser posta em pr&aacute;tica &eacute; realizar constantemente a divulga&ccedil;&atilde;o de hist&oacute;rias de egressos, de estudantes desenvolvendo projetos, dos ambientes e das viv&ecirc;ncias. Esta divulga&ccedil;&atilde;o promover&aacute; o desejo de estar na institui&ccedil;&atilde;o.</span></p>
<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura --></div>
<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="parte2-pagina2.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="parte2-pagina3.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 7 de 23</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>