<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Gestão Educacional
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="paragrafo">&nbsp;</p>
<p class="paragrafo quote citacao-curta strong"><strong>Plano de Desenvolvimento Institucional</strong></p>


<p><span style="font-weight: 400;">O </span><strong>Plano de Desenvolvimento Institucional (PDI)</strong><span style="font-weight: 400;">, primeiro instrumento de gest&atilde;o na EPT, &eacute; uma importante ferramenta para o desenvolvimento do planejamento institucional das organiza&ccedil;&otilde;es de ensino que t&ecirc;m as dimens&otilde;es de oferta de </span><strong>ensino</strong>,<strong> pesquisa </strong>e<strong> extens&atilde;o</strong><span style="font-weight: 400;">. Ao englobar elementos que influenciam a melhoria da qualidade do ensino, na uniformidade das tarefas administrativas e na gest&atilde;o financeira eficiente, o PDI colabora para os objetivos de </span><span style="font-weight: 400;"><span class="modal-button button" data-toggle="modal" data-target="#modal-1">efici&ecirc;ncia, efic&aacute;cia, efetividade</span></span><span style="font-weight: 400;">&nbsp;e transpar&ecirc;ncia p&uacute;blica. Este instrumento possibilita, ainda, um diagn&oacute;stico sist&ecirc;mico e as bases para reflex&atilde;o, formula&ccedil;&atilde;o, implementa&ccedil;&atilde;o e gest&atilde;o dos planos de a&ccedil;&atilde;o fomentadores do </span><strong>desenvolvimento integral</strong><span style="font-weight: 400;">&nbsp;pertinentes para o horizonte futuro estabelecido, como afirmam Tom&aacute;s Dias Sant&rsquo;ana </span><em><span style="font-weight: 400;">et al</span></em><span style="font-weight: 400;">&nbsp;(2017).</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">O PDI de uma institui&ccedil;&atilde;o de EPT </span><span style="font-weight: 400; background-color: #bfedd2;">parte da sua historicidade e planeja suas metas para o futuro</span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">.</span> Com base em diagn&oacute;sticos de sua realidade, ele elabora um planejamento social e democr&aacute;tico para um determinado tempo. Este instrumento de gest&atilde;o </span><span style="font-weight: 400;">planeja a institui&ccedil;&atilde;o que o coletivo quer e estabelece metas que servir&atilde;o para o desenvolvimento de planos anuais de gest&atilde;o, bem como para avalia&ccedil;&atilde;o e acompanhamento de tal planejamento</span><span style="font-weight: 400;">.</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">Para isso, quanto mais participa&ccedil;&atilde;o na elabora&ccedil;&atilde;o do PDI, melhor &eacute;. Quanto mais a gest&atilde;o da institui&ccedil;&atilde;o envolver a comunidade, mais esse documento representar&aacute; os sujeitos e os rumos da institui&ccedil;&atilde;o. A dire&ccedil;&atilde;o geral e a dire&ccedil;&atilde;o administrativa s&atilde;o as respons&aacute;veis por liderar o processo de constru&ccedil;&atilde;o do PDI, mas precisar&atilde;o criar estrat&eacute;gias de maior participa&ccedil;&atilde;o poss&iacute;vel, promovendo, pela elabora&ccedil;&atilde;o desse instrumento, o pertencimento, o </span><span style="font-weight: 400; background-color: #bfedd2;">conhecimento das necessidades e o envolvimento com o trabalho na EPT</span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">.</span> Su</span><span style="font-weight: 400;">a elabora&ccedil;&atilde;o &eacute; um evento importante na gest&atilde;o da EPT e seus gestores precisam incentiv&aacute;-la e mobiliz&aacute;-la, assim como utilizar o PDI para o desenvolvimento de pol&iacute;ticas institucionais e para a avalia&ccedil;&atilde;o constante da pr&oacute;pria institui&ccedil;&atilde;o, ou seja, a avalia&ccedil;&atilde;o da institui&ccedil;&atilde;o que se tem e da institui&ccedil;&atilde;o que se quer.</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">Cabe tamb&eacute;m a compreens&atilde;o dos servidores sobre a import&acirc;ncia da participa&ccedil;&atilde;o, constru&ccedil;&atilde;o e acompanhamento desse documento norteador da gest&atilde;o. A elabora&ccedil;&atilde;o do documento &eacute; um espa&ccedil;o fundamental de disputa de pol&iacute;ticas e de metas para uma institui&ccedil;&atilde;o a servi&ccedil;o da classe trabalhadora. Eis a&iacute; o desafio de garantia de pol&iacute;ticas inclusivas e emancipat&oacute;rias na gest&atilde;o e no ensino da EPT.</span></p>
<p><span style="font-weight: 400;"> </span><span style="font-weight: 400;">Portanto, o PDI n&atilde;o deve ser apenas um documento dispon&iacute;vel na p&aacute;gina das institui&ccedil;&otilde;es para pesquisa, mas sim um </span><strong>instrumento de gest&atilde;o</strong><span style="font-weight: 400;">, de </span><strong>planejamento</strong><span style="font-weight: 400;"> e de </span><strong>avalia&ccedil;&atilde;o das metas</strong><span style="font-weight: 400;"> e </span><strong>desafios</strong><span style="font-weight: 400;">&nbsp;da institui&ccedil;&atilde;o.&nbsp;</span></p>
<p class="paragrafo"><span style="font-weight: 400;">Para a organiza&ccedil;&atilde;o e elabora&ccedil;&atilde;o do PDI, &eacute; importante olhar para a legisla&ccedil;&atilde;o e para as </span><strong>experi&ecirc;ncias de outras institui&ccedil;&otilde;es</strong><span style="font-weight: 400;">, tendo o fundamento da maior participa&ccedil;&atilde;o poss&iacute;vel da comunidade institucional. Muitas institui&ccedil;&otilde;es formam comiss&otilde;es para elaborar o PDI, embora isso possa ser uma pr&aacute;tica comum, &eacute; essencial criar mecanismos que envolvam o maior n&uacute;mero poss&iacute;vel de representantes ou at&eacute; toda a comunidade acad&ecirc;mica, pois &eacute; um processo fundamental.</span></p>

<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo"></h5>
</div>
<div class="modal-body nota"><br /><strong>EFICI&Ecirc;NCIA</strong> - est&aacute; ligada ao modo de fazer uma tarefa. O eficiente &eacute; o que executa uma tarefa com qualidade, compet&ecirc;ncia, excel&ecirc;ncia, com nenhum ou com o m&iacute;nimo de erros. <br /><strong> EFIC&Aacute;CIA</strong> - est&aacute; diretamente ligada ao resultado. Eficaz &eacute; o que cumpre perfeitamente determinada tarefa ou fun&ccedil;&atilde;o, atingindo o objetivo proposto. <br /><strong>EFETIVIDADE</strong> - consiste em fazer o que deve ser feito, com qualidade, utilizando os recursos da melhor maneira poss&iacute;vel para atingir o objetivo inicialmente proposto. Efetivo &eacute; o que tem a habilidade de ser eficiente e eficaz ao mesmo tempo. <br /><br />Para saber mais sobre esse assunto, voc&ecirc; pode acessar o <a rel="noopener" href="https://www.gov.br/mec/pt-br/plataformafor/documentos/livroforpdi" target="_blank">Guia de Conhecimentos para as Institui&ccedil;&otilde;es Federais de Ensino</a>, que apresenta informa&ccedil;&otilde;es detalhadas sobre elabora&ccedil;&atilde;o, execu&ccedil;&atilde;o e gest&atilde;o do PDI.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>

<div id="recursos-azul" class="feat-box-foto">
<p><span style="font-weight: 400;">Para saber mais sobre PDI, planejamento, avalia&ccedil;&atilde;o das metas e desafios a partir das viv&ecirc;ncias de institui&ccedil;&otilde;es de ensino, vale conhecer as experi&ecirc;ncias da Universidade Federal de Santa Maria (UFSM) e do Instituto Federal do Rio Grande do Norte (IFRN) com seus respectivos PDIs:</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A <strong>UFSM</strong>, que possui duas escolas vinculadas &agrave; universidade, estrutura seu PDI em sete desafios estrat&eacute;gicos, os quais: internacionaliza&ccedil;&atilde;o; educa&ccedil;&atilde;o inovadora e transformadora com excel&ecirc;ncia acad&ecirc;mica; inclus&atilde;o social; inova&ccedil;&atilde;o, gera&ccedil;&atilde;o de conhecimento e transfer&ecirc;ncia de tecnologias; moderniza&ccedil;&atilde;o e desenvolvimento organizacional; desenvolvimento local, regional e nacional; e gest&atilde;o ambiental. Al&eacute;m disso, o PDI 2016-2026 apresenta as Diretrizes das Pol&iacute;ticas Institucionais, abrangendo &aacute;reas como planejamento e avalia&ccedil;&atilde;o institucional; governan&ccedil;a, controle interno e gest&atilde;o de riscos; organiza&ccedil;&atilde;o administrativa; gest&atilde;o de pessoas; gest&atilde;o or&ccedil;ament&aacute;ria; tecnologia de informa&ccedil;&atilde;o; assist&ecirc;ncia estudantil; infraestrutura; gest&atilde;o ambiental; comunica&ccedil;&atilde;o; acessibilidade; inova&ccedil;&atilde;o, empreendedorismo e transfer&ecirc;ncia de tecnologias. </span>Para saber mais, acesso o <a style="font-size: 1em;" rel="noopener" href="https://www.ufsm.br/pro-reitorias/proplan/pdi" target="_blank">Plano de Desenvolvimento Institucional da Universidade Federal de Santa Maria</a><span style="font-size: 1em;">.</span></li>
</ul>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O <strong>IFRN</strong> desenvolve seu PDI por meio de um processo de constru&ccedil;&atilde;o coletiva. Sua elabora&ccedil;&atilde;o envolve a participa&ccedil;&atilde;o ativa de diferentes segmentos da institui&ccedil;&atilde;o e da sociedade, reunindo contribui&ccedil;&otilde;es e incorporando novas estrat&eacute;gias. Entre elas, destaca-se a utiliza&ccedil;&atilde;o do </span><em><span style="font-weight: 400;">Balanced Scorecard </span></em><span style="font-weight: 400;">(BSC), uma ferramenta que permite visualizar de forma integrada os objetivos que o IFRN pretende alcan&ccedil;ar ao longo dos oito anos de vig&ecirc;ncia do plano, garantindo a concretiza&ccedil;&atilde;o de sua miss&atilde;o institucional. Com isso, o planejamento se organiza a partir de projetos estrat&eacute;gicos, estruturados em atividades, etapas e setores respons&aacute;veis, assegurando a execu&ccedil;&atilde;o alinhada dos objetivos estabelecidos. Acesso o <a rel="noopener" href="https://portal.ifrn.edu.br/institucional/gestao-estrategica/planejamento-estrategico/" target="_blank">portal sobre Planejamento</a> e o <a rel="noopener" href="https://portal.ifrn.edu.br/documents/2640/PDI_2019_2026_-_1%C2%AA_Revis%C3%A3o_2023.pdf" target="_blank">Plano de Desenvolvimento Institucional (2019 - 2026) do Instituto Federal do Rio Grande do Norte.</a></span></li>
</ul>

</div>
<p>&nbsp;</p>

<p class="paragrafo quote citacao-curta strong"><strong>Plano Pol&iacute;tico-Pedag&oacute;gico</strong></p>


<p><span style="font-weight: 400;">Ilma Veiga (1995) aponta que </span><span style="font-weight: 400;">o segundo instrumento, o </span><strong>Plano Pol&iacute;tico-Pedag&oacute;gico (PPP)</strong>,<strong> </strong><span style="font-weight: 400;">&eacute; entendido como a estrutura&ccedil;&atilde;o integral do trabalho pedag&oacute;gico na escola, como um planejamento geral do futuro, partindo da institui&ccedil;&atilde;o que se tem para a institui&ccedil;&atilde;o que se quer. A institui&ccedil;&atilde;o de EPT &eacute; o lugar de concep&ccedil;&atilde;o, realiza&ccedil;&atilde;o e avalia&ccedil;&atilde;o de seu projeto educativo e, por isso, precisa </span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">organizar seu trabalho pedag&oacute;gico com base em seus estudantes</span></span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">.</span>&nbsp;</span></p>
<p><span style="font-weight: 400;">Percebemos, por&eacute;m, que a EPT se configura em muitos espa&ccedil;os como &ldquo;nega&ccedil;&atilde;o do pedag&oacute;gico&rdquo;, como afirma Mariglei Severo Maraschin (2020), visto que n&atilde;o h&aacute; movimentos de constru&ccedil;&atilde;o coletiva de seu PPP nem de discuss&atilde;o sobre o trabalho realizado.&nbsp;</span></p>
<p><span style="font-weight: 400;">Ao construir o PPP, planejamos o que temos inten&ccedil;&atilde;o de fazer, de realizar. Com base no que temos, direcionamos para adiante, ou seja, antevemos um futuro diferente do presente (Veiga, 1995), buscando sempre o poss&iacute;vel. Carmem Moreira de Castro Neves (1995) elucida que o PPP &eacute; um instrumento de trabalho que mostra </span><span style="font-weight: 400; background-color: #bfedd2;">o que vai ser feito, quando, de que maneira, por quem e para chegar a quais resultados</span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">.</span> O documento deixa claro a filosofia escolar e contextualiza as diretrizes e a legisla&ccedil;&atilde;o nacional com a realidade da institui&ccedil;&atilde;o e de seus sujeitos, valorizando a identidade e chamando para a responsabilidade, de modo a promover a participa&ccedil;&atilde;o democr&aacute;tica de todos.</span></p>
<p><span style="font-weight: 400;">Na constru&ccedil;&atilde;o do PPP, deve-se ter claro o que se quer fazer e os motivos para fazer, deixando de ser uma simples produ&ccedil;&atilde;o de um documento para consolidar um </span><strong>processo de <em>a&ccedil;&atilde;o-reflex&atilde;o-a&ccedil;&atilde;o</em></strong><span style="font-weight: 400;"> que exige o esfor&ccedil;o conjunto e a vontade pol&iacute;tica do coletivo escolar (Veiga, 2012). Um processo de a&ccedil;&atilde;o-reflex&atilde;o-a&ccedil;&atilde;o significa uma outra forma de organiza&ccedil;&atilde;o do trabalho pedag&oacute;gico e sup&otilde;e romper com o existente para avan&ccedil;ar, sendo uma cont&iacute;nua reflex&atilde;o sobre seu cotidiano. Para Moacir Gadotti (1994), todo projeto implica rupturas com o presente e traz expectativas para o futuro, uma vez que projetar &eacute; desafiar uma situa&ccedil;&atilde;o est&aacute;vel para arriscar-se, &eacute; enfrentar um momento de incerteza, &eacute; buscar uma nova estabilidade baseada na promessa de um estado futuro melhor que o atual. Desse modo, um projeto educativo pode ser visto como uma promessa diante de certas rupturas, que revelam os espa&ccedil;os de a&ccedil;&atilde;o poss&iacute;veis, com a qual se comprometem seus participantes e idealizadores. Na EPT, por exemplo, busca-se nos cursos o curr&iacute;culo integrado, que s&oacute; pode ser implementado efetivamente com o processo cont&iacute;nuo de a&ccedil;&atilde;o-reflex&atilde;o-a&ccedil;&atilde;o.</span></p>
<p><span style="font-weight: 400;">Veja abaixo um m&eacute;todo de planejamento de um PPP, que pode ser descrito a partir das seguintes etapas:</span></p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/GE.3_INF_02.png" alt="" width="80%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong><span style="font-weight: 400;">Etapas do Planejamento de um PPP<br /></span><strong>Fonte: </strong><span style="font-weight: 400;">Neves (1995).<br /></span><strong>Elabora&ccedil;&atilde;o: </strong><span style="font-weight: 400;">Prosa (2025b).</span></p>

<p><span style="font-weight: 400;">Na maioria das realidades de educa&ccedil;&atilde;o superior ou de EPT, o PPP &eacute; um item do PDI em que constam os princ&iacute;pios norteadores para as atividades de ensino, de pesquisa e de extens&atilde;o, seja da universidade ou de outras institui&ccedil;&otilde;es da rede federal. Defendemos, aqui, que o PPP deve ser um instrumento de gest&atilde;o do ensino em constante (re)elabora&ccedil;&atilde;o nas institui&ccedil;&otilde;es, pois entendemos este documento como constru&ccedil;&atilde;o cont&iacute;nua de a&ccedil;&otilde;es, bem como um elemento descentralizador e democratizador do processo de tomada de decis&otilde;es, al&eacute;m de ser o respons&aacute;vel por implementar o processo coletivo de avalia&ccedil;&atilde;o de cunho emancipat&oacute;rio (Veiga, 1995).</span></p>
<p><span style="font-weight: 400;">Para isso, os gestores do PPP (diretores de ensino, setor pedag&oacute;gico, coordenadores de curso) devem ser os respons&aacute;veis pelo ensino, mas todos os professores, os servidores e at&eacute; os estudantes precisam ter o tempo e o espa&ccedil;o para discutir as pol&iacute;ticas de ensino, bem como analisar constantemente como acolher e construir estrat&eacute;gias para o melhor ensino e aprendizagem nos diferentes cursos e modalidades de ensino.</span></p>
<p><span style="font-weight: 400;">Uma institui&ccedil;&atilde;o de EPT que n&atilde;o reflete continuamente sobre seu ensino, suas propostas, suas metodologias, seu curr&iacute;culo e suas pr&aacute;ticas de avalia&ccedil;&atilde;o corre o risco de se tornar obsoleta. A falta dessa reflex&atilde;o impede a institui&ccedil;&atilde;o de compreender fatores cruciais, como os &iacute;ndices de evas&atilde;o e a baixa procura por seus cursos. A pandemia de covid-19 evidenciou essa fragilidade: muitas institui&ccedil;&otilde;es ficaram paralisadas e sem uma estrat&eacute;gia clara para adaptar o ensino ao formato remoto, revelando a import&acirc;ncia de planejar e inovar constantemente para enfrentar desafios e manter-se relevante.</span></p>
<p><span style="font-weight: 400;">Nesse processo de reflex&atilde;o e adapta&ccedil;&atilde;o, &eacute; fundamental considerar o papel da comunidade na constru&ccedil;&atilde;o de propostas educacionais mais alinhadas &agrave;s suas necessidades.</span><strong> </strong><span style="font-weight: 400;">No entanto, um dos desafios na EPT &eacute; justamente envolver comunidades espec&iacute;ficas (trabalhadores rurais, quilombolas, ind&iacute;genas, pescadores) e os pr&oacute;prios estudantes na elabora&ccedil;&atilde;o de cursos e projetos que venham a modificar suas realidades e oportunidades de trabalho. Essa participa&ccedil;&atilde;o, no entanto, exige estrat&eacute;gias que promovam o envolvimento coletivo e fortale&ccedil;am o sentimento de pertencimento. Em uma interlocu&ccedil;&atilde;o com um campus de um IF, a t&iacute;tulo de exemplo, um gestor destacou como foram organizadas as regras de conviv&ecirc;ncia: junto aos estudantes, foram realizadas v&aacute;rias etapas de reflex&atilde;o sobre qual escola desejavam at&eacute; chegar a dez regras de conviv&ecirc;ncia. Essa experi&ecirc;ncia foi muito interessante porque um regulamento elaborado para regras e puni&ccedil;&otilde;es cedeu espa&ccedil;o para o di&aacute;logo, para a participa&ccedil;&atilde;o e para a constru&ccedil;&atilde;o coletiva de direitos e deveres. E, ao participarem desse processo &ndash; que durou dois anos e teve lideran&ccedil;a estudantil em v&aacute;rios momentos &ndash;, os estudantes aprenderam e experienciaram a democracia.&nbsp;</span></p>
<p class="paragrafo"><span style="font-weight: 400;">Assim, ousamos afirmar que planejar e </span><span style="font-weight: 400; background-color: #bfedd2;">efetivar um projeto pedag&oacute;gico pr&oacute;prio e coerente com a realidade &eacute; o maior e atual desafio da EPT</span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">.</span> Por isso, torna-se fundamental olhar para outras experi&ecirc;ncias de constru&ccedil;&atilde;o coletiva, n&atilde;o como receitas a serem seguidas, mas como pr&aacute;ticas a serem incentivadas e reelaboradas.</span></p>

<div id="recursos-azul" class="feat-box-foto">
<div class="title caixa-de-destaque-titulo"><span style="font-weight: 400;">Para aprofundarmos melhor a compreens&atilde;o sobre como acontece a constru&ccedil;&atilde;o coletiva do PPP na pr&aacute;tica, vale conhecer a <a rel="noopener" href="https://portal.ifrn.edu.br/institucional/ensino/projeto-politico-pedagogico/" target="_blank">experi&ecirc;ncia do Instituto Federal do Rio Grande do Norte</a>. A institui&ccedil;&atilde;o tem se consolidado como refer&ecirc;ncia nesse processo, adotando uma abordagem inovadora e participativa.</span></div>

</div>
<p>&nbsp;</p>

<p class="paragrafo quote citacao-curta strong"><strong>Plano de Perman&ecirc;ncia e &Ecirc;xito</strong></p>


<p><span style="font-weight: 400;">Por fim, o&nbsp; terceiro instrumento de gest&atilde;o na EPT &eacute; o Plano de Perman&ecirc;ncia e Exit&ocirc; (PPE)</span><span style="font-weight: 400;">, um plano institucional que contempla o diagn&oacute;stico das causas da evas&atilde;o e reten&ccedil;&atilde;o e a implementa&ccedil;&atilde;o de pol&iacute;ticas e a&ccedil;&otilde;es administrativas e pedag&oacute;gicas, a fim de ampliar as possibilidades de perman&ecirc;ncia e &ecirc;xito dos estudantes no processo educativo nas institui&ccedil;&otilde;es, respeitando as especificidades regionais.&nbsp;</span></p>
<p><span style="font-weight: 400;">No contexto da EPT, este plano surgiu em atendimento &agrave; </span><a rel="noopener" href="https://proen.ifpa.edu.br/documentos-1/documentos-gerais/2015/1234-nota-informativa-n-138-2015-dpe-ddr-setec-mec/file" target="_blank"><span style="font-weight: 400;">Nota Informativa n&ordm; 138/2015/DPE/DDR/SETEC/MEC</span></a><strong>,</strong><span style="font-weight: 400;"> da Secretaria de Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica. A nota informa e orienta as institui&ccedil;&otilde;es da Rede Federal sobre a constru&ccedil;&atilde;o dos planos estrat&eacute;gicos institucionais para a perman&ecirc;ncia e &ecirc;xito dos estudantes. Portanto, &eacute; uma exig&ecirc;ncia devido aos altos &iacute;ndices de evas&atilde;o e repet&ecirc;ncia, que deve ser uma a&ccedil;&atilde;o e um compromisso importante de diretores, coordenadores e professores.&nbsp;</span></p>
<p><span style="font-weight: 400;">O PPE estabelece as seguintes fases (Brasil, 2015):</span></p>
<ol>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Institui&ccedil;&atilde;o da comiss&atilde;o interna;</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Elabora&ccedil;&atilde;o de diagn&oacute;stico quantitativo;</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Elabora&ccedil;&atilde;o de diagn&oacute;stico qualitativo;</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Consolida&ccedil;&atilde;o do plano estrat&eacute;gico;</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Monitoramento e avalia&ccedil;&atilde;o das a&ccedil;&otilde;es.&nbsp;</span></li>
</ol>
<p><span style="font-weight: 400;">As fases de elabora&ccedil;&atilde;o do PPE organizam-se em defini&ccedil;&atilde;o da comiss&atilde;o, elabora&ccedil;&atilde;o de diagn&oacute;sticos e de plano estrat&eacute;gico e monitoramento das a&ccedil;&otilde;es e &iacute;ndices. Assim, um PPE n&atilde;o deve ser responsabilidade apenas da comiss&atilde;o, mas de todos os servidores da institui&ccedil;&atilde;o. A comiss&atilde;o precisa instituir espa&ccedil;os de forma&ccedil;&atilde;o para diminuir os dados de evas&atilde;o e construir estrat&eacute;gias coletivas de perman&ecirc;ncia e sucesso escolar.</span></p>
<p class="paragrafo"><span style="font-weight: 400; background-color: #bfedd2;">O PPE, junto aos outros dois instrumentos de gest&atilde;o aqui apresentados &ndash; PDI e PPP &ndash; contribuem para a gest&atilde;o cr&iacute;tica e democr&aacute;tica na EPT.</span><span style="font-weight: 400;">&nbsp;Estes documentos s&atilde;o guias importantes que orientam as pr&aacute;ticas pedag&oacute;gicas, administrativas e institucionais, e, por isso, </span><span style="font-weight: 400; background-color: #bfedd2;">devem ser compreendidos e vivenciados por todos os envolvidos na institui&ccedil;&atilde;o</span><strong></strong><span style="font-weight: 400;">, incluindo os estudantes, que s&atilde;o participantes ativos nesse processo. A seguir, apresentaremos duas estrat&eacute;gias de acompanhamento e desenvolvimento desses instrumentos de gest&atilde;o, com o objetivo de fortalecer sua implementa&ccedil;&atilde;o e promover o engajamento de toda a comunidade acad&ecirc;mica.</span></p>

<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Manual da Comiss&atilde;o de Perman&ecirc;ncia e &Ecirc;xito</h5>
</div>
<div class="modal-body nota">
<p>Para saber mais sobre o Plano de Perman&ecirc;ncia e &Ecirc;xito, indicamos a leitura do <a rel="noopener" href="https://educapes.capes.gov.br/bitstream/capes/566263/2/raphael_05_11_2019.pdf" target="_blank">Manual da Comiss&atilde;o de Perman&ecirc;ncia e &Ecirc;xito</a>.</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>

<div id="recursos-azul" class="feat-box-foto">
<p>Para saber mais sobre o Plano de Perman&ecirc;ncia e &Ecirc;xito, indicamos a leitura do <a rel="noopener" href="https://educapes.capes.gov.br/bitstream/capes/566263/2/raphael_05_11_2019.pdf" target="_blank">Manual da Comiss&atilde;o de Perman&ecirc;ncia e &Ecirc;xito, do Instituto Federal de Educa&ccedil;&atilde;o, Ci&ecirc;ncia e Tecnologia Sudeste de Minas Gerais.</a></p>

</div>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="parte3-pagina1.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="parte3-pagina3.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 11 de 23</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>