<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Democracia e gestão democrática na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul" class="chapter-info">
<div id="content-cover">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="chapter-info col-md-8 offset-md-2">
<h4 class="chapter-label">Cap&iacute;tulo 3</h4>
<h1 class="chapter-title"><span style="color: #2dc26b;">Gest&atilde;o Democr&aacute;tica e Representatividade: quem faz o qu&ecirc;?</span></h1>
</div>
</div>
<div class="row">
<div class="col-md-12 p-0">
<div class="jumbotron"><img src="medias/53472555693_08397fd3d0_k.jpg" alt="Institutos Federais de Educa&ccedil;&atilde;o, Ci&ecirc;ncia e Tecnologia (IFs). (b)" width="100%" height="100%" /></div>
</div>
</div>
</div>
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page">
<p class="content paragrafo">&nbsp;</p>
<p class="content paragrafo">Inicialmente, precisamos retomar a polissemia da palavra &ldquo;gest&atilde;o&rdquo;, considerando as nuances da Educa&ccedil;&atilde;o Profissional Tecnol&oacute;gica (EPT). Numa primeira acep&ccedil;&atilde;o, gest&atilde;o &eacute; a <strong>racionaliza&ccedil;&atilde;o dos processos para a efici&ecirc;ncia</strong>,<strong> </strong>mas n&atilde;o apenas dentro da l&oacute;gica taylorista. A efici&ecirc;ncia, neste caso, tem a ver com a garantia de que os direitos fundamentais sejam de fato considerados, respeitados e promovidos. Gest&atilde;o &eacute; muito mais uma atitude de est&iacute;mulo &agrave; responsabilidade, &agrave; participa&ccedil;&atilde;o e, no caso especial da EPT, &agrave; autonomia dos envolvidos do que propriamente a metodologia de processos. A gest&atilde;o democr&aacute;tica em EPT precisa afastar-se do que denominamos como gerencialismo.&nbsp;</p>


<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Do lado da escola e da educa&ccedil;&atilde;o, o gerencialismo tamb&eacute;m faz sua entrada pela porta da frente, sob a batuta das alega&ccedil;&otilde;es de que ambas precisam melhorar em &nbsp;efici&ecirc;ncia e efic&aacute;cia. Alevantam-se, assim, as d&uacute;vidas sobre como pensar e justificar o trabalho como refer&ecirc;ncia para a forma&ccedil;&atilde;o e a democracia se a raz&atilde;o instrumental e utilitarista do gerencialismo conduz &agrave; fabrica&ccedil;&atilde;o da aliena&ccedil;&atilde;o e do estranhamento&nbsp;&nbsp;</p>
<div class="author citacao-longa-autoria">(Machado, 2023, p. 8).</div>
</div>


<p class="paragrafo">A gest&atilde;o, no caso da EPT, &eacute; pressuposto fundamental que visa fomentar a participa&ccedil;&atilde;o mais efetiva de todos os sujeitos nas a&ccedil;&otilde;es e decis&otilde;es que envolvem a todos. N&atilde;o se trata, aos moldes de Maquiavel, de apenas formar lideran&ccedil;as que possam manter-se no poder, mas <span style="background-color: #bfedd2;">assegurar que a legitimidade do poder se assenta na garantia do envolvimento amplo e irrestrito de todos nos processos de pondera&ccedil;&atilde;o e de tomada de decis&atilde;o.</span><strong> </strong>Antes de ser um tema de filosofia pol&iacute;tica, ou mesmo da ci&ecirc;ncia pol&iacute;tica, a governan&ccedil;a de vontades deve estar completamente alinhada aos prop&oacute;sitos e finalidades da institui&ccedil;&atilde;o e n&atilde;o o inverso &ndash; cen&aacute;rio no qual a institui&ccedil;&atilde;o se tornaria ref&eacute;m das a&ccedil;&otilde;es e decis&otilde;es particulares que aspiram apenas o bem-estar privado.&nbsp;</p>


<div id="recursos-azul">
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>


<p class="content paragrafo quote citacao-curta strong"><strong>Gest&atilde;o de qu&ecirc;?</strong></p>


<p class="paragrafo">Remontando a proposta aristot&eacute;lica, a gest&atilde;o, em si, <span style="background-color: #bfedd2;">&eacute; um olhar de todos para a distin&ccedil;&atilde;o constante entre meios e fins, pre&ccedil;o e valor, investimento e despesa.</span><strong> </strong>O exerc&iacute;cio do poder em uma gest&atilde;o democr&aacute;tica deve considerar a premissa de que todas as pessoas envolvidas tenham consci&ecirc;ncia do grau de impacto das decis&otilde;es coletivas, bem como de suas individualidades. A gest&atilde;o n&atilde;o pode ser reduzida a uma instrumentaliza&ccedil;&atilde;o de pessoas e dos processos, priorizando apenas a perspectiva econ&ocirc;mica, como no caso do Taylorismo, Fordismo e Toyotismo, exemplos que vimos anteriormente.</p>


<p class="paragrafo">Do mesmo modo, a gest&atilde;o como processo de racionaliza&ccedil;&atilde;o &ndash; e n&atilde;o de nega&ccedil;&atilde;o da raz&atilde;o &ndash; precisa ser pensada e implementada considerando as diferen&ccedil;as entre a <strong>gest&atilde;o, gest&atilde;o educacional e gest&atilde;o na EPT</strong>.&nbsp;</p>
<p class="paragrafo">&Eacute; preciso priorizar a&ccedil;&otilde;es que realmente qualifiquem os processos e fluxos e melhorem o acesso, a perman&ecirc;ncia e &ecirc;xito de nossos estudantes. Isso &eacute; diferente da racionaliza&ccedil;&atilde;o dos processos de uma empresa que visa a produ&ccedil;&atilde;o e o lucro, por exemplo, ou mesmo a oferta de servi&ccedil;os como terceiro setor. <span style="color: #e03e2d;"><span style="color: #000000;">O fim de uma institui&ccedil;&atilde;o da EPT est&aacute; muito claramente expresso tanto na lei de cria&ccedil;&atilde;o dos Institutos Federais, por exemplo, como em suas bases conceituais.</span> </span>Portanto, todos os desafios e obst&aacute;culos que forem se apresentando em termos de gest&atilde;o e de fluxos n&atilde;o devem nem podem ser motivo <span style="color: #000000;">para perdermos de vista o objetivo principal das institui&ccedil;&otilde;es p&uacute;blicas de EPT, que &eacute;</span> a forma&ccedil;&atilde;o p&uacute;blica, gratuita e de qualidade. <span style="background-color: #bfedd2;">E mais: com uma forma&ccedil;&atilde;o polit&eacute;cnica, omnilateral e que dialogue com a produ&ccedil;&atilde;o do conhecimento, com a evolu&ccedil;&atilde;o da ci&ecirc;ncia e da tecnologia, com a dial&eacute;tica da cultura e do mundo do trabalho.</span> Esse vi&eacute;s cr&iacute;tico prioriza a forma&ccedil;&atilde;o cr&iacute;tica, criativa e cidad&atilde;, para que nossos egressos n&atilde;o aceitem ser explorados e, se na condi&ccedil;&atilde;o de inst&acirc;ncia decis&oacute;ria, n&atilde;o sejam exploradores do of&iacute;cio alheio.&nbsp;</p>


<p class="paragrafo">Quando falamos em <strong>gest&atilde;o educacional</strong>, precisamos retomar o sentido de que n&atilde;o se trata de um processo fabril ou algo que opera somente no mensur&aacute;vel; educa&ccedil;&atilde;o n&atilde;o &eacute; produto, n&atilde;o &eacute; coisa e, portanto, n&atilde;o pode ser concebida numa perspectiva fordista da produ&ccedil;&atilde;o em s&eacute;rie. Ela deve ser compreendida como um processo lento, gradual e reflexivo de constitui&ccedil;&atilde;o de sujeitos pela rela&ccedil;&atilde;o estabelecida entre pessoas, conhecimentos, m&eacute;todos e processos.&nbsp;</p>


<p class="paragrafo">No caso da <strong>gest&atilde;o na EPT</strong>, as implica&ccedil;&otilde;es te&oacute;ricas e pr&aacute;ticas s&atilde;o ainda mais complexas. Isso ocorre porque &eacute; fundamental a apropria&ccedil;&atilde;o da categoria <em>mundo do trabalho</em>, em contrapartida ao <em>mercado de trabalho</em>, da mesma forma que &eacute; imprescind&iacute;vel a apreens&atilde;o do conceito de trabalho em si &ndash; e o sentido deste na constru&ccedil;&atilde;o da sociedade e da realiza&ccedil;&atilde;o individual das pessoas. <span style="background-color: #bfedd2;">A gest&atilde;o na EPT n&atilde;o segue o mesmo mote te&oacute;rico e pr&aacute;tico da gest&atilde;o em geral e tamb&eacute;m n&atilde;o pode ser dilu&iacute;da no bojo comum da educa&ccedil;&atilde;o formal, considerando as suas peculiaridades, natureza e finalidade.</span> Verifique as diferen&ccedil;as entre as gest&otilde;es:</p>


<p><img class="card-curso-topo-image" src="medias/DE.3_INF_1.3.png" alt="Tipos de gest&atilde;o e suas caracter&iacute;sticas" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo:</strong> Tipos de gest&atilde;o e suas caracter&iacute;sticas<br /><strong>Fonte: </strong>Prosa (2024a).</p>


<p class="paragrafo">O caminho mais seguro para corrigirmos os rumos de toda e qualquer democracia &eacute; a <strong>representatividade</strong>. Ou seja, que todos os segmentos, setores, servi&ccedil;os e sujeitos sejam considerados como premissa para as tomadas de decis&otilde;es. Retomemos as reflex&otilde;es de<span class="modal-button button" data-toggle="modal" data-target="#modal-2"> Montesquieu</span>, que, em sua obra <em>O Esp&iacute;rito das Leis </em>(1996), concebe a racionalidade como o esp&iacute;rito, o sentido, o papel, a base e o fundamento das leis. Para ele, a racionalidade atua como ant&iacute;doto para que os poderes (Legislativo, Judici&aacute;rio e Executivo) tencionem uns aos outros sem que haja inger&ecirc;ncia de um sobre o outro, assegurando, ao mesmo tempo, plena liberdade em suas atua&ccedil;&otilde;es. Na EPT, podemos ponderar a no&ccedil;&atilde;o de racionalidade como um ponto de partida, como poss&iacute;vel ponto de chegada, mas, sobretudo, como <strong>atitude de processos mediadores</strong>,&nbsp;para que consigamos operar com parcim&ocirc;nia as tens&otilde;es entre o que &eacute; fundamental no indiv&iacute;duo e o que &eacute; necess&aacute;rio para a sobreviv&ecirc;ncia da institui&ccedil;&atilde;o.&nbsp;</p>


<div id="recursos-azul">
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Montesquieu</h5>
</div>
<div class="modal-body nota">Charles-Louis de Secondat, bar&atilde;o de La Br&egrave;de e de Montesquieu, conhecido como Montesquieu, foi um pol&iacute;tico, fil&oacute;sofo e escritor franc&ecirc;s. Ficou famoso pela sua teoria da separa&ccedil;&atilde;o dos poderes, atualmente consagrada em muitas das modernas constitui&ccedil;&otilde;es internacionais, inclusive a Constitui&ccedil;&atilde;o Brasileira. Para Montesquieu, um governo leg&iacute;timo e bem estruturado deveria ter um corpo de leis, e o poder estatal deveria ser segmentado em tr&ecirc;s esferas. A defesa da separa&ccedil;&atilde;o dos poderes estava assentada na necessidade de que um poder vigiasse o outro, com o objetivo de verificar o cumprimento da Constitui&ccedil;&atilde;o e garantir que n&atilde;o haja abusos de autoridade. <br /><img style="max-width: 100%; padding: 10px;" src="medias/DE.3_MNT_3.png" alt="" /><strong> T&iacute;tulo: </strong> Montesquieu <strong>Fonte:</strong> Prosa (2024b).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>


<p class="paragrafo">Na obra <em>Antropologia para Administradores </em>(2003), a professora brasileira Neusa Cavedon traz para a reflex&atilde;o a met&aacute;fora dos pinguins e do pav&atilde;o. Os pinguins, cansados da mesmice entre eles, contrataram um pav&atilde;o para lider&aacute;-los, mas aos poucos foram transformando o pav&atilde;o em pinguim. Ou seja, se incorrermos numa vis&atilde;o autorit&aacute;ria e na anula&ccedil;&atilde;o dos indiv&iacute;duos (situa&ccedil;&atilde;o na qual os pinguins determinam que o pav&atilde;o seja um pinguim), n&atilde;o permitiremos que as subjetividades possam ser livres e diferentes, o que seria um desastre para uma gest&atilde;o democr&aacute;tica.</p>


<p class="paragrafo">Por outro lado, as institui&ccedil;&otilde;es n&atilde;o estariam cumprindo seu papel se transformassem a gest&atilde;o em modos de subjetiva&ccedil;&atilde;o, mecanismos de controle, vigil&acirc;ncia e puni&ccedil;&atilde;o, como no <strong>pan&oacute;ptico</strong> de <span class="modal-button button" data-toggle="modal" data-target="#modal-3">Michel Foucault</span>. Em contrapartida, se cada indiv&iacute;duo imp&otilde;e suas convic&ccedil;&otilde;es e demandas imediatas ao todo da institui&ccedil;&atilde;o, temos a nega&ccedil;&atilde;o gradativa dos princ&iacute;pios do bem comum, o que de muitos modos inviabilizaria a vida em coletividade. Ent&atilde;o, para contornar isso, o segredo parece ser a <strong>justa medida entre o excesso e a falta</strong>. Um caminho intermedi&aacute;rio em que todos se sintam contemplados de alguma forma, mas sem perdermos o horizonte do prop&oacute;sito fim de uma institui&ccedil;&atilde;o. <span>Observe abaixo uma ilustra&ccedil;&atilde;o que retrata a met&aacute;fora dos pinguins e do pav&atilde;o:</span></p>


<div id="recursos-azul">
<div id="modal-3" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Michel Foucault</h5>
</div>
<div class="modal-body nota">Michel Foucault, fil&oacute;sofo franc&ecirc;s, &eacute; amplamente reconhecido por suas an&aacute;lises sobre poder, conhecimento e disciplina na sociedade moderna. Sua obra destaca a maneira como as institui&ccedil;&otilde;es sociais, como pris&otilde;es, escolas e hospitais, exercem controle sobre os indiv&iacute;duos, moldando comportamentos e identidades. Um dos conceitos centrais em sua an&aacute;lise &eacute; o pan&oacute;ptico, inspirado na arquitetura da pris&atilde;o projetada por Jeremy Bentham no s&eacute;culo XVIII.
<p>&nbsp;</p>
O pan&oacute;ptico &eacute; um modelo de vigil&acirc;ncia que permite a um &uacute;nico guardi&atilde;o observar todos os prisioneiros sem que eles saibam quando est&atilde;o sendo observados. Essa estrutura n&atilde;o apenas promove a disciplina atrav&eacute;s da vigil&acirc;ncia, mas tamb&eacute;m instaura um estado de autocontrole nos indiv&iacute;duos, que, conscientes da possibilidade de serem observados a qualquer momento, regulam seu pr&oacute;prio comportamento. Foucault utiliza essa met&aacute;fora para ilustrar como a sociedade moderna implementa formas sutis de controle social, em que a vigil&acirc;ncia se torna uma pr&aacute;tica cotidiana, invis&iacute;vel, mas profundamente enraizada. <br /><img style="max-width: 100%; padding: 10px;" src="medias/DE.3_MNT_6 (2).png" alt="" /><strong> </strong><strong>T&iacute;tulo:</strong> Michel Foucault <strong>Fonte:</strong> Arquivo Nacional (1974). <strong>Elabora&ccedil;&atilde;o:</strong> Prosa (2024c).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>


<p><img class="card-curso-topo-image" src="medias/DE.3_INF_4.png" alt="Pinguins e pav&atilde;o" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Pinguins e pav&atilde;o<br /><strong>Fonte: </strong>Prosa (2024d).</p>

<p>&nbsp;</p>
<div class="nav-pagination">
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="referencias-2.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina2-2.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 9 de 19</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>