<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Democracia e gestão democrática na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul" class="chapter-info">
<div id="content-cover">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="chapter-info col-md-8 offset-md-2">
<h4 class="chapter-label">CAP&Iacute;TULO 2</h4>
<h1 class="chapter-title"><span style="color: #2dc26b;">O que &eacute; Gest&atilde;o Democr&aacute;tica na EPT?</span></h1>
</div>
</div>
<div class="row">
<div class="col-md-12 p-0">
<div class="jumbotron"><img src="medias/53298198815_3d2b755017_o.jpg" alt="Institutos Federais de Educa&ccedil;&atilde;o, Ci&ecirc;ncia e Tecnologia (IFs) (a)" width="100%" height="100%" /></div>
</div>
</div>
</div>
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page">
<div id="recursos-azul" class="quote-1"></div>

<p class="content paragrafo" style="text-align: right; padding-left: 200px;"><em>A tend&ecirc;ncia democr&aacute;tica, intrinsecamente, n&atilde;o pode significar apenas que um oper&aacute;rio manual se torne qualificado, mas que cada cidad&atilde;o possa se tornar governante.</em></p>
<p class="content paragrafo" style="text-align: right;"><strong><em>(</em>Antonio Gramsci,<em>&nbsp; Cadernos do C&aacute;rcere<span style="font-size: 1.1em;">)</span></em></strong></p>

<p class="content paragrafo">Conforme vimos na discuss&atilde;o do cap&iacute;tulo anterior, a democracia n&atilde;o &eacute; um produto, mas um <strong>processo &aacute;rduo e permanente</strong> que visa ampliar todos os meios e mecanismos de participa&ccedil;&atilde;o, de modo que os membros envolvidos no processo formativo sintam-se parte &ndash; e motivados a tomarem parte &ndash; nas decis&otilde;es. Muitas vezes, o sentido da gest&atilde;o em EPT &eacute; distorcido, por sua rela&ccedil;&atilde;o indevida com a administra&ccedil;&atilde;o empresarial ou mesmo com a administra&ccedil;&atilde;o escolar em seu sentido amplo. <span class="modal-button button" data-toggle="modal" data-target="#modal-1">Vitor Paro </span>(2010) alerta que, quando pensamos que a figura mais importante do processo &eacute; o gestor, corremos o risco de reduzir a gest&atilde;o democr&aacute;tica a um taylorismo.</p>


<div id="recursos-azul">
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Vitor Paro</h5>
</div>
<div class="modal-body nota">Vitor Henrique Paro &eacute; professor em&eacute;rito da Faculdade de Educa&ccedil;&atilde;o da Universidade de S&atilde;o Paulo, onde atua como professor titular e coordenador do Grupo de Estudos e Pesquisas em Administra&ccedil;&atilde;o Escolar (Gepae). Ele tamb&eacute;m foi pesquisador s&ecirc;nior da Funda&ccedil;&atilde;o Carlos Chagas e professor titular da PUC-SP. Paro &eacute; autor de diversas obras, incluindo: <em>Administra&ccedil;&atilde;o Escolar: Introdu&ccedil;&atilde;o Cr&iacute;tica; Gest&atilde;o Democr&aacute;tica da Escola P&uacute;blica; Por Dentro da Escola P&uacute;blica; Educa&ccedil;&atilde;o como Exerc&iacute;cio do Poder; Cr&iacute;tica da Estrutura da Escola; Professor: Artes&atilde;o ou Oper&aacute;rio?</em> e; <em>O Capital para Educadores.</em><br /><img style="max-width: 100%; padding: 10px;" src="medias/DE.2_MNT_1_2.png" alt="" /><strong>Titulo:</strong> Vitor Henrique Paro <strong>Fonte:</strong> Marcos Santos (2023). <strong>Elabora&ccedil;&atilde;o:</strong> Prosa (2024a).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>


<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Para os estudos da administra&ccedil;&atilde;o (ou gest&atilde;o) escolar, o que surpreende n&atilde;o &eacute; a exist&ecirc;ncia do discurso que valoriza a figura do diretor, pois, como vimos, ele vem-se repetindo h&aacute; muito tempo. O que intriga &eacute; a relativa escassez, no &acirc;mbito das investiga&ccedil;&otilde;es sobre a realidade escolar no Brasil, de estudos e pesquisas a respeito da natureza e do significado das fun&ccedil;&otilde;es do diretor de escola &agrave; luz da natureza educativa dessa institui&ccedil;&atilde;o</p>
<div class="author citacao-longa-autoria">&nbsp;(Paro, 2010, p. 766).</div>
</div>


<p class="paragrafo">Conv&eacute;m lembrarmos as peculiaridades da EPT, que &eacute; um projeto &eacute;tico-pol&iacute;tico em conson&acirc;ncia com a suas nuances metodol&oacute;gicas e pedag&oacute;gicas, n&atilde;o podendo ser concebida ou gerida como uma empresa ou mesmo como um processo formativo gen&eacute;rico. Isso porque nas empresas o foco recai sobre a produ&ccedil;&atilde;o (processos e produtos), que visa, em geral, a um v&iacute;nculo com o protagonismo do capital. Da mesma forma, por sermos, na EPT, as primeiras organiza&ccedil;&otilde;es mundiais que pretendem levar em conta o<span class="modal-button button" data-toggle="modal" data-target="#modal-2">&nbsp;trabalho como princ&iacute;pio educativo </span>que possibilita a<span class="modal-button button" data-toggle="modal" data-target="#modal-3"> forma&ccedil;&atilde;o omnilateral</span>, precisamos ter consci&ecirc;ncia do sentido da administra&ccedil;&atilde;o, mas sem que isso seja descontextualizado. <span style="background-color: #bfedd2;">Podemos, aqui, delimitar a gest&atilde;o como a utiliza&ccedil;&atilde;o de todo e qualquer recurso que possa mediar racionalmente os processos visando uma aprendizagem cidad&atilde;.</span></p>


<div id="recursos-azul">
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-body nota">"Afinal, considerar o trabalho como princ&iacute;pio educativo significa dizer que o ser humano &eacute; produtor de sua realidade e, por isso, apropria-se dela e pode transform&aacute;-la. Isso tamb&eacute;m implica que as pessoas sejam agentes da hist&oacute;ria. Em s&iacute;ntese, o trabalho &eacute; a primeira media&ccedil;&atilde;o entre as pessoas e a realidade material e social" (Ramos, 2004; Brasil, 2007).</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>


<div id="recursos-azul">
<div id="modal-3" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-body nota">A forma&ccedil;&atilde;o de profissionais para a Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (EPT) deve estar em constante di&aacute;logo com a forma&ccedil;&atilde;o de docentes da educa&ccedil;&atilde;o b&aacute;sica, especialmente em conte&uacute;dos proped&ecirc;uticos. Essa forma&ccedil;&atilde;o precisa alinhar-se ainda com as pol&iacute;ticas sociais e econ&ocirc;micas, tendo o trabalho como fundamento educativo e considerando a perspectiva da omnilateralidade e da escola unit&aacute;ria. Isso significa que deve haver uma integra&ccedil;&atilde;o entre esse princ&iacute;pio e as esferas da ci&ecirc;ncia, tecnologia e cultura. Al&eacute;m disso, &eacute; essencial que essa forma&ccedil;&atilde;o inclua uma an&aacute;lise cr&iacute;tica da sociedade brasileira e da realidade educacional, levando em conta com a escola como um todo &mdash; desde as pr&aacute;ticas pedag&oacute;gicas e a vida escolar, at&eacute; os processos de gest&atilde;o, organiza&ccedil;&atilde;o institucional e intera&ccedil;&atilde;o com a comunidade ao redor.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>


<p class="paragrafo">Segundo Paro (2010), o conceito de administra&ccedil;&atilde;o deve ser compreendido pelo seu car&aacute;ter generalizante, capaz de englobar todos os tipos de gest&atilde;o sem considerar as particularidades de cada &aacute;rea. Importa menos a natureza daquilo que &eacute; administrado do que o objetivo da administra&ccedil;&atilde;o em si &ndash; que &eacute; a racionaliza&ccedil;&atilde;o de recursos para um determinado fim. &Eacute; por esse motivo que podemos considerar a administra&ccedil;&atilde;o em diferentes contextos: a industrial, a p&uacute;blica, a escolar etc.</p>

<p>&nbsp;</p>
<p class="content paragrafo quote citacao-curta strong"><strong>Politecnia e Antipolitecnia&nbsp;</strong></p>


<p class="paragrafo">As empresas valem-se da administra&ccedil;&atilde;o cient&iacute;fica, comumente vinculadas ao Taylorismo (deixar claro quem manda e quem obedece), ao Fordismo (automatizar os processos de produ&ccedil;&atilde;o) e ao Toyotismo (ler, interpretar e obedecer os ditames do mercado), sendo que nesses modelos de gest&atilde;o o trabalhador nunca &eacute; considerado como sujeito, mas como <em>mero objeto</em> para a amplia&ccedil;&atilde;o (ou n&atilde;o) do lucro ou da produ&ccedil;&atilde;o. Entretanto precisamos considerar que os processos e a gest&atilde;o &ndash; principalmente a gest&atilde;o democr&aacute;tica &ndash; precisam ir al&eacute;m do mercantilismo instrumental, &nbsp;no qual o capital &eacute; a &uacute;nica coisa que importa e as pessoas passam a ser apenas entendidas como meros objetos. Nesse sentido, <span style="background-color: #bfedd2;">em EPT a educa&ccedil;&atilde;o n&atilde;o pode ser gerida como numa unidade produtiva, pois nossa miss&atilde;o &eacute; inserir o estudante no mundo do trabalho como protagonista e n&atilde;o como objeto ou mera m&atilde;o de obra barata.</span> <span>Confira no infogr&aacute;fico abaixo as principais diferen&ccedil;as entre os modelos de gest&atilde;o mencionados:</span></p>


<p><img class="card-curso-topo-image" src="medias/DE.2_INF_2.png" alt="Taylorismo, Fordismo e Toyotismo" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><span><strong>Titulo: </strong>Taylorismo, Fordismo e Toyotismo </span><br /><span><strong>Fonte: </strong>Prosa (2024b).</span></p>

<p class="paragrafo">Vitor Paro (2010) alerta para essa especificidade da gest&atilde;o do trabalho docente ou do trabalho pedag&oacute;gico visando o fim da gest&atilde;o escolar, que, em termos gerais, n&atilde;o tem a mesma natureza das empresas. Trata-se de identificar que o trabalho do professor &eacute; diferente de outras formas de trabalho. Por exemplo, numa olaria que produz tijolos, o processo &eacute; repetitivo, uniforme, linear e autom&aacute;tico. A m&uacute;sica <a rel="noopener" href="https://www.youtube.com/watch?v=-cfJqYtmmqA" target="_blank">"Another Brick in the Wall"</a>, do Pink Floyd, representa bem essa tentativa de uniformiza&ccedil;&atilde;o e dilui&ccedil;&atilde;o das diferen&ccedil;as na unicidade. Entretanto, a<span style="color: #000000;"> institui&ccedil;&atilde;o de EPT </span>n&atilde;o &eacute; uma f&aacute;brica de tijolos, nem qualquer outra ind&uacute;stria, e, portanto, a gest&atilde;o n&atilde;o pode ser compreendida segundo uma l&oacute;gica taylorista, fordista ou toyotista. Nosso objetivo n&atilde;o &eacute; formarmos, como numa esteira fabril, pessoas submissas e alienadas para um determinado fim, mas <span style="background-color: #bfedd2;">produzir uma gest&atilde;o que compreenda que a rela&ccedil;&atilde;o entre educa&ccedil;&atilde;o e forma&ccedil;&atilde;o omnilateral pressup&otilde;e empoderamento e autonomia dos indiv&iacute;duos.</span></p>


<p class="paragrafo">A hierarquiza&ccedil;&atilde;o das decis&otilde;es presentes no Taylorismo &eacute; retratada no filme "Tempos Modernos", de Charles Chaplin, em que se percebe em tela a forma&ccedil;&atilde;o t&eacute;cnica reduzida a esfor&ccedil;os e gestos repetitivos, realizados sem reflex&atilde;o, voltados exclusivamente para atender &agrave;s demandas do setor de produ&ccedil;&atilde;o de artefatos. N&atilde;o pode haver democracia e gest&atilde;o democr&aacute;tica no taylorismo (ou na gest&atilde;o taylorista) porque a premissa de controle dos processos e das pessoas nesse modelo &eacute; similar &agrave; dial&eacute;tica do senhor e do escravo, concebida por<span class="modal-button button" data-toggle="modal" data-target="#modal-4"> Georg Hegel</span>. No longa metragem, tem-se claramente a ideia de que o tempo &eacute; a premissa b&aacute;sica da economia na produ&ccedil;&atilde;o, e, por isso, o trabalhador precisa ser controlado &ndash; por m&aacute;quinas ou por pessoas &ndash; para apenas produzir, embora n&atilde;o saiba o porqu&ecirc; de produzir o que est&aacute; produzindo e desconhe&ccedil;a o que est&aacute; no fim da esteira do processo produtivo. "Tempos Modernos" &eacute; uma representa&ccedil;&atilde;o que vai na contram&atilde;o da <span class="primary-color"><strong>politecnia</strong>&nbsp;<button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Conceito pedag&oacute;gico que integra o trabalho como princ&iacute;pio educativo, unindo a instru&ccedil;&atilde;o intelectual e o trabalho produtivo.">+ </button></span>.&nbsp;&nbsp;</p>


<div id="recursos-azul">
<div id="modal-4" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Georg Hegel</h5>
</div>
<div class="modal-body nota">Georg Wilhelm Friedrich Hegel (1770-1831) foi um fil&oacute;sofo alem&atilde;o e principal representante do idealismo. &Eacute; conhecido por desenvolver a dial&eacute;tica como um processo de transforma&ccedil;&atilde;o cont&iacute;nua, em que a realidade avan&ccedil;a por meio de contradi&ccedil;&otilde;es (tese, ant&iacute;tese e s&iacute;ntese). Ele via a hist&oacute;ria como o progresso do Esp&iacute;rito em dire&ccedil;&atilde;o &agrave; liberdade. Principais cr&iacute;ticas de Hegel: Idealismo de Kant e Fichte &ndash; criticou a separa&ccedil;&atilde;o entre o mundo dos espec&iacute;ficos e a realidade &uacute;ltima, propondo uma vis&atilde;o unificada da realidade; iluminismo e empirismo &ndash; criticou a ideia de que a raz&atilde;o ou a experi&ecirc;ncia sensorial por si s&oacute; pudesse compreender a totalidade da realidade, sem refletir o desenvolvimento hist&oacute;rico; hist&oacute;ria dial&eacute;tica &ndash; defendeu que a hist&oacute;ria evolui por meio de contradi&ccedil;&otilde;es, levando &agrave; realiza&ccedil;&atilde;o do Esp&iacute;rito Absoluto; moralidade abstrata &ndash; rejeitou a moralidade universal sem o contexto social, argumentando que normas &eacute;ticas surgem dentro das institui&ccedil;&otilde;es sociais; liberdade e Estado &ndash; a verdadeira liberdade, para Hegel, s&oacute; &eacute; alcan&ccedil;ada no contexto de um Estado racional, que harmoniza os interesses individuais e coletivos. Ele influenciou profundamente fil&oacute;sofos como Karl Marx e o pensamento pol&iacute;tico-social posterior.<br /><img style="max-width: 100%; padding: 10px;" src="medias/DE.2_MNT_3.png" alt="" /><strong>Titulo:</strong> Georg Hegel <strong>Fonte:</strong> Jakob Schlesinger (s.d.). <strong>Elabora&ccedil;&atilde;o:</strong> Prosa (2024c).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>


<p class="paragrafo">Na <strong>antipolitecnia</strong> da produ&ccedil;&atilde;o em s&eacute;rie, cada um executa apenas&nbsp;sua fun&ccedil;&atilde;o sem saber por que e sem conhecer o todo. A gest&atilde;o do tempo e das pessoas n&atilde;o &eacute; para um prop&oacute;sito ou finalidade fundada no bem comum, mas no simples prop&oacute;sito de atender as demandas do senhorio. A vis&atilde;o expressa nesse tipo de gest&atilde;o &eacute; a aplica&ccedil;&atilde;o do <span class="modal-button button" style="font-size: 20px;" data-toggle="modal" data-target="#modal-5">pensamento cartesiano</span> &agrave; produ&ccedil;&atilde;o. No caso do Fordismo, a meta &eacute; n&atilde;o perder tempo, ou mesmo controlar o tempo do trabalhador para que ele entregue n&atilde;o aquilo que o realize ou humanize, mas sim a demanda espec&iacute;fica e a necessidade imediata do dono do capital.&nbsp;</p>


<div id="recursos-azul">
<div id="modal-5" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-body nota">O pensamento cartesiano, desenvolvido por Ren&eacute; Descartes nos s&eacute;culos XVII e XVIII, &eacute; caracterizado pela d&uacute;vida met&oacute;dica (questionar tudo at&eacute; encontrar a verdade), o racionalismo (prioriza&ccedil;&atilde;o da raz&atilde;o sobre os sentidos), a dedu&ccedil;&atilde;o (partir de verdades simples para ra&iacute;zes complexas) e a separa&ccedil;&atilde;o entre sujeito e objeto, fundamental na filosofia moderna. Esse pensamento &eacute; um pilar da Ci&ecirc;ncia Moderna e ainda influencia disciplinas como a matem&aacute;tica e a f&iacute;sica.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>


<p class="paragrafo">Na primeira parte da obra <em>A Riqueza das Na&ccedil;&otilde;es,</em> Adam Smith (1983) sugeriu que a produ&ccedil;&atilde;o de alfinetes seria ampliada e potencializada se cada trabalhador fizesse apenas uma parte do processo fabril, especializando-se e fixando-se no fazer automatizado, sem precisar conhecer todas as etapas da produ&ccedil;&atilde;o ou pensar em qual seria a melhor forma de produzir esse objeto. <span style="background-color: #bfedd2;">Em outras palavras, quem aponta o alfinete deve saber apenas apontar; quem for fazer a cabe&ccedil;a do alfinete ou a croma&ccedil;&atilde;o, e assim por diante, n&atilde;o precisaria saber nada al&eacute;m do pr&oacute;prio of&iacute;cio.</span> Nesse sistema, a produ&ccedil;&atilde;o das pe&ccedil;as potencialmente aumentaria, e a forma&ccedil;&atilde;o dos trabalhadores n&atilde;o demandaria uma base geral e ampla, mas espec&iacute;fica e superficial, considerando que suas necessidades de aprendizagens tamb&eacute;m seriam bem instrumentais.&nbsp;</p>


<p><strong><img class="card-curso-topo-image" src="medias/DE.2_ILU_4.png" alt="A Evolu&ccedil;&atilde;o no Processo Produtivo" width="100%" height="100%" /></strong></p>
<p class="legenda" style="text-align: center;"><strong>Titulo:</strong> A Evolu&ccedil;&atilde;o no Processo Produtivo <br /><strong>Fonte:</strong> Prosa (2024d).</p>


<p class="paragrafo">Dessa forma, ainda que a ideia de otimizar o tempo e reduzir os custos (como no Toyotismo) considere a qualidade total dos processos, o trabalhador em si n&atilde;o &eacute; o sujeito central &ndash; ele &eacute; apenas parte acidental para potencializar a produ&ccedil;&atilde;o e expandir o lucro. <span style="background-color: #bfedd2;">Pensando na EPT, &eacute; imprescind&iacute;vel que a gest&atilde;o do ensino e da aprendizagem n&atilde;o confunda as no&ccedil;&otilde;es de efici&ecirc;ncia e efic&aacute;cia, que se baseiam estritamente na quest&atilde;o monet&aacute;ria.</span>&nbsp;</p>


<p class="paragrafo">Dito de outro modo, na gest&atilde;o empresarial, consideramos algo <strong>eficaz</strong> quando cumpre sua finalidade de aumentar o lucro e diminuir os custos, e s&atilde;o <strong>eficientes </strong>os processos ou t&eacute;cnicas que cumprem esse objetivo. Mas, no caso do ensino, o valor gasto com a educa&ccedil;&atilde;o ou a forma&ccedil;&atilde;o n&atilde;o pode ser entendido apenas como gasto, pois &eacute; <em>investimento.</em> Nessa perspectiva, o crit&eacute;rio meramente quantitativo (aplicado &agrave;s empresas) para interpretar dados sobre educa&ccedil;&atilde;o pode n&atilde;o fazer sentido. Tomemos como exemplo uma turma de EJA que iniciou com 35 estudantes e terminou com 15. Por mais que a institui&ccedil;&atilde;o possa ter investido em fluxos e processos, a efic&aacute;cia, nesse sentido, n&atilde;o ocorreu como o esperado, j&aacute; que existem muitas causas e fatores que podem ter causado o insucesso. E, ainda que se tivesse formado apenas um indiv&iacute;duo, ele &eacute; merecedor do investimento do Estado, considerando que a <strong>educa&ccedil;&atilde;o &eacute; direito fundamental</strong>.&nbsp;</p>


<p class="paragrafo">Isso posto para elucidar que, <span style="background-color: #bfedd2;">em se tratando de qualidade e valor, no sentido &eacute;tico e moral, a mera tabula&ccedil;&atilde;o de investimento e resultados n&atilde;o resolve a diferen&ccedil;a entre efici&ecirc;ncia e efic&aacute;cia.</span>&nbsp;Embora existam plataformas como a&nbsp;<span class="modal-button button" data-toggle="modal" data-target="#modal-6">Nilo Pe&ccedil;anha</span> para registrar todos os fluxos do acesso, da perman&ecirc;ncia e do &ecirc;xito de nossos estudantes, ela n&atilde;o tem como registrar o valor e a import&acirc;ncia do conhecimento na vida de cada indiv&iacute;duo.&nbsp;</p>


<div id="recursos-azul">
<div id="modal-6" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Nilo Pe&ccedil;anha</h5>
</div>
<div class="modal-body nota">A Plataforma Nilo Pe&ccedil;anha (PNP) &eacute; um sistema on-line que coleta, valida e divulga as estat&iacute;sticas oficiais da Rede Federal de Educa&ccedil;&atilde;o Profissional, Cient&iacute;fica e Tecnol&oacute;gica. Seu objetivo &eacute; reunir dados sobre docentes, discentes, servidores t&eacute;cnico-administrativos e despesas financeiras das unidades da Rede, solicitadas de base para o c&aacute;lculo dos indicadores de gest&atilde;o monitorados pela Secretaria de Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica do Minist&eacute;rio da Educa&ccedil;&atilde;o (Brasil, [2025]).
<p>&nbsp;</p>
Acesse e explore a <a href="https://www.gov.br/mec/pt-br/pnp" target="&rdquo;_blank&rdquo;"> Plataforma Nilo Pe&ccedil;anha</a>.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"><a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a></button></div>
</div>
</div>
</div>
</div>


<div id="recursos-azul" class="feat-box-foto">

<p class="content destaque">Em EPT, a no&ccedil;&atilde;o de efici&ecirc;ncia tem rela&ccedil;&atilde;o com o cumprimento de nossa miss&atilde;o diante das bases legais e conceituais, enquanto a efic&aacute;cia tem rela&ccedil;&atilde;o com o resultado disso, do ponto de vista dos fluxos diversos nas a&ccedil;&otilde;es diretas e indiretas do ensino. Por isso, <strong>n&atilde;o podemos reduzir efici&ecirc;ncia e efic&aacute;cia ao meramente burocr&aacute;tico, ao quantitativo e ao or&ccedil;ament&aacute;rio</strong>. A dimens&atilde;o or&ccedil;ament&aacute;ria &eacute; fundamental para o andamento das a&ccedil;&otilde;es de ensino e aprendizagem, mas os processos relacionados ao resultado de nossas a&ccedil;&otilde;es, a nossa atividade-fim devem ser os crit&eacute;rios primeiros ao avaliarmos o sentido do que fazemos enquanto institui&ccedil;&atilde;o educacional.</p>

</div>


<p class="paragrafo">A educa&ccedil;&atilde;o b&aacute;sica &eacute; investimento e n&atilde;o despesa corrente &ndash; &eacute; um direito humano fundamental, e n&atilde;o um favor do Estado. Por isso, precisamos ter em mente que:</p>


<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Embora sejam v&aacute;rias as motiva&ccedil;&otilde;es para essa valoriza&ccedil;&atilde;o da administra&ccedil;&atilde;o escolar &ndash; e n&atilde;o faltam aqueles que s&atilde;o a favor de uma maior &ldquo;efici&ecirc;ncia&rdquo; da administra&ccedil;&atilde;o escolar com a &uacute;nica ou prec&iacute;pua preocupa&ccedil;&atilde;o com os custos do ensino &ndash;, a justificativa comum &eacute; a de que o ensino &eacute; importante, e &eacute; por isso que se deve realiz&aacute;-lo da forma mais racional e eficiente; portanto, &eacute; fundamental o modo como a escola &eacute; administrada&nbsp;</p>
<div class="author citacao-longa-autoria">&nbsp;(Paro, 2010, p. 3).</div>
</div>


<p class="paragrafo">Devemos considerar que o termo efici&ecirc;ncia, usado inclusive nas decis&otilde;es or&ccedil;ament&aacute;rias para a rede federal<span style="color: #000000;">, por exemplo, </span>carrega uma contradi&ccedil;&atilde;o grave. Claro que precisamos, em termos de gest&atilde;o, otimizar recursos e valorizar o resultado dos processos empreendidos, entretanto a educa&ccedil;&atilde;o n&atilde;o objetiva fabricar coisas, e n&atilde;o h&aacute; como mensurar o progresso humano de algu&eacute;m com a r&eacute;gua do quantitativo.&nbsp;</p>


<p class="paragrafo">Quando falamos em pol&iacute;ticas p&uacute;blicas destinadas &agrave; transforma&ccedil;&atilde;o da escola b&aacute;sica, Paro (2010) salienta que devemos ter em mente que a gest&atilde;o do espa&ccedil;o escolar deve estar preocupada com a educa&ccedil;&atilde;o em sua especificidade, entendendo-a como um espa&ccedil;o pedag&oacute;gico em constru&ccedil;&atilde;o. Essa vis&atilde;o implica, necessariamente, na articula&ccedil;&atilde;o entre a <strong>administra&ccedil;&atilde;o</strong>&nbsp;e a <strong>pr&aacute;xis social</strong>&nbsp;e <strong>pol&iacute;tica</strong>.</p>

<div class="nav-pagination">
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" rel="noopener" href="referencias.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" rel="noopener" href="pagina2.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 6 de 19</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>