<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Democracia e gestão democrática na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Diversidade e Inclus&atilde;o como aspectos da Gest&atilde;o Democr&aacute;tica</strong></p>

<p><span style="font-weight: 400;"><span style="color: #000000;">Outra potencialidade de democratiza&ccedil;&atilde;o de acolhimento das diferen&ccedil;as e minorias &eacute; o exemplo dos n&uacute;cleos que os campi, no caso da Rede Federal, podem incentivar: NEABI (N&uacute;cleo de Estudos Afro-Brasileiros e Ind&iacute;genas), NUGEDIS (N&uacute;cleo de G&ecirc;nero e Diversidade Sexual), </span>entre outros. Esses espa&ccedil;os precisam ser compreendidos e incentivados como </span><strong>inst&acirc;ncias de acolhimento, treinamento e uma grande estrat&eacute;gia de forma&ccedil;&atilde;o cidad&atilde;</strong>,<strong> </strong><span style="font-weight: 400;">tanto no sentido de que as pessoas possam se sentir acolhidas e fortalecidas como na constru&ccedil;&atilde;o de um lugar de representatividade dentro da institui&ccedil;&atilde;o.</span></p>


<p class="paragrafo">Muitas vezes, o racismo, o preconceito, a misoginia, a discrimina&ccedil;&atilde;o e tantas outras formas culturais de opress&atilde;o e totalitarismo precisam ser dirimidos e problematizados em lugares menores e de total confian&ccedil;a. Por exemplo, quest&otilde;es ligadas ao ass&eacute;dio de toda sorte e ao preconceito de religi&atilde;o ou ra&ccedil;a s&atilde;o velados recorrentemente nos espa&ccedil;os formativos por falta de coragem e de espa&ccedil;o para manifesta&ccedil;&atilde;o. Quando os n&uacute;cleos cumprem bem seu papel, podem ser ambientes para que in&uacute;meras viol&ecirc;ncias conceituais (e at&eacute; mesmo f&iacute;sicas e psicol&oacute;gicas) possam ser avaliadas, analisadas, criticadas, pensadas e superadas coletivamente. <span>Espa&ccedil;os seguros contra o preconceito podem ser criados e promovidos, como exemplificado na ilustra&ccedil;&atilde;o abaixo.</span></p>


<p><img class="card-curso-topo-image" src="medias/DE.3_ILU_9.png" alt="Gr&ecirc;mio estudantil democr&aacute;tico" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><span><strong>T&iacute;tulo:</strong>&nbsp;Gr&ecirc;mio estudantil democr&aacute;tico</span><br /><span><strong>Fonte: </strong>Prosa (2024g).</span></p>


<p class="paragrafo">Assim, &eacute; crucial que essas quest&otilde;es sejam priorizadas, incentivadas e compreendidas como espa&ccedil;o estrat&eacute;gico de forma&ccedil;&atilde;o cidad&atilde;. A institui&ccedil;&atilde;o n&atilde;o pode delegar para essas a&ccedil;&otilde;es fundamentais um servidor que n&atilde;o tenha identifica&ccedil;&atilde;o ou comprometimento com o tema. N&atilde;o se trata de colocar um servidor que tenha baixa carga hor&aacute;ria de trabalho para acompanhar essas atividades, <span style="background-color: #bfedd2;">&eacute; necess&aacute;rio que se escolha algu&eacute;m que realmente compreenda, assuma e dinamize espa&ccedil;os de acolhimento e de milit&acirc;ncia pol&iacute;tica</span>, com representatividade leg&iacute;tima desses pares e segmentos nas inst&acirc;ncias decis&oacute;rias institucionais.&nbsp;</p>

<p class="content paragrafo quote citacao-curta strong"><strong>Sentido &eacute;tico-pol&iacute;tico das representatividades</strong></p>
<p>Paro (2010) mostra que tamb&eacute;m &eacute; importante a considera&ccedil;&atilde;o de que devemos fazer a representatividade docente, que precisa estar devidamente envolvida nas demandas e necessidades da categoria, com suas devidas e leg&iacute;timas representatividades. <span style="background-color: #bfedd2;">A dimens&atilde;o &eacute;tico-pol&iacute;tica da pr&aacute;xis docente deve ser estimulada com forma&ccedil;&atilde;o permanente e espa&ccedil;os de escuta.</span>&nbsp;Sempre considerando que, independente do n&iacute;vel de ensino, a colegialidade &eacute; sempre o mais eficaz ant&iacute;doto contra toda e qualquer forma de totalitarismo.&nbsp;</p>

<p class="paragrafo">Cabe mencionar aqui a import&acirc;ncia dos servi&ccedil;os terceirizados, que tamb&eacute;m precisam ser ouvidos e considerados. A estrat&eacute;gia de sintonia pode se dar pelos fiscais de contrato ou mesmo pelos coordenadores de setores, que devem manter vigil&acirc;ncia sobre as condi&ccedil;&otilde;es de trabalho, sobre seus pr&oacute;prios direitos e deveres e, ainda, incluir na pauta das decis&otilde;es institucionais a percep&ccedil;&atilde;o, o entendimento e as demandas latentes daqueles que operam cotidianamente para o bom funcionamento da institui&ccedil;&atilde;o.</p>


<p class="paragrafo">Uma gest&atilde;o verdadeiramente democr&aacute;tica, ainda mais na EPT, <span style="background-color: #bfedd2;">precisa exercitar o trabalho como princ&iacute;pio educativo em todos os seus setores e servi&ccedil;os, com todos os sujeitos que atuam para que a miss&atilde;o de servir &agrave; sociedade seja gradativamente mais eficiente.</span></p>


<p><img class="card-curso-topo-image" src="medias/DE.3_ILU_10.PNG" alt="Construindo um Ambiente Seguro e Colaborativo na Escola" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo:</strong> Construindo um ambiente seguro e colaborativo na escola<br /><strong>Fonte: </strong>Prosa (2024h).</p>


<p class="paragrafo">Lembrando que, do ponto de vista pol&iacute;tico, a institui&ccedil;&atilde;o possui um vi&eacute;s pedag&oacute;gico, a gest&atilde;o democr&aacute;tica &eacute;, portanto, um processo cont&iacute;nuo e &aacute;rduo. Isso precisa ser dito porque muitos a compreendem como mero exerc&iacute;cio privado e, usando a fal&aacute;cia do falso dilema, defendem que o gestor &eacute; democr&aacute;tico na medida em que atende todas as demandas individuais &ndash; mesmo que isso prejudique a coletividade. Entretanto, a quest&atilde;o &eacute; inversa: <span style="background-color: #bfedd2;">quem faz gest&atilde;o n&atilde;o pode perder o horizonte e o compromisso com o prop&oacute;sito institucional, o sentido e a natureza da atividade-fim.</span></p>


<p class="paragrafo">Markoff (2013) argumenta que gest&atilde;o n&atilde;o &eacute; para fazer ou obter favores, mas para <strong>cuidar</strong>, <strong>zelar</strong> e <strong>exercitar o compromisso com o bem comum e com a miss&atilde;o institucional</strong>, que vai al&eacute;m do interesse imediato dos servidores. Isso n&atilde;o significa que devemos estar sob o jugo de uma tirania coletivista, mas, se primarmos pelo bem-estar somente de alguns, teremos o que Arist&oacute;teles denominou como oligarquia, e n&atilde;o gest&atilde;o democr&aacute;tica.</p>


<p class="paragrafo">No sentido pedag&oacute;gico, &eacute; importante que os cursos de diferentes n&iacute;veis de ensino possam criar a sua representatividade atrav&eacute;s de um N&uacute;cleo Pedag&oacute;gico Integrado (NPI), para que todos os cursos tenham suas demandas minimamente atendidas e tamb&eacute;m para que a institui&ccedil;&atilde;o n&atilde;o se distancie da sua atividade-fim. Em suma, a colegialidade em todas as suas express&otilde;es e significados deve considerar todos os seus segmentos e categorias com o compromisso fiel ao prop&oacute;sito maior e &uacute;ltimo da institui&ccedil;&atilde;o. As representa&ccedil;&otilde;es docentes, discentes, da sociedade civil organizada, dos trabalhadores terceirizados, dos t&eacute;cnicos em assuntos educacionais, entre outros coletivos, devem estar alinhadas ao sentido &uacute;ltimo da EPT, ou seja, devem <span style="background-color: #bfedd2;">pautar&nbsp;</span><span style="background-color: #bfedd2;">n&atilde;o apenas</span><span style="background-color: #bfedd2;">&nbsp;</span><span style="background-color: #bfedd2;">suas demandas espec&iacute;ficas e latentes, mas ampliar suas reflex&otilde;es e pautas para serem reconhecidos e considerados nos espa&ccedil;os decis&oacute;rios sem que haja imposi&ccedil;&otilde;es antidemocr&aacute;ticas de nenhuma ordem</span>&nbsp;(Ten&oacute;rio, 1998; 2006).&nbsp;</p>


<div id="recursos-azul" class="feat-box-foto">

<p>Como a <strong>gest&atilde;o democr&aacute;tica </strong>&eacute; uma atitude e um processo (e n&atilde;o um produto ou algo pronto), as controv&eacute;rsias, os di&aacute;logos, as discuss&otilde;es, as reuni&otilde;es, as assembleias e os momentos formativos devem ser um h&aacute;bito, colocados como a prioridade maior da institui&ccedil;&atilde;o. N&atilde;o se chega &agrave; excel&ecirc;ncia sem o exerc&iacute;cio constante da virtude, sem muito trabalho, sem o gosto pelo exerc&iacute;cio constante do dissenso e da controv&eacute;rsia. A <strong>pr&aacute;xis democr&aacute;tica</strong> n&atilde;o &eacute; algo autom&aacute;tico. Cotidianamente, haver&aacute; interesses diversos dispostos no tabuleiro, tensionamentos de toda sorte, demandas de todos os tipos e vontades alinhadas com muitas formas diferentes de necessidades, mas quem se disp&otilde;e a gerir esses processos deve primeiro ancorar suas escolhas na legalidade, na transpar&ecirc;ncia e na &eacute;tica. Havendo qualquer desvio nas escolhas ou tomadas de decis&atilde;o, desalinhadas com a isonomia, a impessoalidade e a profissionaliza&ccedil;&atilde;o dos processos e servi&ccedil;os, a gest&atilde;o n&atilde;o ser&aacute; mais autodeterminada, correndo um s&eacute;rio risco de ser ref&eacute;m de suas escolhas. <strong>Gest&atilde;o democr&aacute;tica na EPT</strong> n&atilde;o &eacute; para promover o bem-estar de determinado setor ou deste ou daquele servidor, mas para planejar coletivamente como a entrega de nossa finalidade pode ser cada vez mais aut&ocirc;noma, qualificada, p&uacute;blica, transparente e respeit&aacute;vel.</p>

</div>


<p class="paragrafo">N&atilde;o se trata de negarmos a individualidade como, no ad&aacute;gio autorit&aacute;rio que o pr&oacute;prio Mussolini, fundador e l&iacute;der do fascismo italiano, apregoava: &ldquo;tudo no Estado, nada contra o Estado&rdquo; (Payne, 1996, p. 73). Ou como J. Kennedy, presidente norte-americano, postulava: &ldquo;n&atilde;o pergunte o que seu pa&iacute;s deve fazer por voc&ecirc;, mas o que voc&ecirc; pode fazer pelo seu pa&iacute;s&rdquo; (The American Presidency Project, 1961). Na acep&ccedil;&atilde;o de Mussolini, temos a clara nega&ccedil;&atilde;o dos indiv&iacute;duos em favor do l&iacute;der e do institucional, e a isso chamamos de fascismo. Com rela&ccedil;&atilde;o ao pressuposto de Kennedy, <span style="background-color: #bfedd2;">se negarmos a individualidade em virtude da ideia de na&ccedil;&atilde;o ou de todo, estamos negando o sentido e a possibilidade da democracia.</span></p>


<p class="paragrafo">Dito de outro modo, nas vis&otilde;es totalit&aacute;rias &ndash; sejam de direita ou de esquerda &ndash;, o problema epistemol&oacute;gico chama nossa aten&ccedil;&atilde;o para n&atilde;o reduzir um l&iacute;der a algo meramente pol&iacute;tico; precisamos considerar que ele &eacute;, tamb&eacute;m, a figura expoente de uma corrente de pensamento. Tal ideia pode acarretar a tenta&ccedil;&atilde;o de acharmos que o rei, ou o l&iacute;der, ou o papa etc., &eacute; a representa&ccedil;&atilde;o mais perfeita do exerc&iacute;cio de poder. Entretanto, <strong>pior que um mau gestor &eacute; o endeusamento deste mau gestor como algo necess&aacute;rio e insubstitu&iacute;vel</strong>, como se a realidade n&atilde;o pudesse ser vista por um outro &acirc;ngulo ou de outra forma. N&atilde;o &agrave; toa temos em exerc&iacute;cio de poder, em v&aacute;rias partes do mundo, muitos megaloman&iacute;acos e seus <span class="primary-color"><strong>asseclas</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Pessoas que seguem ou defendem de forma apaixonada uma causa, institui&ccedil;&atilde;o, movimento, partido, entre outros."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>, que tratam o poder n&atilde;o como possibilidade, mas como determina&ccedil;&atilde;o. N&atilde;o de modo dial&eacute;tico, mas como uma experi&ecirc;ncia fara&ocirc;nica em que h&aacute; um processo ou modo de sacraliza&ccedil;&atilde;o daquele que exerce o poder, como se nem humano fosse.&nbsp;</p>


<p class="paragrafo">O poder &eacute; sempre uma possibilidade. Da&iacute; que superamos a vis&atilde;o antiga que vinculava a pessoa do rei ou do papa ao poder, como se fossem a mesma coisa. Hoje, temos elementos suficientes e necess&aacute;rios para pensarmos formas e regimes democr&aacute;ticos que superem a vis&atilde;o dual de que uns nasceram para mandar e outros nasceram para obedecer (Machado, 2023).&nbsp;</p>


<div id="recursos-azul">
<div id="box-refletir">
<div class="box-refletir-blue">
<div class="header-box-refletir">
<p class="caixa-de-destaque-titulo titulo">Para refletir: democracia, diversidade e inclus&atilde;o</p>
</div>
<div class="box-refletir-container">
<p>Considerando o que estudamos at&eacute; agora a respeito da democracia, da inclus&atilde;o e da diversidade, convidamos voc&ecirc; a ler as perguntas abaixo e a refletir a respeito delas, se poss&iacute;vel, relacionando-as ao seu contexto de atua&ccedil;&atilde;o. Essas reflex&otilde;es ajudar&atilde;o voc&ecirc; a construir o seu <strong>Memorial</strong>.</p>
<p>A) Qual &eacute; o papel da representatividade na constru&ccedil;&atilde;o da democracia?&nbsp;<br />B) Quais s&atilde;o as a&ccedil;&otilde;es que podemos promover para evitar os totalitarismos em nossas unidades de ensino?&nbsp;<br />C) Como prevenir que as inst&acirc;ncias democr&aacute;ticas se tornem autorit&aacute;rias?</p>

</div>
</div>
</div>
</div>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina2-2.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="referencias-3.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 11 de 19</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>