<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Democracia e gestão democrática na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul" class="chapter-info">
<div id="content-cover">
<div id="main" class="main">
<div class="container-fluid">
<div class="row"><!-- Marcação de unidade e título -->
<div class="chapter-info col-md-8 offset-md-2">
<h4 class="chapter-label">CAP&Iacute;TULO 4</h4>
<h1 class="chapter-title"><span style="color: #2dc26b;">Incid&ecirc;ncia da Gest&atilde;o Democr&aacute;tica na Produ&ccedil;&atilde;o Documental: O que &eacute;? Como deve ser?</span></h1>
</div>
</div>
<div class="row">
<div class="col-md-12 p-0">
<div class="jumbotron"><!-- Imagem de fundo --> <img src="medias/capa capitulo ge.png" alt="Logotipo" width="100%" /></div>
</div>
</div>
<div class="row">
<div class="col-md-6 offset-md-3"><!-- Legenda da imagem caso precise --></div>
</div>
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto conteúdo -->
<p><!-- Citação curta --></p>

<p class="content paragrafo" style="text-align: right; padding-left: 320px;"><em>E n&oacute;s estamos ainda no processo de aprender como fazer democracia. E a luta por ela passa pela luta contra todo tipo de autoritarismo</em></p>
<p class="content paragrafo" style="text-align: right;"><strong><em>(</em>Freire<em>, A educa&ccedil;&atilde;o na cidade)</em></strong></p>


<p class="content paragrafo">Ao retomarmos o tema da gest&atilde;o democr&aacute;tica em EPT, &eacute; importante ressaltarmos que o objetivo deste cap&iacute;tulo &eacute; refletir sobre a relev&acirc;ncia <span style="background-color: #bfedd2;">&ldquo;dos documentos institucionais serem express&atilde;o da vontade coletiva e orientadores do projeto pol&iacute;tico-pedag&oacute;gico da institui&ccedil;&atilde;o de Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica&rdquo;</span> (Brasil, 2024, p. 49), pois cada decis&atilde;o e cada curso ou a&ccedil;&atilde;o criada pela comunidade escolar precisam estar amparadas num movimento democr&aacute;tico de concep&ccedil;&atilde;o e execu&ccedil;&atilde;o documental. Boas bases te&oacute;ricas, legais e conceituais garantem boas escolhas em momentos de dificuldade, conflitos e dissensos. Quando os documentos institucionais s&atilde;o bem constru&iacute;dos, s&atilde;o eles que ir&atilde;o ser a luz para nortear o caminho e as decis&otilde;es diante de uma situa&ccedil;&atilde;o de d&uacute;vida e dificuldade.&nbsp;</p>


<p><span style="font-weight: 400;">Devemos levar em conta que a gest&atilde;o social precisa ser </span><strong>espa&ccedil;o representativo</strong><span style="font-weight: 400;">, a partir da a&ccedil;&atilde;o dial&oacute;gica e da participa&ccedil;&atilde;o ativa dos sujeitos sociais nos processos decis&oacute;rios&rdquo; (Brasil, 2024, p. 49) e destacar a &ldquo;import&acirc;ncia das inst&acirc;ncias representativas e colegiadas para a constru&ccedil;&atilde;o e consolida&ccedil;&atilde;o do projeto pol&iacute;tico-pedag&oacute;gico&rdquo; (Brasil, 2024, p. 48) como resultado de uma decis&atilde;o ampla e participativa para superar o ensino hegem&ocirc;nico e dual (Gramsci, 2000; 2001; 2002; 2004). Sabemos das demandas espec&iacute;ficas e potentes das emerg&ecirc;ncias do <span style="color: #000000;">mundo de trabalho</span>, mas nossa miss&atilde;o &eacute; dialogar e superar o operacional e espec&iacute;fico e fomentar a&ccedil;&otilde;es e prioridades de ordem estrat&eacute;gica e reflexiva.&nbsp;</span></p>


<p><span style="font-weight: 400;"><span style="background-color: #bfedd2;">Quando os documentos institucionais s&atilde;o constru&iacute;dos de forma dialogada, carregam poder de transforma&ccedil;&atilde;o capaz de suportar os grandes desafios inerentes a qualquer processo formativo.</span> Como numa constitui&ccedil;&atilde;o bem-feita, que, diante de qualquer d&uacute;vida ou demanda individual ou coletiva, pode ser usada como forma de solucionar e dirimir eventuais desentendimentos. Na d&uacute;vida, a lei. Na inquieta&ccedil;&atilde;o, a regra.</span><span style="font-weight: 400;">&nbsp;</span></p>


<p><img class="card-curso-topo-image" src="medias/cotidianoprofissionaisept.jpg" alt="card do curso" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>O cotidiano e os profissionais da EPT<strong><br />Fonte:<span>&nbsp;</span></strong>Gaia Sch&uuml;ler (2023a).</p>

<p><span style="font-weight: 400;">O cotidiano de uma<span style="color: #000000;"> institui&ccedil;&atilde;o de EPT &eacute; perpassad</span>o pela experi&ecirc;ncia de vida de quem faz parte da institui&ccedil;&atilde;o. Qualquer turma de sala de aula ou grupo de servidores p&uacute;blicos carrega em suas rela&ccedil;&otilde;es o espelhamento da sociedade. Neste sentido, os dissensos, as vis&otilde;es diferentes e as expectativas diversas e pluriversais precisam ser e estar alinhadas com o prop&oacute;sito de nossa miss&atilde;o institucional. Por isso, o cuidado na produ&ccedil;&atilde;o documental e a metodologia utilizada em todos os segmentos e fluxos poder&atilde;o dar uma garantia de transpar&ecirc;ncia e tranquilidade na hora da tomada de decis&otilde;es. <span style="background-color: #bfedd2;">Documentos institucionais democraticamente bem constru&iacute;dos s&atilde;o, em grande parte, a garantia de encaminhamentos decis&oacute;rios proativos, cr&iacute;ticos e criativos.</span>&nbsp;</span></p>


<p><span style="font-weight: 400;">Assim, a produ&ccedil;&atilde;o documental e a sua respectiva gest&atilde;o refletem muito o que pensamos e realizamos em nossas institui&ccedil;&otilde;es. Cada curso criado, cada normativa produzida, cada planejamento institucional, todos eles devem ser constru&iacute;dos de <strong>modo participativo</strong> e divulgados de <strong>forma ampla e irrestrita</strong>. Quando um documento n&atilde;o &eacute; produzido coletivamente, com o assentimento e o consentimento coletivo, ele tende a ser muito mais estrat&eacute;gia de controle das pessoas do que um bom encaminhamento dos fluxos necess&aacute;rios para cumprimento da atividade-fim.</span></p>


<p class="paragrafo"><span style="font-weight: 400;">Como estudamos nos cap&iacute;tulo anteriores, n&atilde;o &eacute; incomum que a gest&atilde;o das institui&ccedil;&otilde;es de ensino sejam cooptadas por vis&otilde;es gerencialistas que confundem meios e fins e reduzem a necessidade de investimento em educa&ccedil;&atilde;o. Essas vis&otilde;es partem de uma ideia distorcida de efici&ecirc;ncia e efic&aacute;cia, e tendem a considerar que a </span><span style="font-weight: 400; background-color: #bfedd2;">educa&ccedil;&atilde;o &eacute; produto e despesa &ndash; n&atilde;o um investimento</span><strong> </strong><span style="font-weight: 400;">(Machado, 2024). Partindo da no&ccedil;&atilde;o de trabalho como princ&iacute;pio educativo e da pesquisa como pressuposto pedag&oacute;gico, o crit&eacute;rio de avalia&ccedil;&atilde;o de uma proposta &eacute;tico-pol&iacute;tica dos resultados finais destes processos n&atilde;o pode ser reduzido ao quantitativo e a planilhas com f&oacute;rmulas e uma no&ccedil;&atilde;o de efici&ecirc;ncia e efic&aacute;cia proveniente de processo fabril (Gramsci, 2000; 2001; 2002; 2004). </span></p>


<p class="paragrafo">Mesmo em EPT, h&aacute; muitas plataformas que imprimem certo grau e necessidade de comprova&ccedil;&atilde;o de efici&ecirc;ncia e efic&aacute;cia dos investimentos p&uacute;blicos (<a style="background-color: #ffffff;" rel="noopener" href="https://www.gov.br/mec/pt-br/pnp?gad_source=1&amp;gclid=CjwKCAiAjeW6BhBAEiwAdKltMnwAEDrAVx6EznqMJdBZ_Bgcfyba5zF8Z11mNBG6DzCWIqd60AA27xoC5_kQAvD_BwE" target="_blank">Plataforma Nilo Pe&ccedil;anha</a>, por exemplo). Entretanto, o que esse gerencialismo taylorista n&atilde;o considera &eacute; o valor imensur&aacute;vel da aprendizagem como transforma&ccedil;&atilde;o de si e dos diversos contextos nos diferentes n&iacute;veis e modalidades de ensino.&nbsp;</p>


<p><img class="card-curso-topo-image" src="medias/gestao_responsa_participacao.jpeg" alt="card do curso" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Gest&atilde;o, responsabilidade e participa&ccedil;&atilde;o<strong><br />Fonte:<span>&nbsp;</span></strong>IFF (2023).</p>


<p><span style="font-weight: 400;">Conforme estudamos ao longo desta unidade,</span><span style="font-weight: 400;"> </span><span style="font-weight: 400;">a gest&atilde;o &eacute;, numa primeira acep&ccedil;&atilde;o, a racionaliza&ccedil;&atilde;o dos processos para a efici&ecirc;ncia, mas n&atilde;o apenas dentro da l&oacute;gica taylorista. Efici&ecirc;ncia, neste caso, tem a ver com a garantia de que os direitos fundamentais sejam de fato considerados, respeitados e promovidos. Gest&atilde;o &eacute; muito mais atitude de </span><strong>est&iacute;mulo &agrave; responsabilidade e &agrave; participa&ccedil;&atilde;o </strong><span style="font-weight: 400;">&ndash; e, no caso especial da EPT, de incentivo &agrave; autonomia dos envolvidos &ndash;, do que propriamente o exerc&iacute;cio de processos ou a metodologia de processos. Como bem nos orienta Machado (2024), o processo de redu&ccedil;&atilde;o da educa&ccedil;&atilde;o aos procedimentos das f&aacute;bricas n&atilde;o apenas deixa de atender o prop&oacute;sito de vi&eacute;s qualitativo </span><em><span style="font-weight: 400;">da</span></em><em><span style="font-weight: 400;">&nbsp;</span></em><span style="font-weight: 400;">e </span><em><span style="font-weight: 400;">na</span></em><span style="font-weight: 400;"> </span><span style="font-weight: 400;">educa&ccedil;&atilde;o, mas produz gradativa aliena&ccedil;&atilde;o e estranhamento, visto que temos que responder quest&otilde;es de ordem imensur&aacute;vel com a lupa do positivismo.</span></p>


<p><span style="font-weight: 400;">Cabe lembrar que <span style="background-color: #bfedd2;">a administra&ccedil;&atilde;o cient&iacute;fica &eacute; importante como olhar racional sobre os processos que constitu&iacute;mos, mas, como n&atilde;o somos empresas e n&atilde;o produzimos coisas, nosso entendimento sobre metas, objetivos e finalidades n&atilde;o pode ser reduzido aos moldes fabris.</span> A aliena&ccedil;&atilde;o e o estranhamento se d&atilde;o, em certa medida, pela instrumentaliza&ccedil;&atilde;o de processos que confundem a gest&atilde;o da EPT como se fosse a mesma coisa que gerir uma olaria ou uma f&aacute;brica de sapatos. O gerencialismo, sobretudo presente no fordismo, taylorismo e toyotismo, tem como marca registrada que os processos e os resultados econ&ocirc;micos destes s&atilde;o mais importantes que as pessoas. Nessa l&oacute;gica, o trabalho humano possui a mera finalidade de produzir dividendos aos donos do capital ou de produzir riquezas para a na&ccedil;&atilde;o aos moldes de Adam Smith, isto &eacute;, mesmo que o trabalhador n&atilde;o tenha acesso aos benef&iacute;cios e resultados de seu pr&oacute;prio esfor&ccedil;o.&nbsp;</span></p>


<p class="paragrafo"><span style="font-weight: 400;">Isso posto para destacar que os </span><strong>documentos institucionais</strong>,<span style="font-weight: 400;"> como resultado de um processo de constru&ccedil;&atilde;o, revelam, em suas configura&ccedil;&otilde;es e defini&ccedil;&otilde;es escritas, o grau de democracia na gest&atilde;o. Na sequ&ecirc;ncia, iremos examinar alguns aspectos que devem ser pressupostos na elabora&ccedil;&atilde;o documental, considerando que, ainda que a <span style="color: #000000;">gest&atilde;o em exerc&iacute;cio tenha certas prerrogativas no campus legislador dos regramentos, em geral, as unidades da Rede Federal, por exemplo, n&atilde;o podem legislar sobre aquilo que j&aacute; est&aacute; estabelecido. Ao contr&aacute;rio, sua fun&ccedil;&atilde;o &eacute; aplicar os regramentos provenientes da Uni&atilde;o via respectivos minist&eacute;rios.</span> Esse &eacute; um ponto de partida importante: </span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">a elabora&ccedil;&atilde;o de documentos, quer seja de regramento funcional dos servidores, quer de diretrizes de cursos precisa estar alinhada ao ditame legal e ao regramento disposto para tal.</span></span></p>


<p class="paragrafo">Outro aspecto &eacute; que a elabora&ccedil;&atilde;o dos documentos institucionais n&atilde;o pode se desviar de sua finalidade, ou<span style="color: #000000;"> seja, do sentido e papel da atividade-fim. Embora uma gest&atilde;o de unidade ou de reitoria possua grande for&ccedil;a para estabelecer o modo e a dire&ccedil;&atilde;o das propostas documentais, &eacute;</span> a <strong>representatividade das categorias e servi&ccedil;os</strong> que ser&aacute; a moderadora para que os documentos cumpram efetivamente o seu papel institucional e n&atilde;o sejam apenas a express&atilde;o da vontade da equipe de gest&atilde;o em exerc&iacute;cio.</p>


<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="referencias-3.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina-14.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 13 de 19</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>