<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Democracia e gestão democrática na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Uma Perspectiva sobre a Rede Federal, PROEJA e EJA/EPT</strong></p>


<p><span style="font-weight: 400;">Basta um olhar mais atento nos acervos de Projetos Pedag&oacute;gicos de Curso (PPCs) das unidades da Rede Federal para notar a predomin&acirc;ncia do</span><strong><span class="modal-button button" data-toggle="modal" data-target="#modal-1"> positivismo e do cartesianismo, com fortes influ&ecirc;ncias do empirismo</span><span style="font-size: 12pt;">,</span> </strong><span style="font-weight: 400;">como resultado da vers&atilde;o final de um PPC, bem como proposi&ccedil;&otilde;es contra-hegem&ocirc;nicas muito t&iacute;midas ou inexistentes.&nbsp;</span></p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo"></h5>
</div>
<div class="modal-body nota">
<p style="color: black;">Do positivismo, lema presente em nossa bandeira nacional, vem a convic&ccedil;&atilde;o de que os componentes curriculares de ci&ecirc;ncias da natureza e exatas s&atilde;o mais importantes e necess&aacute;rios que os demais; nota-se isso tanto nas ementas como na distribui&ccedil;&atilde;o da carga hor&aacute;ria escolar.</p>
&nbsp;
<p style="color: black;">Do cartesianismo, tem-se a clara desconex&atilde;o entre os saberes b&aacute;sicos e t&eacute;cnicos e a cultura, a ci&ecirc;ncia e a tecnologia, o universo do trabalho e principalmente a realidade vivida pelos discentes.</p>
&nbsp;
<p style="color: black;">Do empirismo, surge a &ecirc;nfase em situa&ccedil;&otilde;es do cotidiano e de saberes que precisam estar em di&aacute;logo com saberes cient&iacute;ficos e formais. Todas essas correntes de pensamento podem ser enfrentadas &agrave; luz da dialogicidade entre os saberes, com planejamento organizado pelos docentes que ir&atilde;o atuar nos cursos visando sempre a inter e a transdisciplinaridade.</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p><span style="font-weight: 400;">N&atilde;o raro temo<span style="color: #000000;">s na Rede Federal, por exemplo, c</span>ursos com baix&iacute;ssima demanda, com altos &iacute;ndices de evas&atilde;o e reten&ccedil;&atilde;o ou que acabam fechando logo que iniciam. De certo modo, isso expressa as falhas de planejamento, o estudo de demandas deficit&aacute;rias e o n&atilde;o reconhecimento de quest&otilde;es antropol&oacute;gicas j&aacute; citadas aqui (como o &ecirc;xodo rural, a aus&ecirc;ncia de sucess&atilde;o rural, a urbaniza&ccedil;&atilde;o do ensino etc). Falta, ainda, </span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">uma leitura mais acurada sobre a realidade, o entorno da institui&ccedil;&atilde;o e o sentido e o papel da gest&atilde;o democr&aacute;tica na operacionaliza&ccedil;&atilde;o de decis&otilde;es mais democr&aacute;ticas e menos movidas pelo senso comum.</span></span></p>


<p class="paragrafo"><span style="font-weight: 400;">Assim, a gest&atilde;o democr&aacute;tica precisa estar presente em <strong>dois movimentos importantes</strong>:</span></p>


<ol style="list-style-type: lower-alpha;">
<li class="paragrafo"><span style="font-weight: 400;">Assegurar que a motiva&ccedil;&atilde;o por tr&aacute;s da escolha por um determinado curso, em qualquer uma de nossas unidades, seja a express&atilde;o do interesse efetivo da comunidade em geral e que n&atilde;o se trate de uma decis&atilde;o monocr&aacute;tica, quer seja de um grupo de gest&atilde;o ou de professores que queira um curso para chamar de seu.</span></li>
<li class="paragrafo"><span style="font-weight: 400;">Assegurar que, ap&oacute;s uma decis&atilde;o coletiva pela abertura de um determinado curso, amparada em estudos s&oacute;lidos sobre as necessidades reais daquele contexto, os documentos basilares de implementa&ccedil;&atilde;o e consolida&ccedil;&atilde;o sejam democraticamente a demarca&ccedil;&atilde;o de uma constru&ccedil;&atilde;o e reflex&atilde;o coletiva.</span></li>
</ol>


<p><span style="font-weight: 400;">Eles devem obedecer a um rigoroso planejamento coletivo que envolva todos os atores do processo, com constru&ccedil;&atilde;o e revis&atilde;o documental cont&iacute;nua. Sem esse movimento, o gerencialismo alienante e alienador pode determinar as decis&otilde;es, sejam elas simples ou complexas, e isso, numa organiza&ccedil;&atilde;o de Ensino em Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (EPT), acaba por inviabilizar a constru&ccedil;&atilde;o de uma perspectiva </span><strong>&eacute;tico-pol&iacute;tica da educa&ccedil;&atilde;o omnilateral</strong>.<strong> </strong><span style="font-weight: 400;">Sem isso, o curr&iacute;culo integrado, por exemplo, torna-se uma express&atilde;o meramente burocr&aacute;tica e alheia &agrave; sua finalidade e raz&atilde;o de ser, cen&aacute;rio em que os meios passam a ser fins, e os fins acabam sendo negligenciados.</span></p>


<p><img class="card-curso-topo-image" src="medias/DE.4_ILU_3.png" alt="A Gest&atilde;o Democr&aacute;tica na cria&ccedil;&atilde;o de um curso" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><span><strong>T&iacute;tulo:</strong> A Gest&atilde;o Democr&aacute;tica na cria&ccedil;&atilde;o de um curso</span><br /><span><strong>Fonte: </strong>Prosa (2025c).</span></p>


<p class="paragrafo"><span style="font-weight: 400;">Basta um olhar atento ao <strong>Programa Nacional de Integra&ccedil;&atilde;o da Educa&ccedil;&atilde;o Profissional com a Educa&ccedil;&atilde;o B&aacute;sica na Modalidade de Educa&ccedil;&atilde;o de Jovens e Adultos</strong> (PROEJA), tomado aqui como exemplo, no qual verificamos que o cuidado e o investimento com a Educa&ccedil;&atilde;o de Jovens e Adultos n&atilde;o deve ser uma decis&atilde;o compuls&oacute;ria pela lei da cria&ccedil;&atilde;o dos Institutos Federais. Reduzir a Educa&ccedil;&atilde;o de Jovens e Adultos (EJA/EPT) &agrave; mera determina&ccedil;&atilde;o legal &ndash; algo que temos que oferecer porque a lei exige os dez por cento de matr&iacute;culas &ndash; </span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">&eacute; negligenciar a possibilidade de inclus&atilde;o e oportunidade a pessoas que, por diversas raz&otilde;es, n&atilde;o tiveram condi&ccedil;&otilde;es de estudar na idade certa.</span>&nbsp;</span></p>


<p><span style="font-weight: 400;">A EJA/EPT deve ser tratada para al&eacute;m da obriga&ccedil;&atilde;o legal e tornar-se uma convic&ccedil;&atilde;o e uma pauta priorit&aacute;ria, considerando a sua natureza inclusiva e de promo&ccedil;&atilde;o da cidadania pelo acesso ao conhecimento. Diante disso, precisamos buscar, </span>democraticamente,<span style="font-weight: 400;"> uma outra fase: de consolida&ccedil;&atilde;o da pol&iacute;tica p&uacute;blica. Nosso compromisso &eacute; transformar, com nossas decis&otilde;es e a&ccedil;&otilde;es, o Programa de Educa&ccedil;&atilde;o de Jovens e Adultos numa a&ccedil;&atilde;o efetiva do governo do Estado brasileiro, a fim de superarmos o estigma do legalismo e construirmos novas perspectivas e oportunidades para aqueles e aquelas que mais precisam. Nesse segmento, &eacute; importante acentuar a necessidade de que os cursos e suas diretrizes sejam organizados de acordo com </span><strong style="font-size: 1em;">a demanda desse p&uacute;blico particular</strong><span style="font-size: 1em;">,</span><span style="font-weight: 400;">&nbsp;e n&atilde;o de acordo com as </span><strong style="font-size: 1em;">convic&ccedil;&otilde;es de quem escolhe o curso</strong><span style="font-weight: 400;">. A metodologia, a organiza&ccedil;&atilde;o administrativa e pedag&oacute;gica, o vi&eacute;s &eacute;tico-pol&iacute;tico e as motiva&ccedil;&otilde;es de um curso devem atender &agrave;s reais necessidades das pessoas e do contexto em que est&atilde;o inseridas, em vez de se limitarem a cumprir apenas os requisitos m&iacute;nimos estabelecidos pela lei de cria&ccedil;&atilde;o da Rede Federal.</span></p>


<p class="paragrafo"><span style="font-weight: 400;">Da mesma forma, outros temas como a verticaliza&ccedil;&atilde;o e a escolha por eixos tecnol&oacute;gicos e por cursos de gradua&ccedil;&atilde;o, sejam tecn&oacute;logos, bacharelados ou licenciaturas, precisam ser pensados e institu&iacute;dos para atender as demandas da <strong>sociedade</strong>, do <strong>contexto local</strong> e <strong>regional</strong>.</span></p>


<div id="recursos-azul" class="feat-box-foto">
<p><span style="font-size: 1em;">&Eacute; fundamental que cada curso, independentemente do n&iacute;vel ou modalidade, seja estrat&eacute;gia de forma&ccedil;&atilde;o omnilateral e n&atilde;o dual, ensino integral e n&atilde;o forma&ccedil;&atilde;o rasa, forma&ccedil;&atilde;o dial&eacute;tica e n&atilde;o para operar a dial&eacute;tica. Que seja um movimento intelectual de constitui&ccedil;&atilde;o do trabalho como princ&iacute;pio educativo e da pesquisa como pressuposto pedag&oacute;gico (Gramsci, 2000; 2001; 2002; 2004).</span></p>

</div>


<p class="paragrafo"><span style="font-weight: 400;">O modo mais seguro para que a gest&atilde;o em EPT seja democr&aacute;tica e cumpra efetivamente o seu papel, considerando a sua finalidade, se d&aacute; atrav&eacute;s da </span><span style="font-weight: 400; background-color: #bfedd2;">produ&ccedil;&atilde;o de documentos institucionais em di&aacute;logo com todas as inst&acirc;ncias e segmentos</span><span style="font-weight: 400;">, para que o resultado desse movimento seja a </span><span style="font-weight: 400;"><strong>express&atilde;o de todos</strong>,</span><strong>&nbsp;</strong><span style="font-weight: 400;">mesmo no caso do dissenso, da controv&eacute;rsia e do tensionamento ret&oacute;rico. </span></p>


<p><span style="font-weight: 400;">A riqueza acad&ecirc;mica de uma institui&ccedil;&atilde;o democr&aacute;tica, verdadeiramente falando, n&atilde;o &eacute; um consenso a priori ou um alinhamento monocr&aacute;tico, algo denominado por muitos como </span><em><span style="font-weight: 400;">articula&ccedil;&atilde;o pol&iacute;tica</span></em><span style="font-weight: 400;">,</span><strong>&nbsp;</strong><span style="font-weight: 400;">que imp&otilde;e, sob esse pretexto, a vontade de um ou de um grupo sobre as demais vontades. Isso n&atilde;o &eacute; articula&ccedil;&atilde;o</span><em><span style="font-weight: 400;"> </span></em><span style="font-weight: 400;">e sequer pode ser denominada pol&iacute;tica: </span><span style="background-color: #bfedd2;">trata-se de um autoritarismo totalit&aacute;rio disfar&ccedil;ado de decis&atilde;o democr&aacute;tica.</span><span style="font-weight: 400;">&nbsp;Muitos acordos esp&uacute;rios, e mesmo a corrup&ccedil;&atilde;o ativa e passiva, decorrem desta vis&atilde;o distorcida de que as institui&ccedil;&otilde;es precisam ser espa&ccedil;o de governo de imposi&ccedil;&atilde;o de vontades, n&atilde;o alinhadas ao prop&oacute;sito do bem comum. Nesses casos, quem est&aacute; em inst&acirc;ncia decis&oacute;ria imp&otilde;e aos demais os seus devaneios, convic&ccedil;&otilde;es, contradi&ccedil;&otilde;es e oligarquismo sob a &eacute;gide e a batuta da famigerada e abomin&aacute;vel </span><em><span style="font-weight: 400;">&ldquo;</span></em><span style="font-weight: 400;">articula&ccedil;&atilde;o pol&iacute;tica</span><em><span style="font-weight: 400;">&rdquo;</span></em><span style="font-weight: 400;">&nbsp;(Gramsci, 2000; 2001; 2002;2004)</span><em><span style="font-weight: 400;">.</span></em><span style="font-weight: 400;">&nbsp;</span></p>


<div id="recursos-azul" class="feat-box-foto">
<p><span style="font-size: 1em;">A <strong>produ&ccedil;&atilde;o documental de uma institui&ccedil;&atilde;o de EPT</strong> n&atilde;o deve ser apenas a express&atilde;o da maioria, mas a contempla&ccedil;&atilde;o de um melhor arranjo, fruto de todos os dissensos, contrapontos, reflex&otilde;es e an&aacute;lises. O que de fato importa n&atilde;o &eacute; a apresenta&ccedil;&atilde;o de um texto belo, coeso, l&oacute;gico e coerente &ndash; porque isso &eacute; prerrogativa da exig&ecirc;ncia formal. O documento institucional deve estampar o </span><em style="font-size: 1em;">dialogomai,</em><span style="font-size: 1em;">&nbsp;isto &eacute;, o encontro proativo das muitas falas e contextos com um &uacute;nico pretexto: apresentar as muitas intencionalidades em uma s&oacute;. Como defendia Arist&oacute;teles em <em>Ret&oacute;rica</em> (2019), a lei &eacute; o olhar de muitos olhos, &eacute; a racionalidade advinda de muitas raz&otilde;es.</span></p>

</div>


<p><span style="font-weight: 400;">Nessa l&oacute;gica, a garantia de que um documento institucional seja efetivamente democr&aacute;tico n&atilde;o reside apenas na sua metodologia de produ&ccedil;&atilde;o.</span><strong>&nbsp;</strong><span style="font-weight: 400;"><span style="background-color: #bfedd2;">Todas as categorias, sejam docentes, t&eacute;cnicos administrativos, estudantes ou segmentos institucionais, devem se sentir ali representadas</span>,</span><span style="font-weight: 400;">&nbsp;n&atilde;o apenas como uma parede composta por muitas t&aacute;buas ou tijolos, e sim como o am&aacute;lgama ou o ponto de converg&ecirc;ncia que une tudo. Deve-se representar todos na express&atilde;o de uma inten&ccedil;&atilde;o coletiva, de uma realidade bem refletida e de decis&otilde;es exaustivamente bem dialogadas.&nbsp;</span></p>


<p><span style="font-weight: 400;">Se ampliarmos a lente com um olhar mais cr&iacute;tico sobre os documentos institucionais como um todo, precisamos partir da premissa de que eles precisam e devem ser resultados acurados de um trabalho exaustivo, coletivo, cr&iacute;tico e criativo (Morin, 1990; 2000; 2004; 2014). Sabemos que muitas vezes quem est&aacute; na gest&atilde;o pode impingir certa influ&ecirc;ncia ou tend&ecirc;ncia nas diretrizes documentais, mas essa inger&ecirc;ncia, </span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">se n&atilde;o for democr&aacute;tica, pode ser altamente nefasta para a institui&ccedil;&atilde;o como um todo.</span></span><span style="font-weight: 400;"> Isso porque, nos escritos, nas resolu&ccedil;&otilde;es, nas portarias, nas normas e orienta&ccedil;&otilde;es, a identidade documental de uma unidade da Rede Federal deve zelar pelo sentido mais acurado da atividade-fim desta institui&ccedil;&atilde;o, e n&atilde;o apenas ser uma express&atilde;o de quem ocupa naquele instante a gest&atilde;o. Veja no infogr&aacute;fico a seguir as categorias a serem representadas na cria&ccedil;&atilde;o de um documento institucional:</span></p>


<p><img class="card-curso-topo-image" src="medias/DE.4_INF_4 (1).png" alt="Categorias a serem representadas na cria&ccedil;&atilde;o de um documento institucional" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><span><strong>T&iacute;tulo:</strong> Categorias a serem representadas na cria&ccedil;&atilde;o de um documento institucional</span><br /><span><strong>Fonte: </strong>Prosa (2025d).</span></p>


<p><span style="font-weight: 400;">Se constru&iacute;mos, por exemplo, um PPC de curso como se fosse uma colcha de retalhos, tendo como premissa o movimento cartesiano de cis&atilde;o entre a realidade e o conhecimento, separando os saberes, deixando-os desconexos e sem um di&aacute;logo m&iacute;nimo entre os componentes curriculares, mesmo que seja por &aacute;rea do conhecimento, a chance de cumprirmos a miss&atilde;o </span><em><span style="font-weight: 400;">do</span></em><span style="font-weight: 400;">&nbsp;e </span><em><span style="font-weight: 400;">no</span></em><span style="font-weight: 400;"> curr&iacute;culo integrado &eacute; pouco prov&aacute;vel. Para que possamos efetivamente exercer o nosso papel humano e social, enquanto<span style="color: #000000;"> EPT, </span>necessitamos de um pensamento com uma cabe&ccedil;a bem-feita (Morin, 1990; 2000; 2004; 2014), que prime pela vis&atilde;o&nbsp;</span><em><span style="font-weight: 400;">inter, multi</span></em><span style="font-weight: 400;"> e</span><em><span style="font-weight: 400;"> transdisciplinar</span></em><span style="font-weight: 400;">, engendrando a operacionaliza&ccedil;&atilde;o entre a teoria e a pr&aacute;xis e visando a </span><strong>forma&ccedil;&atilde;o omnilateral e polit&eacute;cnica</strong>.<strong>&nbsp;</strong></p>


<p><span style="font-weight: 400;">Um exemplo que pode ilustrar essa problematiza&ccedil;&atilde;o &eacute; que um Instituto Federal, levando em conta a organiza&ccedil;&atilde;o da gest&atilde;o central (Reitoria e Pr&oacute;-Reitorias) e a gest&atilde;o das unidades ou campi (Diretores Gerais) que ir&atilde;o compor o Col&eacute;gio de Dirigentes (CODIR) possuem um papel preponderante na miss&atilde;o de expandir a democratiza&ccedil;&atilde;o das decis&otilde;es que beneficiam a institui&ccedil;&atilde;o como um todo. Como j&aacute; mencionado nos cap&iacute;tulos anteriores, esses espa&ccedil;os n&atilde;o podem se transformar em um ambiente estrat&eacute;gico de imposi&ccedil;&atilde;o das pautas, urg&ecirc;ncias e decis&otilde;es da gest&atilde;o central, tampouco podem ser mecanismos de poder das unidades para determinar as prioridades da institui&ccedil;&atilde;o como um todo. Ambos os cargos aqui citados, no caso do CODIR, devem estar a servi&ccedil;o do interesse maior da institui&ccedil;&atilde;o, isto &eacute;, da </span><span style="font-weight: 400; background-color: #bfedd2;">promo&ccedil;&atilde;o da EPT e da forma&ccedil;&atilde;o omnilateral, considerando o trabalho como princ&iacute;pio educativo e a pesquisa como pressuposto pedag&oacute;gico</span><span style="font-weight: 400;"> (Gramsci, 2000; 2001; 2002; 2004).&nbsp;</span></p>


<p class="paragrafo"><span style="font-weight: 400;">Assim, o Conselho Superior (CONSUP) n&atilde;o &eacute; e nem deve ser pensado como espa&ccedil;o para estabelecer as convic&ccedil;&otilde;es pol&iacute;ticas e prioridades de um reitor ou grupo gestor. Ele &eacute; o espa&ccedil;o de </span><strong>fiscaliza&ccedil;&atilde;o e de reafirma&ccedil;&atilde;o das garantias democr&aacute;ticas</strong>,<span style="font-weight: 400;"> visto que nele est&atilde;o representadas todas as categorias de uma Institui&ccedil;&atilde;o, sem perder de vista a atividade-fim. Embora parte dos membros sejam os mesmos do Col&eacute;gio de Dirigentes (reitores, pr&oacute;-reitores e diretores gerais), o CONSUP n&atilde;o pode ser a extens&atilde;o do CODIR, isso porque, sendo deliberativo, esse conselho precisa considerar as demandas reais e latentes da institui&ccedil;&atilde;o como um todo, n&atilde;o apenas do grupo que faz a gest&atilde;o institucional, para que os documentos e normativas institucionais possam atender as demandas reais, sobretudo as que versam sobre o acesso, a perman&ecirc;ncia e o &ecirc;xito dos discentes. </span></p>


<p class="paragrafo"><span style="font-weight: 400;">O CONSUP n&atilde;o pode ser mero resultado decis&oacute;rio do CODIR, do espelhamento das decis&otilde;es tomadas neste &acirc;mbito. Por ser deliberativo, o CONSUP tem o dever de produzir decis&otilde;es e documentos que contemplem a representatividade de todas as categorias e o interesse maior da institui&ccedil;&atilde;o como um todo.</span></p>


<p><span style="font-weight: 400;">Pode ocorrer, em muitas unidades da Rede Federal, um desvio de finalidade da gest&atilde;o como projeto de poder e n&atilde;o como estrat&eacute;gia de projeto institucional para que a EPT efetivamente cumpra o seu papel. Lembrando que para Hannah Arendt (2005) </span><span style="font-weight: 400; background-color: #bfedd2;">a democracia s&oacute; se fortalece e d&aacute; frutos quando ocupamos os espa&ccedil;os p&uacute;blicos e pol&iacute;ticos, com o intuito de fortalecer as decis&otilde;es que se afastam do totalitarismo e da satisfa&ccedil;&atilde;o do interesse imediato de quem est&aacute; no poder</span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">.</span><strong>&nbsp;</strong>Para Arendt (2005), &eacute; o descuido com a a&ccedil;&atilde;o, com a vida p&uacute;blica, com o exerc&iacute;cio educativo da pol&iacute;tica e com a dimens&atilde;o pedag&oacute;gica do agir humano que aos poucos ocorre a aliena&ccedil;&atilde;o, o descaso e o desvio de finalidade por parte de quem exerce o poder (Machado, 2023).&nbsp;</span></p>


<p><span style="font-weight: 400;">As tenta&ccedil;&otilde;es de que o CONSUP seja o espelhamento do CODIR em termos decis&oacute;rios de que as decis&otilde;es institucionais sejam a express&atilde;o da vontade de quem est&aacute; em cargos decis&oacute;rios e n&atilde;o das reais demandas da comunidade acad&ecirc;mica, precisam e podem ser superadas quando h&aacute; forma&ccedil;&atilde;o para o </span><strong>livre exerc&iacute;cio da cidadania </strong><span style="font-weight: 400;">(Nussbaum, 2010). Diferentemente da vis&atilde;o tecnicista, que apresenta as compet&ecirc;ncias e habilidades na forma&ccedil;&atilde;o t&eacute;cnica de maneira alienante com a instrumentaliza&ccedil;&atilde;o das pessoas para um determinado fim, as compet&ecirc;ncias e habilidades que precisamos aprender para fortalecer a democracia est&atilde;o no campo discursivo, dialogal e formativo, cultivadas a partir de uma vis&atilde;o cr&iacute;tica e criativa contra-hegem&ocirc;nica (Gramsci, 2000; 2001; 2002; 2004).&nbsp;</span></p>


<div id="recursos-azul">
<div id="box-refletir">
<div class="box-refletir-blue">
<div class="header-box-refletir">
<p class="caixa-de-destaque-titulo titulo">Para refletir: modelo pr&oacute;prio de gest&atilde;o para a EPT</p>
</div>
<div class="box-refletir-container">
<p><span style="font-weight: 400;">O <strong>gerencialismo</strong> n&atilde;o raro &eacute; alienante e alienado, por isso, &eacute; crucial desenvolver&nbsp;</span>um modelo pr&oacute;prio de gest&atilde;o <span style="font-weight: 400;">para a EPT. Isso exige investimento em leitura, forma&ccedil;&atilde;o,</span><span style="font-weight: 400;">&nbsp;capacita&ccedil;&atilde;o epistemol&oacute;gica, forma&ccedil;&atilde;o</span><span style="font-weight: 400;"> </span><span style="font-weight: 400;">pedag&oacute;gica, reflex&atilde;o e revis&atilde;o metodol&oacute;gica, conduta &eacute;tica e, em suma, forma&ccedil;&atilde;o pol&iacute;tica. Tudo para que as decis&otilde;es institucionais expressem e registrem, nos documentos que ir&atilde;o balizar as decis&otilde;es e as a&ccedil;&otilde;es, a express&atilde;o da vontade democr&aacute;tica, e n&atilde;o um produto do gerencialismo alienado (Machado, 2023).</span></p>

<p>Convidamos voc&ecirc; para refletir sobre o conte&uacute;do aplicado &agrave; sua realidade, portanto, ao ler e responder as quest&otilde;es, tenha como ponto de partida a <strong>institui&ccedil;&atilde;o na qual voc&ecirc; atua</strong>:&nbsp;</p>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Como <strong>superar o gerencialismo</strong> administrativo em nossa<span style="color: #000000;">s institui&ccedil;&otilde;es de EPT?</span></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Quais estrat&eacute;gias podemos adotar para que a <strong>abertura de novos cursos</strong> atenda &agrave; sua finalidade e n&atilde;o tenhamos tantas situa&ccedil;&otilde;es de cursos com baixa ou inexistente procura?</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Que medidas podemos e devemos aderir para <strong>democratizar</strong> tanto as nossas decis&otilde;es institucionais como a nossa produ&ccedil;&atilde;o e gest&atilde;o documental?</span></li>
</ul>

</div>
</div>
</div>
</div>
<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina-14.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="referencias-4.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 15 de 19</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>