<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Democracia e gestão democrática na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Gest&atilde;o na EPT como estrat&eacute;gia de supera&ccedil;&atilde;o da doutrina&ccedil;&atilde;o</strong></p>

<p>Conforme vimos, ao abordarmos a gest&atilde;o democr&aacute;tica na EPT, &eacute; essencial reconhecer que a democracia &eacute; fruto de uma constru&ccedil;&atilde;o coletiva, n&atilde;o uma concess&atilde;o feita a algu&eacute;m. Ou seja, <span style="background-color: #bfedd2;">o que realmente pode garantir a democracia e a democratiza&ccedil;&atilde;o &eacute; a colegialidade.</span><strong> </strong>Por exemplo, na inst&acirc;ncia de um curso, est&atilde;o a&iacute; representados os docentes, discentes e demais servidores que d&atilde;o suporte e condi&ccedil;&otilde;es para que de fato flua a forma&ccedil;&atilde;o omnilateral. No entanto, as decis&otilde;es tomadas e estrat&eacute;gias de gest&atilde;o <em>do</em> e <em>no</em> pr&oacute;prio curso devem considerar o interesse de todos os atores envolvidos. A gest&atilde;o de uma unidade e a coordena&ccedil;&atilde;o de um curso s&atilde;o mediadores da realiza&ccedil;&atilde;o da gest&atilde;o democr&aacute;tica, mas n&atilde;o podem ser inst&acirc;ncias decis&oacute;rias isoladas. Uma forma&ccedil;&atilde;o, independentemente de seu n&iacute;vel ou modalidade, n&atilde;o pode ser um curso do campus, da coordena&ccedil;&atilde;o ou do colegiado, mas deve ser a express&atilde;o m&aacute;xima da colegialidade em torno dela. A gest&atilde;o, se democr&aacute;tica, deve evitar que um curso seja para a coordena&ccedil;&atilde;o ou grupo de professores chamar de &ldquo;seu&rdquo;.&nbsp;</p>


<p class="paragrafo">De modo similar, a reuni&atilde;o dos cursos ou das coordena&ccedil;&otilde;es de cursos, frequentemente denominada NPI (N&uacute;cleo Pedag&oacute;gico Integrado), tem como objetivo <strong>pensar a Unidade de Ensino como um todo</strong>, conciliando a unidade e a diferen&ccedil;a, sem exigir uma unicidade r&iacute;gida. Na colegialidade dos cursos ofertados em um determinado campus, por exemplo, deve haver espa&ccedil;os e situa&ccedil;&otilde;es formativas em que os diferentes cursos se encontrem para refletir sobre suas demandas de ordem te&oacute;rica e pr&aacute;tica. S&atilde;o momentos e movimentos como esses que garantem um olhar para o que est&aacute; sendo feito, de modo a produzir reavalia&ccedil;&otilde;es, retomadas de aspectos te&oacute;ricos, avalia&ccedil;&atilde;o das a&ccedil;&otilde;es etc.&nbsp;</p>


<p><img class="card-curso-topo-image" src="medias/53297730631_56b4d95f10_k.jpg" alt="card do curso" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>A colegialidade na Gest&atilde;o da EPT<strong><br />Fonte: </strong>Gaia Sch&uuml;ler (2023b).</p>


<p class="paragrafo">Ainda, os Colegiados de Campus, os Conselhos Superiores (CONSUP), Col&eacute;gio de Dirigentes, entre outros, precisam constantemente retomar as bases conceituais e legais do seu <em>ser </em>e <em>fazer </em>para estimular a amplia&ccedil;&atilde;o dos espa&ccedil;os democr&aacute;ticos. <span style="background-color: #bfedd2;">Isso &eacute; fundamental para prevenir o risco de que uma gest&atilde;o de unidade ou mesmo de reitoria aproprie-se das inst&acirc;ncias de decis&otilde;es leg&iacute;timas para impor suas convic&ccedil;&otilde;es.</span></p>


<p class="paragrafo">Como um exemplo, o Conselho de Dirigentes (CODIR) &eacute; uma inst&acirc;ncia consultiva, enquanto o CONSUP &eacute; uma inst&acirc;ncia deliberativa. As reuni&otilde;es da primeira possuem um car&aacute;ter mais pol&iacute;tico, portanto, de acordos e proposi&ccedil;&otilde;es diplom&aacute;ticas, enquanto na segunda inst&acirc;ncia temos o normativo, a constru&ccedil;&atilde;o dos regramentos que ir&atilde;o balizar as a&ccedil;&otilde;es institucionais. Isso significa que, se algo j&aacute; vem pronto ou previamente estabelecido do CODIR para o CONSUP, o pr&oacute;prio CONSUP n&atilde;o tem raz&atilde;o de ser. &nbsp;</p>


<p class="paragrafo">Quando n&atilde;o refletimos sobre essas diferen&ccedil;as e atribui&ccedil;&otilde;es, o CODIR pode ser cooptado para servir como um mero ensaio para o que ser&aacute; apresentado no CONSUP, e os colegiados de unidades apenas espa&ccedil;os para assinar as atas do que j&aacute; foi a priori decidido. Entretanto, <span style="background-color: #bfedd2;">a gest&atilde;o democr&aacute;tica em EPT exige um olhar atento para as representatividades, a fim de que n&atilde;o se caia num gerencialismo pan&oacute;ptico que controla e cerceia, vigia e pune, divide e oprime.</span><strong> </strong>Dito de outro modo, as inst&acirc;ncias deliberativas precisam ser fomentadas e devidamente instru&iacute;das, da mesma forma que as inst&acirc;ncias consultivas, para que n&atilde;o haja fus&atilde;o ou confus&atilde;o entre cada espa&ccedil;o de constru&ccedil;&atilde;o das decis&otilde;es.&nbsp;</p>


<p class="paragrafo"><span style="font-weight: 400;">A forma como a institui&ccedil;&atilde;o organiza os seus tr&acirc;mites tamb&eacute;m educa e forma para a cidadania. Estamos diante de um contexto no qual precisamos compreender que a nossa pr&aacute;xis tamb&eacute;m diz sobre o que acreditamos, sobre o que fazemos e o que pensamos. Nossos discentes aos poucos s&atilde;o iniciados muito mais pelo que fazemos como pr&aacute;xis da democracia do que propriamente pelo que dizemos ou almejamos fazer. Por isso, <strong>Gest&atilde;o Democr&aacute;tica em EPT</strong> n&atilde;o tem rela&ccedil;&atilde;o com quem ir&aacute; permanecer ou n&atilde;o no poder, como sugeriu Maquiavel em</span><em><span style="font-weight: 400;"> </span></em><em><span style="font-weight: 400;">O Pr&iacute;ncipe,</span></em><span style="font-weight: 400;"> mas com a </span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">radicalidade de nosso compromisso com as bases conceituais e legais que nos criaram.</span></span></p>


<p class="paragrafo">Essa radicalidade, j&aacute; sugerida por V&iacute;tor Paro (2010), precisa ser parametrizada no grau de autonomia, do bom governo de si que cada estudante vai obtendo ao passar pelos processos de ensino e aprendizagem, pelos nossos processos decis&oacute;rios e isso n&atilde;o pode ser quantificado. Portanto a gest&atilde;o democr&aacute;tica em EPT precisa considerar os seguintes pressupostos: <strong>trabalho</strong> <strong>como</strong> <strong>princ&iacute;pio educativo</strong>, <strong>pesquisa como pressuposto pedag&oacute;gico</strong>, a <strong>forma&ccedil;&atilde;o omnilateral</strong>, a <strong>politecnia</strong> etc.</p>


<p class="paragrafo">Dito de outra forma, a r&eacute;gua que deve medir nosso fazer e justificar nossa identidade como<span class="primary-color"><strong>&nbsp;autarquia federal </strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="&Eacute; uma entidade aut&ocirc;noma e descentralizada, criada por lei, com personalidade jur&iacute;dica pr&oacute;pria, patrim&ocirc;nio e receita, que executa atividades t&iacute;picas da Administra&ccedil;&atilde;o P&uacute;blica."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;&eacute; a capacidade potencial de superarmos a doutrina&ccedil;&atilde;o de toda sorte e de tornarmos as novas gera&ccedil;&otilde;es <strong>mais livres, mais justas, mais humanas e mais democr&aacute;ticas</strong>,<strong> </strong>inclusive em rela&ccedil;&atilde;o ao mundo do trabalho. Para Fernando Ten&oacute;rio (1998), que se apoia em <span class="modal-button button" data-toggle="modal" data-target="#modal-1">J&uuml;rgen Habermas,</span> o fim da educa&ccedil;&atilde;o &eacute; a potencializa&ccedil;&atilde;o da a&ccedil;&atilde;o cidad&atilde; e da raz&atilde;o comunicativa, subvertendo a centralidade humana do trabalho como fim da exist&ecirc;ncia humana pela centralidade da comunica&ccedil;&atilde;o como potencialidade da linguagem em nos humanizar. De modo similar, Arendt (2005) e Nussbaum (2015) sugerem que o verdadeiro papel da educa&ccedil;&atilde;o escolar, formalmente falando, &eacute; antes de tudo formar para a democracia e para a preven&ccedil;&atilde;o dos totalitarismos, tendo em vista que esses nascem da falta de reflex&atilde;o e de senso cr&iacute;tico. Na EPT, temos o papel pol&iacute;tico da forma&ccedil;&atilde;o t&eacute;cnica que vai al&eacute;m da mera prepara&ccedil;&atilde;o para a universidade, ou, no caso brasileiro, para o ENEM. Nossa miss&atilde;o &eacute; dupla: <span style="background-color: #bfedd2;">formar para a cidadania plena do ponto de vista do acesso e dom&iacute;nio da ci&ecirc;ncia e da tecnologia, e, ao mesmo tempo, profissionalizar.</span><strong> </strong>Um curso t&eacute;cnico possui a intencionalidade de que o egresso seja, al&eacute;m de um excelente cidad&atilde;o, um profissional preparado para a dial&eacute;tica <em>do</em> e <em>no </em>mundo do trabalho.&nbsp;</p>
<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">J&uuml;rgen Habermas</h5>
</div>
<div class="modal-body nota">J&uuml;rgen Habermas &eacute; um fil&oacute;sofo e soci&oacute;logo alem&atilde;o que participa da tradi&ccedil;&atilde;o da teoria cr&iacute;tica e do pragmatismo, sendo membro da Escola de Frankfurt. Dedicou sua vida ao estudo da democracia, especialmente por meio de suas teorias do agir comunicativo, da pol&iacute;tica deliberativa e da esfera p&uacute;blica. Habermas defende, como proposta para a sociedade, que transitemos progressivamente da a&ccedil;&atilde;o estrat&eacute;gica para a a&ccedil;&atilde;o comunicativa. Nesse tipo de a&ccedil;&atilde;o, a orienta&ccedil;&atilde;o deixa de ser exclusivamente para o sucesso individual e passa a se denominar como orienta&ccedil;&atilde;o para o entendimento m&uacute;tuo.
<p>&nbsp;</p>
"O objetivo de Habermas &eacute;, portanto, desenvolver uma teoria que, diferentemente da teoria tradicional, positivista, denunciada por Horkheimer, permita uma pr&aacute;xis social voltada para um conhecimento reflexivo e uma pr&aacute;xis pol&iacute;tica que questione as estruturas s&oacute;cio-pol&iacute;tico-econ&ocirc;micas existentes. A inten&ccedil;&atilde;o &eacute; propor uma teoria que livre o homem dos dogmatismos e que contribua para sua emancipa&ccedil;&atilde;o" (Ten&oacute;rio, 1998. p. 6).
<p>&nbsp;</p>
<br /><img style="max-width: 100%; padding: 10px;" src="medias/DE.2_MNT_5_2.png" alt="" /><strong> </strong><strong>Titulo:</strong> J&uuml;rgen Habermas<strong> Elabora&ccedil;&atilde;o:</strong> Prosa (2024e).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p><img class="card-curso-topo-image" src="medias/53396673897_30bc0c7bfa_k.jpg" alt="card do curso" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Profissionalizar e formar para a cidadania<strong><br />Fonte: </strong>Gaia Sch&uuml;ler (2023c).</p>


<p class="paragrafo">Por isso, a forma&ccedil;&atilde;o omnilateral e polit&eacute;cnica pretende, antes de tudo, a reflex&atilde;o sobre como se constitui a sociedade e como se fundamentam as rela&ccedil;&otilde;es de trabalho para que <span style="background-color: #bfedd2;">a inser&ccedil;&atilde;o dos novos profissionais seja um movimento de atua&ccedil;&atilde;o por contradi&ccedil;&atilde;o ao estabelecido, ao dado, ao constitu&iacute;do.</span> Seu principal objetivo &eacute; a constru&ccedil;&atilde;o de uma nova sociedade, sem exploradores e explorados, mas em que todos tenham plenas condi&ccedil;&otilde;es de proverem o seu pr&oacute;prio sustento e contribuir para a melhoria constante das rela&ccedil;&otilde;es sociais.&nbsp;</p>


<p class="paragrafo">Assim, a gest&atilde;o democr&aacute;tica em EPT visa mais &agrave; amplia&ccedil;&atilde;o da possibilidade intersubjetiva entre sujeitos livres &ndash; ao construir arranjos consensuais e ampliar a vis&atilde;o cosmopolita e democr&aacute;tica &ndash; do que propriamente ao controle de pessoas ou de processos. Dito de outro modo, <span style="background-color: #bfedd2;">trata-se de potencializar os meios de produ&ccedil;&atilde;o da racionalidade comunicativa e da amplia&ccedil;&atilde;o do di&aacute;logo e da controv&eacute;rsia, e n&atilde;o de instrumentalizar os processos e estrat&eacute;gias de controle das pessoas e os processos formativos.</span>&nbsp;</p>


<p class="paragrafo">Na proposi&ccedil;&atilde;o da A&ccedil;&atilde;o Comunicativa de Habermas, por exemplo, o modelo orientador das a&ccedil;&otilde;es e estrat&eacute;gias &eacute; o entendimento m&uacute;tuo, alcan&ccedil;ado pela comunica&ccedil;&atilde;o entre subjetividades. Por isso, a gest&atilde;o em EPT se assemelha muito ao que denominamos como <strong>Gest&atilde;o Social</strong>. &nbsp;</p>

<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">A gest&atilde;o social contrap&otilde;e-se &agrave; gest&atilde;o estrat&eacute;gica na medida em que tenta substituir a gest&atilde;o tecnoburocr&aacute;tica, monol&oacute;gica, por um gerenciamento mais participativo, dial&oacute;gico, no qual o processo decis&oacute;rio &eacute; exercido por meio de diferentes sujeitos sociais. E uma a&ccedil;&atilde;o dial&oacute;gica desenvolve-se segundo os pressupostos do agir comunicativo [...] quando os atores tratam de harmonizar internamente seus planos de a&ccedil;&atilde;o e de s&oacute; perseguir suas respectivas metas sob a condi&ccedil;&atilde;o de um acordo existente ou a se negociar sobre a situa&ccedil;&atilde;o e as consequ&ecirc;ncias esperadas [...]</p>
<div class="author citacao-longa-autoria">(Habermas, 1989, p. 165 apud Ten&oacute;rio, 1998, p. 10)</div>
</div>


<p class="paragrafo">Uma gest&atilde;o para al&eacute;m dos processos e produtos, sobretudo em EPT, precisa favorecer a emancipa&ccedil;&atilde;o lenta, gradual e permanente diante de todo e qualquer dogmatismo &ndash; diferente do que ocorreu, por exemplo, no Brasil entre os s&eacute;culos XVI e XVIII. Dermeval Saviani (2011), fil&oacute;sofo e pedagogo brasileiro, critica o modelo de doutrina&ccedil;&atilde;o imposto pela primeira matriz educacional do pa&iacute;s que, j&aacute; em 1549, ofertava a catequese jesu&iacute;tica &agrave;s comunidades tradicionais, as quais n&atilde;o tinham seu contexto e suas verdades valorizadas. Com a laiciza&ccedil;&atilde;o promovida por Marqu&ecirc;s de Pombal, em 1759, os jesu&iacute;tas s&atilde;o expulsos do Brasil; em contrapartida, h&aacute; a imposi&ccedil;&atilde;o do positivismo como crit&eacute;rio para a educa&ccedil;&atilde;o formal &ndash; modelo laico, mas doutrin&aacute;rio. Ou seja, em termos de produ&ccedil;&atilde;o da vis&atilde;o democr&aacute;tica e participativa, n&atilde;o houve progresso, apenas substitui&ccedil;&atilde;o de uma vis&atilde;o autorit&aacute;ria por outra.</p>


<p class="paragrafo"><span style="background-color: #bfedd2;">A gest&atilde;o democr&aacute;tica n&atilde;o usa a sua miss&atilde;o para se autopromover ou promover propostas espec&iacute;ficas, pelo contr&aacute;rio, ela visa potencializar a controv&eacute;rsia e o debate, sem perder de vista seu prop&oacute;sito e sua atividade fim.</span><strong> </strong>Fica claro que h&aacute; um distanciamento do modelo taylorista, que aplica de maneira equivocada o pensamento cartesiano &ndash; originalmente voltado &agrave; produ&ccedil;&atilde;o de bens &ndash; para a gest&atilde;o de pessoas, em uma l&oacute;gica sujeito-objeto. A perspectiva de Habermas, por sua vez, aproxima-se de nossos objetivos enquanto rede federal, pois prop&otilde;e uma <strong>gest&atilde;o social </strong>que instiga a comunica&ccedil;&atilde;o constante entre sujeitos que dialogam em busca de um consenso (l&oacute;gica sujeito-sujeito).</p>


<p class="paragrafo">Ten&oacute;rio (2006) argumenta que tanto o modelo de concep&ccedil;&atilde;o das ci&ecirc;ncias como o do mercado &eacute; sempre unidimensional, sendo assim todas as a&ccedil;&otilde;es e concep&ccedil;&otilde;es convergem para a mesma finalidade. Na multidimensionalidade, t&iacute;pica da gest&atilde;o social, todas as rela&ccedil;&otilde;es - quer sejam produtivas, quer sejam sociais - encontram possibilidades da realiza&ccedil;&atilde;o pessoal do indiv&iacute;duo num leque de enclaves da vida social que podem ser da ordem econ&ocirc;mica, cultural, territorial, entre outras. Ou seja, n&atilde;o existe um &uacute;nico caminho ou uma &uacute;nica concep&ccedil;&atilde;o poss&iacute;vel, porque o mote de organiza&ccedil;&atilde;o &eacute; a diverg&ecirc;ncia e n&atilde;o a converg&ecirc;ncia; &eacute; a controv&eacute;rsia e n&atilde;o a disputa; o dissenso e n&atilde;o o consenso pleno; &eacute; a busca constante por um acordo baseado na no&ccedil;&atilde;o de unicidade, sem que isso afete a unidade. <span style="background-color: #bfedd2;">Mas, na democracia, &eacute; importante que sejamos e estejamos dispostos a buscar acordos, sem a necessidade de um pensamento &uacute;nico.</span>&nbsp;</p>


<p class="paragrafo">A gest&atilde;o democr&aacute;tica em EPT deve considerar que vivemos numa sociedade livre e democr&aacute;tica, mas que precisa ser fortalecida em cada a&ccedil;&atilde;o, em cada movimento, em cada processo e em todos os setores da institui&ccedil;&atilde;o. <span style="background-color: #bfedd2;">Os pr&oacute;prios princ&iacute;pios da gest&atilde;o p&uacute;blica, entre eles, a publicidade, a transpar&ecirc;ncia, a efici&ecirc;ncia, a impessoalidade, a legalidade e a moralidade, balizam o nosso agir para um movimento que &eacute; muito mais de vi&eacute;s qualitativo, &eacute;tico e pol&iacute;tico, do que propriamente quantitativo (baseado na efici&ecirc;ncia num&eacute;rica e positivista).</span><strong> </strong>A efici&ecirc;ncia, nesse caso, precisa ser ampliada para uma vis&atilde;o mais profunda, com base em uma garantia de fato, ou condi&ccedil;&atilde;o de possibilidade para que os direitos fundamentais da pessoa humana sejam e estejam assegurados em todos os processos e servi&ccedil;os. O papel primordial do Estado ou de uma autarquia estatal n&atilde;o &eacute; o lucro ou a produ&ccedil;&atilde;o meramente eficiente do ponto de vista toyotista, mas a entrega adequada daquilo que &eacute; configurado como direito de todo e qualquer cidad&atilde;o.</p>

<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Dessa forma, o entendimento acerca de gest&atilde;o social vem refor&ccedil;ar suas caracter&iacute;sticas pol&iacute;ticas, contrapondo-a a gest&atilde;o estrat&eacute;gica. Esse modelo de gest&atilde;o &eacute; &ldquo;um tipo de a&ccedil;&atilde;o social utilitarista, fundada no c&aacute;lculo de meios e fins e implementada atrav&eacute;s da intera&ccedil;&atilde;o de duas ou mais pessoas, na qual uma delas tem autoridade formal sobre a(s) outra(s)&rdquo;. A gest&atilde;o social contrap&otilde;e-se &agrave; gest&atilde;o estrat&eacute;gica &agrave; medida que prop&otilde;e &ldquo;um gerenciamento mais participativo, dial&oacute;gico, no qual o processo decis&oacute;rio &eacute; exercido por meio de diferentes sujeitos sociais&rdquo;</p>
<div class="author citacao-longa-autoria">(Ten&oacute;rio, 1998, p. 16 apud Ten&oacute;rio, 2006, p. 4)</div>
</div>


<p class="paragrafo">A <span style="background-color: #bfedd2;">democratiza&ccedil;&atilde;o da EPT se dar&aacute; pela amplia&ccedil;&atilde;o dos espa&ccedil;os de constru&ccedil;&atilde;o de perspectivas e possibilidades democr&aacute;ticas</span>. A partir da integraliza&ccedil;&atilde;o do trabalho como princ&iacute;pio educativo, presente em todas as a&ccedil;&otilde;es e partes dos processos decis&oacute;rios institucionais, busca-se produzir uma convic&ccedil;&atilde;o dial&eacute;tica de olhar a realidade n&atilde;o apenas como contradi&ccedil;&atilde;o, mas administr&aacute;-la por contradi&ccedil;&atilde;o. Ou seja, n&atilde;o podemos olhar o contexto em que estamos inseridos como algo essencialmente pronto ou dado, mas como uma tela que precisa ser tingida com a&ccedil;&otilde;es e pensamentos que produzam, na teoria (<em>theoria</em>) e na <em>pr&aacute;xis</em>, que sejam pot&ecirc;ncias de um novo contexto: mais humano, mais justo, mais pac&iacute;fico e mais solid&aacute;rio.&nbsp;</p>


<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/DE.2_INF_6.png" alt="Tela em Constru&ccedil;&atilde;o: Potencializando um Novo Contexto" width="85%" /></p>
<p class="legenda" style="text-align: center;"><span><strong>Titulo: </strong>Tela em Constru&ccedil;&atilde;o: Potencializando um Novo Contexto</span><br /><span><strong>Fonte: </strong>Prosa (2024f).</span></p>


<p class="paragrafo">Aqui, precisamos resgatar o sentido filol&oacute;gico das palavras gregas <em>Theoria</em> e <em>Pr&aacute;xis</em>. No senso comum, apresentamos, costumeiramente, a teoria como se fosse uma oposi&ccedil;&atilde;o &agrave; pr&aacute;tica (em grego, <em>pr&aacute;xis</em>). H&aacute; at&eacute; algumas express&otilde;es do tipo: &ldquo;eu sou uma pessoa pr&aacute;tica", &ldquo;eu n&atilde;o gosto de teoria" e assim por diante. Se resgatarmos as palavras gregas em sua origem <em>(theoria e praxis),</em> elas s&atilde;o apenas partes diferentes de um mesmo movimento. Diante de um fen&ocirc;meno que n&atilde;o se sabia o que era (um eclipse, por exemplo) havia o espanto <em>(thauma)</em> que gerava a necessidade de observa&ccedil;&atilde;o demorada <em>(theoria) </em>para compreender que tal escurid&atilde;o era um fen&ocirc;meno natural e n&atilde;o sobrenatural. Esse movimento intelectivo de olhar demoradamente para al&eacute;m do que se v&ecirc;, de apreender cognitivamente tal fato e aplicar na vida pr&aacute;tica, &eacute; o que os gregos chamavam de <strong>pr&aacute;xis</strong>, ou seja, o <strong>resultado direto de uma teoria</strong>.</p>


<p class="paragrafo">A pol&iacute;tica nasceu disso. Algu&eacute;m contemplou a harmonia e a beleza do universo <em>(k&oacute;smos/kosm&eacute;o) </em>e teve a intui&ccedil;&atilde;o de aplicar essa theoria (vis&atilde;o intelectual) ao cotidiano <em>(pr&aacute;xis)</em>. Ou seja, a condi&ccedil;&atilde;o para a democracia grega era a capacidade teorizar e aplicar essas descobertas intelectuais ao cotidiano. Assim, teoria para os gregos representava a capacidade de ver intelectualmente e pr&aacute;xis, a aplica&ccedil;&atilde;o disso &agrave; realidade. No sentido pol&iacute;tico, <span style="background-color: #bfedd2;">pr&aacute;xis &eacute; a aplica&ccedil;&atilde;o na vida de uma determinada convic&ccedil;&atilde;o ou ideia.</span>&nbsp;</p>


<p class="paragrafo">&Eacute; de suma import&acirc;ncia fazermos as distin&ccedil;&otilde;es conceituais entre aquilo que &eacute; da ordem do entendimento te&oacute;rico (as bases conceituais ou legais da EPT) e aquilo que est&aacute; diretamente relacionado &agrave;s pr&aacute;ticas educativas da institui&ccedil;&atilde;o (organiza&ccedil;&atilde;o e gest&atilde;o dos espa&ccedil;os e processos administrativos). Isso porque, se n&atilde;o tivermos a apropria&ccedil;&atilde;o m&iacute;nima do que &eacute; formar pessoas na vis&atilde;o &eacute;tico-pol&iacute;tica da forma&ccedil;&atilde;o omnilateral e polit&eacute;cnica, nossas a&ccedil;&otilde;es ser&atilde;o limitadas a formarmos m&atilde;o de obra para o mercado de trabalho e, ao inv&eacute;s de sermos espa&ccedil;o de reflex&atilde;o e contradi&ccedil;&atilde;o ao hegem&ocirc;nico, faremos justamente o contr&aacute;rio.</p>


<p>Isso precisa contrastar com as antigas defini&ccedil;&otilde;es dos motivos e finalidades pelas quais formamos pessoas para esta ou aquela fun&ccedil;&atilde;o. <span style="background-color: #bfedd2;">Nesse sentido, a forma&ccedil;&atilde;o omnilateral e polit&eacute;cnica deve ser cont&iacute;nua para um constante despertar da cidadania ativa, para que os sujeitos tenham plena convic&ccedil;&atilde;o de seus direitos e deveres.</span> Devemos formar novos trabalhadores cosmopolitas, precursores de um novo tempo, de uma nova sociedade e de novas formas de rela&ccedil;&atilde;o social, dialeticamente livre e respons&aacute;vel.</p>


<div id="recursos-azul" class="feat-box-foto">
<div class="title caixa-de-destaque-titulo">Responda &agrave;s seguintes perguntas e reflita sobre o papel da forma&ccedil;&atilde;o omnilateral na EPT e como teoria e pr&aacute;tica se complementam.</div>

<ol>
<li>Qual &eacute; o sentido e o papel pol&iacute;tico da forma&ccedil;&atilde;o omnilateral em EPT?</li>
<li>Quais atitudes democr&aacute;ticas podemos/devemos potencializar na pr&aacute;xis?</li>
<li>Por que teoria e pr&aacute;tica n&atilde;o podem ser vistas como oposi&ccedil;&atilde;o?</li>
<li>No contexto em que voc&ecirc; atua, o maior desafio &eacute; de ordem pr&aacute;tica ou te&oacute;rica? Justifique.</li>
</ol>
<p>Registre seus pensamentos em seu&nbsp;<strong>Memorial</strong>&nbsp;e/ou siga as instru&ccedil;&otilde;es de seu tutor.</p>

</div>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="index-2.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" rel="noopener" href="referencias-2.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 7 de 19</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>