<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Democracia e gestão democrática na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Democracia <span style="color: #000000;">e Rede Federal&nbsp;</span></strong></p>

<p>Ao apontarmos a historicidade da no&ccedil;&atilde;o de democracia, sinalizamos a import&acirc;ncia de a compreendermos dentro de um determinado espa&ccedil;o e tempo, visto que, tanto na antiguidade grega como na modernidade &ndash; o &aacute;pice da express&atilde;o racional &ndash;, <span style="background-color: #bfedd2;">o regime democr&aacute;tico n&atilde;o permitiu participa&ccedil;&atilde;o ampla de todas as pessoas com o mesmo protagonismo e reconhecimento.</span> Pontuamos isso para inferir que a gest&atilde;o democr&aacute;tica n<span style="color: #000000;">a EPT n&atilde;</span>o pode assentar sua pr&aacute;xis numa vis&atilde;o de que existe uma ordem classificat&oacute;ria de direitos e reconhecimentos para uns e n&atilde;o para outros, pois essa &eacute; uma vis&atilde;o que n&oacute;s, enquanto institui&ccedil;&atilde;o, nos propomos a combater e n&atilde;o a perpetuar. <span style="background-color: #bfedd2;">A marca central da Rede Federa<span style="color: #000000;">l, por exemplo,&nbsp;</span>&eacute; a inclus&atilde;o e a forma&ccedil;&atilde;o omnilateral e n&atilde;o dual.</span>&nbsp;</p>


<p class="paragrafo">Notamos que, no pensamento moderno, a ideia de natureza &eacute; muito evidente, muito embora, em termos democr&aacute;ticos, a discuss&atilde;o pol&iacute;tica se d&aacute; em rela&ccedil;&atilde;o &agrave; necessidade do surgimento do Estado moderno como substitui&ccedil;&atilde;o ao antigo regime, e o deslocamento do poder de uma institucionalidade para outra. A intencionalidade em rela&ccedil;&atilde;o ao povo, ou a participa&ccedil;&atilde;o de todos o tempo todo, n&atilde;o foi (e talvez ainda n&atilde;o seja) uma convic&ccedil;&atilde;o que encontra base na realidade. <span style="background-color: #bfedd2;">Trocar o rei e o papa pelo Estado como refer&ecirc;ncia de poder decis&oacute;rio, em si, n&atilde;o significa grande mudan&ccedil;a em termos de fomento &agrave; participa&ccedil;&atilde;o de todos em tudo.</span> O mesmo para quando a burguesia suprimiu a monarquia ou o poderio simb&oacute;lico da Igreja Cat&oacute;lica. Em si, o fato de a burguesia assumir o protagonismo do poder pol&iacute;tico representa um grande progresso, mas n&atilde;o foi (e n&atilde;o &eacute;) a solu&ccedil;&atilde;o, uma vez que as pautas priorit&aacute;rias apenas mudaram de uma autocracia para uma oligarquia, ocorrendo um <strong>processo de elitiza&ccedil;&atilde;o</strong> &ndash; quando o ideal de democracia &eacute; algo bem mais amplo.</p>

<p>&nbsp;</p>
<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">As pessoas podem come&ccedil;ar a repensar a democracia fundamentalmente em raz&atilde;o da crescente influ&ecirc;ncia do mundo exterior &agrave;s fronteiras nacionais. Uma vez, comunidades de l&iacute;ngua holandesa do sul da &Aacute;frica pensaram estar criando sua pr&oacute;pria democracia ao se afastarem dos brit&acirc;nicos, e n&atilde;o viram necessidade de incluir africanos de pele escura. Democracia para n&oacute;s, mas n&atilde;o necessariamente para eles [os outros], tem sido [uma caracter&iacute;stica] central &agrave; ideia de democracia, desde Atenas. A realidade global do s&eacute;culo 21, por&eacute;m, est&aacute; tornando &lsquo;democracia para n&oacute;s mas n&atilde;o para eles&rsquo; algo dif&iacute;cil de conceber. Isto nos impele a questionar o que poderia significar um mundo mais democr&aacute;tico</p>
<div class="author citacao-longa-autoria">(Markoff, 2013, p. 28).</div>
</div>


<p class="paragrafo">De certo modo, a suposta evolu&ccedil;&atilde;o, em termos pol&iacute;ticos, da compreens&atilde;o grega antiga de democracia &agrave; compreens&atilde;o moderna e contempor&acirc;nea de democracia n&atilde;o traz, por si s&oacute;, uma vis&atilde;o de participa&ccedil;&atilde;o popular efetiva. Por exemplo, se o poder do rei, e mesmo do papa, sempre foi sustentado e justificado pelo direito sucess&oacute;rio &nbsp;&ndash; cuja concep&ccedil;&atilde;o ampara-se na ideia de natureza aos moldes da vis&atilde;o plat&ocirc;nica (inatismo) &ndash;, ent&atilde;o problematizar a gest&atilde;o democr&aacute;tica na EPT &eacute; contraposi&ccedil;&atilde;o t&aacute;cita ao hegem&ocirc;nico e ao naturalmente estabelecido. <span>Veja as diferen&ccedil;as da democracia antiga e da democracia contempor&acirc;nea:</span></p>


<p><img class="card-curso-topo-image" src="medias/DE.1_INF_5.png" alt="Democracia antiga e contempor&acirc;nea " width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo:</strong> Democracia na Gr&eacute;cia antiga e democracia liberal<br /><strong>Fonte:</strong> Prosa (2024i).</p>

<p class="paragrafo"><span style="background-color: #bfedd2;">&Eacute; urgente pensarmos as rela&ccedil;&otilde;es de trabalho numa perspectiva da forma&ccedil;&atilde;o polit&eacute;cnica e de uma gradativa inser&ccedil;&atilde;o do trabalho como princ&iacute;pio educativo</span>, para que possamos construir em nossos servidores e em nossos discentes a convic&ccedil;&atilde;o de que a forma&ccedil;&atilde;o que oferecemos deve implicar todos na dial&eacute;tica de compreens&atilde;o, explica&ccedil;&atilde;o e transforma&ccedil;&atilde;o do mundo do trabalho.&nbsp;</p>


<p class="paragrafo">Nossas a&ccedil;&otilde;es e estrat&eacute;gias precisam irromper com as amarras conceituais que sedimentam a teoria do alfinete de Adam Smith, f<span>il&oacute;sofo e economista escoc&ecirc;s </span>que, em <em>A riqueza das na&ccedil;&otilde;es </em>(2023), apresenta a produ&ccedil;&atilde;o em s&eacute;rie como o sentido maior do trabalho, desconsiderando o conhecimento polit&eacute;cnico (a produ&ccedil;&atilde;o em todos os seus aspectos e sentidos). <span style="background-color: #bfedd2;">Tal ideia desvaloriza o trabalhador e prioriza o lucro e o ac&uacute;mulo de capital.</span> O autor, desse modo, faz dois movimentos: um que retoma o sentido do trabalho como produtor da riqueza de uma na&ccedil;&atilde;o, e outro que sugere que cada trabalhador produza uma parte do alfinete, e n&atilde;o o alfinete todo &ndash; essa &eacute; a base da teoria fordista de produ&ccedil;&atilde;o em s&eacute;rie. O que verificamos em Smith &eacute; a aplica&ccedil;&atilde;o dos princ&iacute;pios cartesianos &agrave; concep&ccedil;&atilde;o de gest&atilde;o, impedindo na pr&aacute;tica a constru&ccedil;&atilde;o do que chamamos de politecnia, j&aacute; que quem produz n&atilde;o entende o sentido e o papel do que est&aacute; fazendo, e nem a rela&ccedil;&atilde;o do seu fazer com o todo da produ&ccedil;&atilde;o. Isso gera aliena&ccedil;&atilde;o, explora&ccedil;&atilde;o e desconstitui&ccedil;&atilde;o gradativa do trabalhador, assim como Charles Chaplin apresenta no filme <em><a rel="noopener" href="https://www.youtube.com/watch?v=6n9ESFJTnHs" target="_blank">Tempos Modernos</a>.</em>&nbsp;</p>


<p class="paragrafo">Isso porque, na produ&ccedil;&atilde;o fordista, n&atilde;o se trata apenas do trabalhador n&atilde;o conhecer o todo: ele &eacute; estimulado a especializar-se na parte. <span style="background-color: #bfedd2;">N&atilde;o se trata de gest&atilde;o como media&ccedil;&atilde;o dos processos, mas como estrat&eacute;gia de instrumentaliza&ccedil;&atilde;o do humano em virtude da acriticidade e da mais valia.</span>&nbsp;</p>


<p class="paragrafo">O criador da Ci&ecirc;ncia Pol&iacute;tica, <span class="modal-button button" data-toggle="modal" data-target="#modal-1">Nicolau Maquiavel</span>, em <em>O Pr&iacute;ncipe </em>(2013), quebra com todos os protocolos da filosofia pol&iacute;tica, uma vez que prioriza em sua lente te&oacute;rica <strong>o poder como fundamento</strong> de toda l&oacute;gica pol&iacute;tica, e n&atilde;o mais como forma de justificar o Estado como necessidade. Ele critica o modelo romano, segundo o qual um imperador, para governar, precisa ser amado, e critica o modelo grego, que defendia que, para exercer uma fun&ccedil;&atilde;o pol&iacute;tica, um governante deveria considerar a premissa da &eacute;tica. Ainda, afasta-se da compreens&atilde;o crist&atilde;, que na idade m&eacute;dia tentou afirmar o poder pol&iacute;tico do papa pelo vi&eacute;s da acep&ccedil;&atilde;o de sagrado, como se fosse uma escolha divina.&nbsp;</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Nicolau Maquiavel</h5>
</div>
<div class="modal-body nota">Nicolau Maquiavel (1469 - 1527) foi um fil&oacute;sofo, historiador, poeta, diplomata e m&uacute;sico de origem florentina do Renascimento. &Eacute; reconhecido como fundador do pensamento e da ci&ecirc;ncia pol&iacute;tica moderna pelo fato de ter escrito sobre o Estado e o governo como realmente s&atilde;o, e n&atilde;o como deveriam ser.<br /><img style="max-width: 100%; padding: 10px;" src="medias/DE.1_MNT_13.png" alt="" /><strong></strong><strong>T&iacute;tulo:</strong> Nicolau Maquiavel <strong>Fonte:</strong> Prosa (2024j).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo">Para Maquiavel,<span style="background-color: #bfedd2;"> o sentido da governan&ccedil;a, o fim &uacute;ltimo de toda e qualquer a&ccedil;&atilde;o, deve ser &uacute;nica e exclusivamente a manuten&ccedil;&atilde;o do poder como um fim em si mesmo.</span> Em vista disso, basta ent&atilde;o que o governante seja temido: n&atilde;o precisa ser &eacute;tico (sentido grego), n&atilde;o precisa ser amado (sentido romano) e muito menos ter v&iacute;nculo direto com o sagrado (sentido crist&atilde;o). Uma gest&atilde;o maquiav&eacute;lica em EPT fomenta inadvertidamente uma ades&atilde;o ao sentido ideol&oacute;gico e alienado, hegem&ocirc;nico, ao modelo antidial&eacute;tico e escravocrata de exerc&iacute;cio do poder.</p>
<p class="paragrafo"><span>Veja um resumo de todas as concep&ccedil;&otilde;es de governan&ccedil;a mencionadas acima:</span></p>


<p><img class="card-curso-topo-image" src="medias/DE.1_INF_7(2).png" alt="card do curso" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><span><strong>T&iacute;tulo:</strong> Concep&ccedil;&otilde;es de sentido de governan&ccedil;a<br /></span> <span><strong>Fonte: </strong>Prosa (2024k).</span></p>

<p>&nbsp;</p>
<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Por meio dessa mirada seriam vistos trabalhadores sem autonomia e impotentes, negados em sua liberdade como decurso da rudeza e dos ultrajes interpostos pelo sistema produtivo. Com isso, soaria incompreens&iacute;vel e incongruente o apelo por iniciativa, automotiva&ccedil;&atilde;o, sensibilidade, criatividade, polival&ecirc;ncia e inova&ccedil;&atilde;o lhes dirigido pelas narrativas sobre as mudan&ccedil;as no mundo do trabalho, que se querem promissoras. Essa invoca&ccedil;&atilde;o soaria como uma ordem aos trabalhadores para que aumentem sua lealdade ao capital, sua autodisciplina e autocontrole para seu sucesso profissional e a defesa competitiva do seu lugar no mercado de trabalho. Como parte desse processo, as novas formas precarizadas de trabalho via plataformas n&atilde;o est&atilde;o imunes desse ingrediente ideol&oacute;gico</p>
<div class="author citacao-longa-autoria">(Machado, 2023, p. 10).</div>
</div>


<p class="paragrafo">Isso ilustra que, na gest&atilde;o da Educa&ccedil;&atilde;o Profissional, a perspectiva democr&aacute;tica n&atilde;o se resume a votar e ser votado, ela vai &nbsp;muito al&eacute;m da organiza&ccedil;&atilde;o de um grupo para impor suas convic&ccedil;&otilde;es sobre os demais, aos moldes do que Maquiavel sugeriu. A gest&atilde;o democr&aacute;tica na EPT n&atilde;o pode ser olig&aacute;rquica e tamb&eacute;m n&atilde;o pode ser maquiav&eacute;lica, pois o mais importante &eacute; o prop&oacute;sito: <strong>o fim &uacute;ltimo da exist&ecirc;ncia<span style="color: #000000;"> da EPT</span></strong><span style="color: #000000;">,&nbsp;e </span>n&atilde;o um projeto de poder de uma ou mais pessoas.&nbsp;</p>

<p class="paragrafo">O pretexto de Maquiavel do poder como um fim em si mesmo preocupa-se apenas em se perpetuar no poder usando preferencialmente a l&oacute;gica da for&ccedil;a &ndash; o que normalmente acaba incidindo no que Arist&oacute;teles denominou como oligarquia. Nessa l&oacute;gica, os cen&aacute;rios de gest&atilde;o s&atilde;o constantemente ocupados e est&atilde;o expressos tanto na tentativa de imposi&ccedil;&atilde;o da vontade individual sobre o coletivo como no exerc&iacute;cio dos cargos de gest&atilde;o como forma estrat&eacute;gica de projeto de perpetua&ccedil;&atilde;o de poder, e n&atilde;o de servi&ccedil;o aos que mais precisam ou ao prop&oacute;sito &uacute;ltimo de uma institui&ccedil;&atilde;o.&nbsp;</p>


<p class="paragrafo">No entanto, n&atilde;o podemos esquecer que, na<span style="color: #000000;"> EPT</span>, <strong>somos trabalhadores formando trabalhadores, </strong>e os desafios em torno da profissionaliza&ccedil;&atilde;o e da postura cr&iacute;tica e criativa diante das imposi&ccedil;&otilde;es do capital exigem um olhar vigilante de quem faz gest&atilde;o. Isso significa construir pontes e estrat&eacute;gias que capacitem, fomentem e consolidem os meios e formas de democratiza&ccedil;&atilde;o nas rela&ccedil;&otilde;es com o conhecimento, nas rela&ccedil;&otilde;es interpessoais e na produ&ccedil;&atilde;o do saber cient&iacute;fico e tecnol&oacute;gico como estrat&eacute;gia de emancipa&ccedil;&atilde;o, e n&atilde;o como subordina&ccedil;&atilde;o.</p>

<p>&nbsp;</p>
<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Contudo, desafiando essas possibilidades, eis que os trabalhadores se defrontam, atualmente, com o enorme avan&ccedil;o da automatiza&ccedil;&atilde;o do trabalho e com o sentimento de inutilidade e da falta de qualifica&ccedil;&atilde;o pessoal. Isso como um fato acachapante, consolidado e refor&ccedil;ado pelo sucesso dos algoritmos e intelig&ecirc;ncia artificial no aumento da produtividade, na economia de tempo e nas comodidades ordin&aacute;rias que trazem</p>
<div class="author citacao-longa-autoria">(Machado, 2023, p. 6).</div>
</div>


<p class="paragrafo"><span style="background-color: #bfedd2;"><strong>Democracia</strong> &eacute; e ser&aacute; sempre uma ponte em constru&ccedil;&atilde;o para o fortalecimento da justi&ccedil;a social, da paz e do reconhecimento da dignidade humana.</span> N&atilde;o pode ser reduzida &agrave; pot&ecirc;ncia de sufr&aacute;gio (capacidade de podermos votar ou sermos votados), <span style="background-color: #bfedd2;">mas deve ser compreendida como um processo cont&iacute;nuo de lapida&ccedil;&atilde;o dos arranjos de poder.</span> Assim, uma institui&ccedil;&atilde;o pode transformar o conhecimento em potencialidade de amplia&ccedil;&atilde;o das liberdades individuais e fomentar a participa&ccedil;&atilde;o ampla, cr&iacute;tica e irrestrita. Nesse sentido, todos os temas, componentes curriculares, setores e servi&ccedil;os das unidades da Rede Federal precisam compreender, explicar e transformar os contextos &agrave; luz da convic&ccedil;&atilde;o de que somos resist&ecirc;ncia contra-hegem&ocirc;nica. Somos um espa&ccedil;o de produ&ccedil;&atilde;o de saberes e fazeres que promovam em todos o despertar para a import&acirc;ncia da participa&ccedil;&atilde;o livre e cr&iacute;tica em todas as decis&otilde;es que afetam as individualidades e a coletividade.&nbsp;<strong style="font-size: 2.1em;"></strong></p>

<div id="recursos-azul" class="feat-box-foto">
<div class="title caixa-de-destaque-titulo">
<p class="paragrafo"><span style="font-size: 18pt;"><strong>Gloss&aacute;rio Etimol&oacute;gico e Epistemol&oacute;gico&nbsp;</strong></span></p>

<p class="paragrafo"><strong>Theoria (grego): </strong>ver al&eacute;m do que se v&ecirc;, ver intelectualmente - (ide&iacute;n, grego = ideia).<br /><strong>Pr&aacute;xis</strong> <strong>(sentido epist&ecirc;mico):</strong> Aplica&ccedil;&atilde;o e implica&ccedil;&atilde;o de uma teoria (transformar uma ideia em realidade, ou produzir o conhecimento do conhecimento = sabedoria).<br /><strong>Pr&aacute;tica:</strong>&nbsp;Ato em si, n&atilde;o &eacute; a mesma coisa que a&ccedil;&atilde;o (sentido pol&iacute;tico &ndash; Arist&oacute;teles e Hannah Arendt) nem pr&aacute;xis. &Eacute; o simples ato de um fazer em si, que pode ser refletido ou n&atilde;o.<br /><strong>Pr&aacute;tica Educativa: </strong>Possui um foco muito forte na defini&ccedil;&atilde;o de Pr&aacute;xis, com rela&ccedil;&atilde;o direta com a Ensinagem, processo de ensinar algo &ndash; independentemente se for em espa&ccedil;o formal de sala de aula ou n&atilde;o.<br /><strong>Pr&aacute;tica Pedag&oacute;gica: </strong>Possui rela&ccedil;&atilde;o estreita com a dimens&atilde;o mais te&oacute;rica com &ecirc;nfase na aprendizagem, em espa&ccedil;o formal de ensino. Pr&aacute;tica pedag&oacute;gica est&aacute; sempre ligada a uma teoria de aprendizagem ou na pretens&atilde;o de uma aplica&ccedil;&atilde;o pr&aacute;tica de algum entendimento sobre aprendizagem.<br /><strong>Estrat&eacute;gia/Abordagem Pedag&oacute;gica: </strong>Possui foco na aprendizagem dos sujeitos (ligada &agrave; pr&aacute;xis).<br /><strong>Estrat&eacute;gia/Abordagem metodol&oacute;gica:</strong>&nbsp;Possui foco no Ensino (ligada &agrave; teoria).<br /><strong>M&eacute;todo:</strong>&nbsp;Campo da pr&aacute;xis. M&eacute;todo (met&aacute;, grego = atrav&eacute;s, pelo qual, para al&eacute;m + od&oacute;s = caminho, trilha, estrada).<br /><strong>Metodologia:</strong>&nbsp;caminho para executar um projeto, passos, ordenamento, serve para estabelecer e executar conforme prioridades (campo da teoria).</p>
<p class="paragrafo"><span style="font-weight: 400;">Ex.: os gregos olhavam para o universo e viam a beleza e harmonia do universo (k&oacute;smos/kosm&eacute;o). Em vez de guerras, resolveram aplicar a beleza e a harmonia do universo &agrave;s rela&ccedil;&otilde;es sociais (p&oacute;lis &ndash; inventaram a pol&iacute;tica).</span></p>
<ol style="list-style-type: lower-alpha;">
<li class="paragrafo"><span style="font-weight: 400;">A ideia de perfei&ccedil;&atilde;o e de beleza do universo &ndash; <em>Theoria</em> (ideia);<br /></span></li>
<li class="paragrafo"><span style="font-weight: 400;">A cria&ccedil;&atilde;o da pol&iacute;tica como modo de rela&ccedil;&atilde;o entre os humanos &eacute; a pr&aacute;xis (aplica&ccedil;&atilde;o da ideia de perfei&ccedil;&atilde;o e de beleza tirada da ideia de <em>k&oacute;smos</em>/<em>k&oacute;smeo</em>).</span></li>
</ol>
</div>
<p><strong>Para saber mais</strong>, as seguintes leituras s&atilde;o sugeridas:&nbsp;</p>
<ul>
<li><em>Pol&iacute;tica</em>, de Arist&oacute;teles;</li>
<li><em>&Eacute;tica a Nic&ocirc;macos</em>, de Arist&oacute;teles;</li>
<li><em>Sem Fins Lucrativos: Por que a democracia precisa das humanidades</em>, de Martha Nussbaum;</li>
<li><em>A condi&ccedil;&atilde;o Humana</em>, de Hannah Arendt;</li>
<li><em>Origens do Totalitarismo</em>, de Hannah Arendt;</li>
<li><em>A Teoria da A&ccedil;&atilde;o Comunicativa</em>, de J&uuml;rgen Habermas.</li>
</ul>

</div>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina-2.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="referencias.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 4 de 19</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>