<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Democracia e gestão democrática na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Plano de Desenvolvimento Institucional</strong></p>


<p class="paragrafo"><span style="font-weight: 400;">O Plano de Desenvolvimento Institucional (PDI) <span style="color: #000000;">de uma institui&ccedil;&atilde;o </span>pode tanto contemplar a inten&ccedil;&atilde;o e o desejo de uma comunidade num determinado territ&oacute;rio quanto ser resultante de um gerencialismo que imp&otilde;e suas convic&ccedil;&otilde;es e regramento dos caminhos a serem escolhidos. Sabemos, entretanto, que </span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">o PDI &eacute; um processo, um projeto vivo, devendo ser avaliado constantemente &agrave; luz da coletividade, do interesse comum e das necessidades reais de um territ&oacute;rio.</span>&nbsp;</span></p>


<p><span style="font-weight: 400;">Neste sentido, &eacute; bastante desgastante quando se abre um curso com base no proposto e disposto no PDI, </span><span style="font-weight: 400;">mas, por uma gama de fatores e nuances, esse mesmo curso acaba n&atilde;o se consolidando. Isso gera uma frustra&ccedil;&atilde;o de expectativa de todo um cen&aacute;rio social, cultural, antropol&oacute;gico e econ&ocirc;mico que, de certo modo, aposta naquela forma&ccedil;&atilde;o e n&atilde;o em outra. Al&eacute;m desse sentimento da comunidade local e regional, &eacute; preciso considerar ainda as consequ&ecirc;ncias de mobilizar docentes, alocar investimentos em infraestrutura, contratar t&eacute;cnicos em assuntos educacionais com perfil alinhado ao curso e o uso adequado de recursos p&uacute;blicos. Por isso, em termos de escolha de um eixo e dos cursos para uma unidade <span style="color: #000000;">educativa de EPT</span>, &eacute; importante um estudo cuidadoso, um olhar atento ao contexto e alto investimento em di&aacute;logo.&nbsp;</span></p>


<p class="paragrafo"><span style="font-weight: 400;">O sucesso ou o fracasso de um curso, em qualquer n&iacute;vel de ensino, sempre depender&aacute; de m&uacute;ltiplos fatores, que ser&atilde;o determinantes em cada contexto. Mas o rigor e o encaminhamento democr&aacute;tico na escolha pelo Eixo Tecnol&oacute;gico, a adequa&ccedil;&atilde;o do curso a </span><strong>crit&eacute;rios t&eacute;cnicos </strong><span style="font-weight: 400;">e a </span><strong>elabora&ccedil;&atilde;o de documentos</strong><span style="font-weight: 400;"> para as diretrizes de tal curso, superando o cartesianismo e o positivismo, j&aacute; s&atilde;o bons passos para a supera&ccedil;&atilde;o de desafios e equ&iacute;vocos que podem inviabilizar dada forma&ccedil;&atilde;o. <span>Veja agora os principais elementos para cria&ccedil;&atilde;o de um curso:</span></span></p>


<p><img class="card-curso-topo-image" src="medias/DE.4_INF_1 (1).png" alt="Elementos para cria&ccedil;&atilde;o de um curso" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><span><strong>T&iacute;tulo: </strong>Elementos para cria&ccedil;&atilde;o de um curso</span><br /><span><strong>Fonte: </strong>Prosa (2025a).</span></p>


<p class="paragrafo"><span style="font-weight: 400;">Sabemos que a procura por um determinado curso &eacute; algo muito complexo, dif&iacute;cil de prever e praticamente imposs&iacute;vel de garantir no tempo. Considerando que, desde a metade do s&eacute;culo passado, a curva da popula&ccedil;&atilde;o est&aacute; envelhecendo e o Brasil ser&aacute; em breve um pa&iacute;s de idosos, precisamos ter em mente, ao planejar qualquer forma&ccedil;&atilde;o, a urbaniza&ccedil;&atilde;o e o &ecirc;xodo rural crescente &ndash; e a respectiva falha na sucess&atilde;o rural. Ainda, como a interioriza&ccedil;&atilde;o &eacute; uma convic&ccedil;&atilde;o que n&atilde;o tem aval na experi&ecirc;ncia pr&aacute;tica, servidores e estudantes tendem a se estabelecer em centros maiores, onde h&aacute; outros recursos aliados ao acesso &agrave; sa&uacute;de, &agrave; cultura, &agrave; gastronomia, ao com&eacute;rcio, a aeroportos etc. Nesse sentido, a ideia de que a interioriza&ccedil;&atilde;o &eacute; uma necessidade, que possui alguma import&acirc;ncia e que precisa ser constitu&iacute;da &eacute; uma romantiza&ccedil;&atilde;o; na pr&aacute;tica, a sociedade caminha no sentido inverso e n&atilde;o &eacute; de agora. </span></p>


<p><img class="card-curso-topo-image" src="medias/DE.4_ILU_2.png" alt="&Ecirc;xodo Rural" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><span><strong>T&iacute;tulo:</strong> &Ecirc;xodo Rural</span><br /><span><strong>Fonte: </strong>Prosa (2025b).</span></p>


<p><span style="font-weight: 400;">Aqui, faz-se necess&aacute;rio retomar as discuss&otilde;es dos cap&iacute;tulos anteriores sobre atitudes democr&aacute;ticas ou antidemocr&aacute;ticas dentro de uma Institui&ccedil;&atilde;o de Ensino. Isso porque n&atilde;o raro um grupo de docentes for&ccedil;a a cria&ccedil;&atilde;o de um curso para chamar de seu sem que haja uma demanda coletiva e real num dado contexto.</span></p>


<p><span style="font-weight: 400;">Por vezes, at&eacute; mesmo a elabora&ccedil;&atilde;o de documentos para implementa&ccedil;&atilde;o e consolida&ccedil;&atilde;o dos cursos surge mais por uma decis&atilde;o administrativa do que por necessidade real. &Eacute; por esses motivos que acabam surgindo cursos sem procura. Criam-se deficit&aacute;rios porque o anseio da maioria em um determinado contexto na perspectiva contra hegem&ocirc;nica n&atilde;o &eacute; representado em um territ&oacute;rio, comunidade, cidade etc. (Gramsci, 2000; 2001; 2002; 2004).</span></p>


<p><span style="font-weight: 400;">Para al&eacute;m dos casos em que o PDI assume a express&atilde;o de um desejo olig&aacute;rquico, como supracitado, muitos documentos de cursos, por exemplo, s&atilde;o constru&iacute;dos de modo autorit&aacute;rio, sem di&aacute;logo, sem sintonia com a realidade e sem considerar as </span><span style="font-weight: 400;"><strong>bases conceituais e legais da EPT, que visam a supera&ccedil;&atilde;o do ensino dual e hegem&ocirc;nico</strong></span><span style="font-weight: 400;"> (Gramsci, 2000; 2001; 2002; 2004). Basta um olhar cuidadoso para notarmos o cartesianismo disposto nas ementas, bem como a organiza&ccedil;&atilde;o de disciplinas que n&atilde;o conversam entre as suas pr&oacute;prias &aacute;reas e n&atilde;o consideram o sentido do curr&iacute;culo integrado. N&atilde;o h&aacute; aproxima&ccedil;&atilde;o nem mesmo com sua &aacute;rea afim, quanto mais um di&aacute;logo epist&ecirc;mico entre a &aacute;rea b&aacute;sica e a t&eacute;cnica.&nbsp;</span></p>


<p><span style="font-weight: 400;">&Eacute; de suma import&acirc;ncia que a base legal e conceitual de nossos futuros cursos possam ser a express&atilde;o de uma <strong>vis&atilde;o dial&eacute;tica do mundo do trabalho</strong>, que cada futuro egresso possa ao apropriar-se reflexivamente das dimens&otilde;es da vida humana, <strong>trabalho, ci&ecirc;ncia e cultura</strong>, e ser capaz de compreender, explicar e transformar os contextos. Ou seja, a perspectiva de uma vis&atilde;o dial&eacute;tica em rela&ccedil;&atilde;o &agrave; realidade.&nbsp;</span></p>


<p><span style="font-weight: 400;">&Eacute; muito importante que os Projetos Pedag&oacute;gicos de Curso (PPCs) precisam ter consignado no seu todo, do ponto de vista epist&ecirc;mico, as bases legais e conceituais da EPT, pois isso &eacute; um passo importante para a constru&ccedil;&atilde;o de um processo efetivamente democr&aacute;tico e participativo. Mas basta acessarmos os documentos nos sites institucionais que facilmente notamos que muitos PPCs carregam como marca registrada o n&atilde;o cumprimento da ideia da pesquisa como pressuposto pedag&oacute;gico e do </span><strong>trabalho como princ&iacute;pio educativo</strong>,<strong> </strong><span style="font-weight: 400;">tanto em seus sil&ecirc;ncios e neglig&ecirc;ncias como em suas op&ccedil;&otilde;es te&oacute;rico-metodol&oacute;gicas.</span><span style="font-weight: 400;"> Isso porque, em sua maioria, sendo documentos p&uacute;blicos, evidenciam a carga conceitual do vi&eacute;s positivista, que privilegia alguns conhecimentos e &aacute;reas em detrimento de outros. <span style="background-color: #bfedd2;">S&atilde;o raros os documentos que carregam em sua escrita considera&ccedil;&otilde;es epistemol&oacute;gicas, pedag&oacute;gicas, antropol&oacute;gicas, hist&oacute;ricas e sociol&oacute;gicas suficientes e necess&aacute;rias para que os cursos possam atender a natureza da EPT, em toda a sua complexidade.</span>&nbsp;</span></p>


<p><span style="font-weight: 400;">Ainda, &eacute; poss&iacute;vel que um grupo de docentes rec&eacute;m-chegados para atuar em um curso tenha que trabalhar, por motivos diversos, com algo que foi constru&iacute;do por outro grupo ou pela pr&oacute;pria gest&atilde;o da unidade. Nesses casos, geralmente n&atilde;o h&aacute; possibilidade de di&aacute;logo ou contribui&ccedil;&atilde;o para que as ementas ou direcionamentos dos componentes curriculares possam atender tamb&eacute;m as expectativas de quem ir&aacute; efetivamente assumir o ensino de tal saber. Com isso, os profissionais ter&atilde;o que dedicar-se a ensinar no cotidiano algo que n&atilde;o &eacute; de sua convic&ccedil;&atilde;o e que n&atilde;o reflete sua participa&ccedil;&atilde;o na elabora&ccedil;&atilde;o.&nbsp;</span></p>


<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina-13.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina-15.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 14 de 19</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>