<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Democracia e gestão democrática na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Democracia na EPT&nbsp;</strong></p>

<p class="paragrafo"><strong>Constru&ccedil;&atilde;o cont&iacute;nua a partir dos pr&oacute;prios desafios e possibilidades</strong></p>


<p>As institui&ccedil;&otilde;es de ensino foram surgindo ao longo da hist&oacute;ria com diferentes prop&oacute;sitos. Na escola formal criada por <span>Carlos Magno, conhecido como Carlos, O Grande (Ex-imperador Romano-Germ&acirc;nico)</span>, em meados do s&eacute;culo IX &ndash; e mesmo nas universidades que surgiram no s&eacute;culo XI e XII &ndash;, <span style="background-color: #bfedd2;">entre outras caracter&iacute;sticas, estava posta a ideia de que o acesso n&atilde;o era necess&aacute;rio e nem poss&iacute;vel para todos.</span> Basta lembrarmos que at&eacute; o s&eacute;culo XV &ndash; ou o surgimento da imprensa &ndash;, a grande maioria das pessoas era analfabeta. Tanto nas tradi&ccedil;&otilde;es grega e romana, como tamb&eacute;m na tradi&ccedil;&atilde;o crist&atilde;, pilares da cultura ocidental, o acesso ao ensino formal era muito mais um privil&eacute;gio do que algo pr&oacute;ximo a um direito fundamental.&nbsp;</p>


<p class="paragrafo">&Eacute; necess&aacute;rio considerar que a institui&ccedil;&atilde;o de EPT,<span style="color: #000000;">&nbsp;&eacute;</span> uma das primeiras institui&ccedil;&otilde;es de ensino na hist&oacute;ria da humanidade que compreendem que a cidadania n&atilde;o &eacute; um privil&eacute;gio ou uma forma de distin&ccedil;&atilde;o humana, como defendiam <span class="modal-button button" data-toggle="modal" data-target="#modal-1">os gregos e os romanos.</span> Segundo Markoff (2013, p. 23-24), a &ldquo;democracia era um sistema que inclu&iacute;a algumas pessoas com plenos direitos [...] &ndash; adultos, n&atilde;o crian&ccedil;as ou adolescentes. Homens, n&atilde;o mulheres &ndash; os livres, n&atilde;o os escravos e os cidad&atilde;os, n&atilde;o estrangeiros&rdquo;. &nbsp;</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo"></h5>
</div>
<div class="modal-body nota">Na perspectiva romana, concebia-se que apenas algumas pessoas com determinadas distin&ccedil;&otilde;es sociais eram cidad&atilde;os (em latim, <em>cives</em>), e n&atilde;o todos. Ou seja, o t&iacute;tulo de cidad&atilde;o era um mecanismo de distin&ccedil;&atilde;o outorgado pelo imp&eacute;rio (Estado). Por essa raz&atilde;o, a cidadania n&atilde;o era algo que todos possu&iacute;am ou eram merecedores. Alguns poderiam ter o t&iacute;tulo de cidad&atilde;o, mas a maior parte da popula&ccedil;&atilde;o n&atilde;o. J&aacute; a perspectiva grega restringia a condi&ccedil;&atilde;o de cidad&atilde;o para poucos, os <em>arist&oacute;is</em>, ou bem nascidos, e desconsiderava alguns grupos de pessoas (mulheres, crian&ccedil;as, escravos etc) como cidad&atilde;os ou portadores de direitos humanos.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo">Ao contr&aacute;rio, a EPT apresenta para o mundo uma grande novidade: a perspectiva de que <span style="background-color: #bfedd2;">a cidadania &eacute; algo a ser constru&iacute;do por todos, o tempo todo e para todos. N&atilde;o &eacute; algo seletivo e excludente: a cidadania &eacute; atribu&iacute;da, em tese, a todos os indiv&iacute;duos, pela simples condi&ccedil;&atilde;o de serem humanos.</span> Se, em &eacute;pocas anteriores, a distin&ccedil;&atilde;o definia quem poderia ser um cidad&atilde;o, agora cidad&atilde;o significa a aus&ecirc;ncia de qualquer distin&ccedil;&atilde;o excludente. N&atilde;o h&aacute; democracia ou cidadania como distin&ccedil;&atilde;o de alguns e para alguns, ela deve ser constru&iacute;da e refletida por todos o tempo todo. Esse conceito se consolida, especialmente nos pa&iacute;ses democr&aacute;ticos, ap&oacute;s a <a rel="noopener" href="https://www.unicef.org/brazil/declaracao-universal-dos-direitos-humanos" target="_blank">Declara&ccedil;&atilde;o Universal dos Direitos Humanos de 1948</a>.&nbsp;</p>


<p><img class="card-curso-topo-image" src="medias/53297969068_359cc3ba95_k (1).jpg" alt="card do curso" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Di&aacute;logo, controv&eacute;rsia e constru&ccedil;&atilde;o da cidadania<strong><br />Fonte: </strong>Gaia Sch&uuml;ler (2023a).</p>

<p>Se considerarmos a posi&ccedil;&atilde;o de<span class="modal-button button" data-toggle="modal" data-target="#modal-2"> Hannah Arendt</span> (2001; 2007) sobre totalitarismo, &eacute; exatamente sobre isto que ela nos alerta: <span style="background-color: #bfedd2;">a falta de reflex&atilde;o produz a antidemocracia e o totalitarismo.</span><strong> </strong>Para evitar isso, <span class="modal-button button" data-toggle="modal" data-target="#modal-3">Martha Nussbaum </span>(2015), fil&oacute;sofa norte-americana, sugere que possamos construir, <span class="primary-color"><strong><em>ad infinitum</em></strong>&nbsp;<button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Ad infinitum &eacute; uma express&atilde;o em Latim que significa literalmente &ldquo;at&eacute; o infinito&rdquo;, &ldquo;sem limite ou sem fim&rdquo;, para indicar um processo ou opera&ccedil;&atilde;o que continua indefinidamente."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>, compet&ecirc;ncias e habilidades com as novas gera&ccedil;&otilde;es para a produ&ccedil;&atilde;o, explica&ccedil;&atilde;o, revis&atilde;o e consolida&ccedil;&atilde;o dos espa&ccedil;os democr&aacute;ticos em todas as institui&ccedil;&otilde;es. Portanto n&atilde;o basta sermos as primeiras institui&ccedil;&otilde;es do mundo a buscar equidade e acesso de todos a um ensino de qualidade. &Eacute; preciso criar, em nossas institui&ccedil;&otilde;es, estrat&eacute;gias de quebra do protocolo de que cidadania &eacute; concess&atilde;o a poucos, de que a escravid&atilde;o &eacute; algo natural e de que a falta de acesso &eacute; inevit&aacute;vel. Como postulou Georg Hegel em sua Filosofia da Hist&oacute;ria (1999): precisamos aprimorar nossas inst&acirc;ncias decis&oacute;rias e de participa&ccedil;&atilde;o para consolidar essa vis&atilde;o e <span class="primary-color"><strong>pr&aacute;xis</strong>&nbsp;<button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Pr&aacute;xis &eacute; a uni&atilde;o dial&eacute;tica entre teoria e pr&aacute;tica."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span><span class="primary-color"><strong>.</strong></span></p>

<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Hannah Arendt</h5>
</div>
<div class="modal-body nota">Hannah Arendt foi uma fil&oacute;sofa e te&oacute;rica pol&iacute;tica alem&atilde; (1906 - 1975). Ela &eacute; conhecida por suas contribui&ccedil;&otilde;es &agrave; filosofia pol&iacute;tica, especialmente em rela&ccedil;&atilde;o ao totalitarismo. Arendt fugiu da Alemanha nazista em 1933 e mais tarde exilou-se nos Estados Unidos. Seu trabalho mais famoso &eacute; <em>Origens do totalitarismo (2007)</em>, no qual analisa as caracter&iacute;sticas dos regimes totalit&aacute;rios do s&eacute;culo XX, como o nazismo e o stalinismo. Uma de suas ideias centrais &eacute; a "banalidade do mal", que ela desenvolveu em rela&ccedil;&atilde;o ao julgamento de Adolf Eichmann, um dos principais organizadores do Holocausto. O conceito explora como pessoas comuns podem se tornar c&uacute;mplices de atrocidades quando privadas ou n&atilde;o estimuladas &agrave; reflex&atilde;o e &agrave; racionalidade. Seu trabalho &eacute; amplamente discutido e continua a influenciar debates sobre &eacute;tica, pol&iacute;tica e direitos humanos. <br /><img style="max-width: 100%; padding: 10px;" src="medias/DE.1_MNT_9_2.png" alt="" /><strong></strong><strong>T&iacute;tulo:</strong> Hannah Arendt <strong>Fonte:</strong> Barbara Niggl Radloff (1958). <strong>Elabora&ccedil;&atilde;o:</strong> Prosa (2024f).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-3" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Martha Nussbaum</h5>
</div>
<div class="modal-body nota">Martha Nussbaum &eacute; uma renomada intelectual nos Estados Unidos. Graduada em Teatro e Cl&aacute;ssicos pela Universidade de Nova York, ela continuou seus estudos at&eacute; o p&oacute;s-doutorado na Universidade de Harvard, onde se tornou a primeira mulher a receber a distin&ccedil;&atilde;o de <em>Junior Fellowship</em>. Seu trabalho &eacute; amplamente reconhecido por integrar estudos dos cl&aacute;ssicos, antropologia, psican&aacute;lise e sociologia, com foco na busca pela eudaimonia, termo grego que representa uma vida plena e pr&oacute;spera.<br /><img style="max-width: 100%; padding: 10px;" src="medias/DE.1_MNT_10.png" alt="" /><strong> </strong><strong>T&iacute;tulo:</strong> Martha Nussbaum <strong>Fonte:</strong> Simon Fraser University (2010). <strong>Elabora&ccedil;&atilde;o:</strong> Prosa (2024g).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo">Em s&iacute;ntese, <span style="background-color: #bfedd2;">n&atilde;o h&aacute; democracia e nem democratiza&ccedil;&atilde;o sem comunh&atilde;o de prop&oacute;sitos.</span> Um governo tirano ou a tirania de um gestor que flerta com o erro por n&atilde;o considerar o <strong>bem comum</strong>, assim como um governo de muitos ou de todos que n&atilde;o considera o prop&oacute;sito ou o sentido da lei, incorre no mesmo dilema: a imola&ccedil;&atilde;o do bem comum em fun&ccedil;&atilde;o de um desvio de prop&oacute;sitos, a subvers&atilde;o dos meios e fins e a fragmenta&ccedil;&atilde;o das perspectivas de fortalecimento dos la&ccedil;os sociais m&iacute;nimos e necess&aacute;rios para uma vida justa e digna.&nbsp;</p>


<p class="paragrafo">A democracia na EPT &eacute; justamente para que todos os processos e a&ccedil;&otilde;es vinculadas ao trip&eacute; ensino, pesquisa e extens&atilde;o produzam, efetivamente, a <span class="modal-button button" data-toggle="modal" data-target="#modal-4">forma&ccedil;&atilde;o <em>omnilateral</em></span> em todos os n&iacute;veis de ensino. A democracia n&atilde;o se constitui apenas por <em>di&aacute;logos </em>(mais de um discurso), ao contr&aacute;rio, ela deve ser constru&iacute;da por meio da <em>dialogomai </em>(discurso que exige controv&eacute;rsia), com espa&ccedil;o para a oposi&ccedil;&atilde;o. Democracia como processo e n&atilde;o como produto requer controv&eacute;rsia cont&iacute;nua e representatividade s&oacute;lida de todos os segmentos para n&atilde;o se tornar totalit&aacute;ria, arbitr&aacute;ria e desvirtuada. Por isso, n&atilde;o se pode pensar em democratizar a gest&atilde;o na EPT sem tangenciar o tema do trabalho.&nbsp;</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-4" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Forma&ccedil;&atilde;o <em>omnilateral</em></h5>
</div>
<div class="modal-body nota">A forma&ccedil;&atilde;o de profissionais para a Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (EPT) deve estar em constante di&aacute;logo com a forma&ccedil;&atilde;o de docentes da educa&ccedil;&atilde;o b&aacute;sica, especialmente em conte&uacute;dos proped&ecirc;uticos. Essa forma&ccedil;&atilde;o precisa alinhar-se ainda com as pol&iacute;ticas sociais e econ&ocirc;micas, tendo o trabalho como fundamento educativo e considerando a perspectiva da omnilateralidade e da escola unit&aacute;ria. Isso significa que deve haver uma integra&ccedil;&atilde;o entre esse princ&iacute;pio e as esferas da ci&ecirc;ncia, tecnologia e cultura. Al&eacute;m disso, &eacute; essencial que essa forma&ccedil;&atilde;o inclua uma an&aacute;lise cr&iacute;tica da sociedade brasileira e da realidade educacional, levando em conta a escola como um todo &ndash; desde as pr&aacute;ticas pedag&oacute;gicas e a vida escolar at&eacute; os processos de gest&atilde;o, organiza&ccedil;&atilde;o institucional e intera&ccedil;&atilde;o com a comunidade ao redor.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>

<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">A refer&ecirc;ncia ao trabalho, na sua rela&ccedil;&atilde;o com a Educa&ccedil;&atilde;o, tamb&eacute;m tem servido de pilar te&oacute;rico e pol&iacute;tico-pedag&oacute;gico quando associado a outro conceito, o de qualidade social, o de b&uacute;ssola para a democracia escolar, a participa&ccedil;&atilde;o, a gest&atilde;o social, o acesso, perman&ecirc;ncia e &ecirc;xito de alunos, formados como cidad&atilde;os reflexivos e cr&iacute;ticos&nbsp;</p>
<div class="author citacao-longa-autoria">(Paro, 2018 apud Machado, 2023, p. 4).</div>
</div>


<p class="paragrafo">Dessa forma, o entendimento de &ldquo;trabalho&rdquo; n&atilde;o pode ser reduzido &agrave; l&oacute;gica de explora&ccedil;&atilde;o do capital ou mesmo da riqueza da mais valia, assim como n&atilde;o pode ser perpetuado como tortura ou sofrimento &ndash; como o seu sentido etimol&oacute;gico <em>tripalium</em>, que se refere a um instrumento de tortura. <span style="background-color: #bfedd2;">Na EPT, o trabalho &eacute; uma forma de o indiv&iacute;duo produzir-se como humano e humanizar-se na rela&ccedil;&atilde;o com o fazer, <em>junto</em>, <em>com</em> e <em>para</em> os outros, n&atilde;o apenas uma maneira de dominar e explorar a natureza e o outro.</span> O sentido filos&oacute;fico do trabalho &eacute;, primeiramente, produzir sentido e valor no fazer para a pr&oacute;pria condi&ccedil;&atilde;o subjetiva e humana.&nbsp;</p>


<p class="paragrafo">Para a fil&oacute;sofa Martha Nussbaum (2015), a democracia n&atilde;o &eacute; um processo natural entre os humanos. N&atilde;o podemos esperar das pessoas compet&ecirc;ncias e habilidades, <span class="primary-color"><strong><em><em>a priori</em></em></strong>&nbsp;<button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="A express&atilde;o latina a priori significa &ldquo;a partir do que &eacute; anterior&rdquo; e &eacute; usada para se referir a um conhecimento ou conclus&atilde;o pr&eacute;via que n&atilde;o depende da experi&ecirc;ncia."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>, que possam nos conduzir para um regime democr&aacute;tico: esses conhecimentos precisam ser ensinados, motivados, cultivados e constantemente revisados.&nbsp;</p>

<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Portanto, discorrer sobre o trabalho como refer&ecirc;ncia para a forma&ccedil;&atilde;o e a democracia implica abordar quest&otilde;es complexas. Em primeiro lugar, o significado do trabalho e suas rela&ccedil;&otilde;es com o processo de hominiza&ccedil;&atilde;o. Mas, tamb&eacute;m, a centralidade do trabalho na estrutura&ccedil;&atilde;o da sociedade capitalista. Com isso, tem-se a discuss&atilde;o sobre o papel da educa&ccedil;&atilde;o em face das vicissitudes da reprodu&ccedil;&atilde;o e destrui&ccedil;&atilde;o de for&ccedil;as produtivas no capitalismo, incluindo a pr&oacute;pria devasta&ccedil;&atilde;o ambiental. S&atilde;o exig&ecirc;ncias colocadas pelo mundo do trabalho &agrave; educa&ccedil;&atilde;o e sobre suas possibilidades e limita&ccedil;&otilde;es para realiz&aacute;-las</p>
<div class="author citacao-longa-autoria">(Machado, 2023, p. 12).</div>
</div>


<p class="paragrafo">Na modernidade, tivemos novas acep&ccedil;&otilde;es sobre o sentido e o papel do Estado como substitui&ccedil;&atilde;o &agrave; monarquia e ao controle religioso na pol&iacute;tica. Em uma perspectiva <em>jusnaturalista</em>, <strong>John Locke</strong> prop&ocirc;s uma vis&atilde;o de que <span style="background-color: #bfedd2;">o Estado &eacute; uma organiza&ccedil;&atilde;o necess&aacute;ria para proteger a liberdade individual &ndash; considerando que nascemos naturalmente livres.</span> De modo diferente, <strong>Thomas Hobbes</strong> defendeu que <span style="background-color: #bfedd2;">a natureza humana &eacute; de ordem m&aacute; e, nesse sentido, um Estado forte e ilimitado (Leviat&atilde;) seria a garantia de que os homens n&atilde;o se destru&iacute;ssem mutuamente.</span></p>


<p class="paragrafo">Em contraposi&ccedil;&atilde;o, <strong>Rousseau</strong>, o pai das ci&ecirc;ncias sociais, argumenta que <span style="background-color: #bfedd2;">a natureza humana &eacute; boa e a fun&ccedil;&atilde;o do Estado nada mais &eacute; do que estabelecer um Contrato Social que garanta a melhor conviv&ecirc;ncia e rela&ccedil;&atilde;o entre os humanos.</span> Nessa perspectiva, a educa&ccedil;&atilde;o &eacute; o caminho inevit&aacute;vel para esse intento, conforme nos ilustra a obra <em>Em&iacute;lio</em> (1995). De diferente, Rousseau sugere que o Estado n&atilde;o tenha apenas esse papel de monstro b&iacute;blico para inibir a luta de uns contra os outros, como sugeriu Hobbes, mas que possua, por meio da educa&ccedil;&atilde;o, o papel de potencializar as convic&ccedil;&otilde;es, compet&ecirc;ncias e habilidades necess&aacute;rias &agrave; democracia. <span>Veja a seguir um resumo dessas perspectivas de Estado:</span></p>


<p><img class="card-curso-topo-image" src="medias/DE.1_INF_4.png" alt="Perspectivas de Estado" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><span><strong>T&iacute;tulo:</strong> Perspectivas de Estado&nbsp; <br /></span><span><strong>Fonte:</strong> Prosa (2024h).</span></p>


<p class="paragrafo">Lembrando que, nas democracias grega antiga e moderna, notamos pontos divergentes e semelhantes. Como destacou Markoff (2013), a primeira estava mais vinculada a um territ&oacute;rio espec&iacute;fico, enquanto a segunda, a uma ideia de <em>na&ccedil;&atilde;o</em> &ndash; n&atilde;o necessariamente de cidade-estado, como no entendimento grego.&nbsp; &nbsp;</p>

<p><!-- Citação longa --></p>

<div id="recursos-azul" class="quote-2">
<p class="quote citacao-longa" style="display: block;">Em segundo lugar, democracia (grega) tinha alguma rela&ccedil;&atilde;o com o modo como um determinado territ&oacute;rio geogr&aacute;fico era governado. Para os atenienses, era a cidade-estado. No s&eacute;culo 18, era o estado nacional. Esta no&ccedil;&atilde;o se mant&eacute;m. Poder&iacute;amos discorrer sobre o que significa uma fam&iacute;lia democr&aacute;tica, ou um local de trabalho democr&aacute;tico ou, ainda, uma universidade democr&aacute;tica. Por&eacute;m, se demando a estudantes que citem democracias do mundo, eles come&ccedil;am indicando pa&iacute;ses</p>
<div class="author citacao-longa-autoria">(Markoff, 2013, p. 23).</div>
</div>
<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="index.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina-3.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 3 de 19</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>