<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Democracia e gestão democrática na EPT
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>O papel dos coletivos na Gest&atilde;o Democr&aacute;tica de uma institui&ccedil;&atilde;o</strong></p>

<p><span style="font-weight: 400;">Mas o que isso tem a ver com gest&atilde;o democr&aacute;tica e representatividade na EPT?</span></p>


<p class="paragrafo">Depois de considerarmos que a EPT possui um mote epist&ecirc;mico, &eacute;tico e pol&iacute;tico muito particular, uma gest&atilde;o que se pretende democr&aacute;tica n&atilde;o pode desconsiderar que n&atilde;o somos empresas, n&atilde;o somos educa&ccedil;&atilde;o geral e tampouco somos autarquias voltadas para a produ&ccedil;&atilde;o de m&atilde;o de obra barata e forma&ccedil;&atilde;o rasa e acelerada. Se de fato assumirmos isso, teremos alguns desdobramentos de ordem te&oacute;rica e pr&aacute;tica que devem ser considerados como premissa de boa gest&atilde;o neste segmento.&nbsp;</p>


<p class="paragrafo">Em primeiro lugar, precisamos olhar para o tema do trabalho com aten&ccedil;&atilde;o e rigor epist&ecirc;mico; sendo o trabalho o princ&iacute;pio educativo e mote de nossas a&ccedil;&otilde;es, n&atilde;o podemos pensar e agir sem o crit&eacute;rio da contradi&ccedil;&atilde;o. Como mencionou o pensador <span class="modal-button button" data-toggle="modal" data-target="#modal-1">Vieira Pinto</span> (2005), o pensamento sempre deve estar voltado e direcionado para lidarmos <em>por </em>contradi&ccedil;&atilde;o e n&atilde;o <em>para</em>&nbsp;pensarmos a contradi&ccedil;&atilde;o.&nbsp;</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Vieira Pinto</h5>
</div>
<div class="modal-body nota">&Aacute;lvaro Borges Vieira Pinto (1915-2002) foi um intelectual, fil&oacute;sofo e tradutor brasileiro reconhecido por sua abordagem materialista e dial&eacute;tica em rela&ccedil;&atilde;o &agrave; realidade nacional subdesenvolvida. Ele destacou a necessidade de um desenvolvimento independente para o Brasil, criticando a depend&ecirc;ncia econ&ocirc;mica e pol&iacute;tica em rela&ccedil;&atilde;o &agrave;s pot&ecirc;ncias.
<p>&nbsp;</p>
Al&eacute;m de suas contribui&ccedil;&otilde;es filos&oacute;ficas, Vieira Pinto foi um tradutor ativo, facilitando a dissemina&ccedil;&atilde;o de ideias de pensadores estrangeiros no Brasil. Politicamente, ele se envolveu em movimentos que defendiam a autonomia e a soberania do pa&iacute;s, sendo um cr&iacute;tico do imperialismo e do neoliberalismo.
<p>&nbsp;</p>
<br /><img style="max-width: 100%; padding: 10px;" src="medias/DE.3_MNT_7.png" alt="" /><strong></strong><strong>T&iacute;tulo:</strong> &Aacute;lvaro Borges Vieira Pinto <strong>Elabora&ccedil;&atilde;o:</strong> Prosa (2024e).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo">Dito de outro modo, <span style="background-color: #bfedd2;">n&atilde;o podemos olhar a realidade como algo dado, como algo essencialista, como uma m&ocirc;nada pr&eacute;-determinada, mas como um processo vivo e em constitui&ccedil;&atilde;o pela dial&eacute;tica</span>. Assim, a gest&atilde;o democr&aacute;tica na EPT n&atilde;o pode negligenciar os diferentes segmentos, categorias, minorias: todos os sujeitos que fazem parte da constitui&ccedil;&atilde;o de inst&acirc;ncias consultivas e decis&oacute;rias; considerando, &eacute; claro, a complexidade, as ramifica&ccedil;&otilde;es, os desdobramentos e os desafios que cada sujeito e o seu entorno imp&otilde;em na totalidade dos processos complexos e vivos de gest&atilde;o.&nbsp;</p>


<p class="paragrafo"><strong>T&eacute;cnicos Administrativos e Educacionais</strong></p>


<p class="paragrafo">O caminho mais seguro &eacute; estimular a representatividade e sua devida legitimidade. Dessa forma, podemos encontrar maneiras de investigar se as decis&otilde;es relacionadas &agrave; categoria dos servidores t&eacute;cnicos administrativos, por exemplo, asseguram o m&iacute;nimo necess&aacute;rio para o acolhimento e inclus&atilde;o de suas perspectivas e pautas. Estimular a&ccedil;&otilde;es e atividades de debate, participa&ccedil;&atilde;o coletiva e media&ccedil;&otilde;es que possam apurar qual &eacute; a demanda da categoria e quem melhor a representa &ndash; para cargos como Conselho Superior, Colegiado de Campus, Colegiados de Cursos, e mesmo na entidade que representar&aacute; a categoria &ndash;, s&atilde;o bons exemplos de a&ccedil;&otilde;es. O caminho &eacute; complexo, mas &eacute; o &uacute;nico modo de estimular e exercitar o congra&ccedil;amento dos pares em torno das suas pr&oacute;prias pautas.&nbsp;</p>


<p><img class="card-curso-topo-image" src="medias/53971450864_a479660874_k.jpg" alt="Foto de Assembleia" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Representatividade e participa&ccedil;&atilde;o coletiva<br /><span><strong>Fonte:</strong> Luis Fortes (2023).</span></p>


<p class="paragrafo">Nas unidades da Rede Federal, por exemplo, existe uma defini&ccedil;&atilde;o para a associa&ccedil;&atilde;o dos pares; nesse caso os T&eacute;cnicos em Assuntos Educacionais, os quais dever&atilde;o ser treinados, estimulados, motivados e assessorados para que o grupo possa bem representar-se diante da gest&atilde;o de um campus e mesmo da reitoria. N&atilde;o para impor suas pautas e demandas, mas para ponderar e refletir com as inst&acirc;ncias devidas de modo que as decis&otilde;es que dizem respeito &agrave; categoria possam ser pensadas, refletidas, representadas e defendidas pela <span class="primary-color"><strong>oitiva&nbsp;</strong><button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Ato de ouvir testemunhas, peritos, partes ou outros envolvidos em um processo."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;constante da pr&oacute;pria categoria. A representatividade &eacute; a condi&ccedil;&atilde;o de possibilidade de uma gest&atilde;o democr&aacute;tica na EPT. Mas, para tal, as pautas n&atilde;o podem ser o recorte de uma mera demanda pessoal ou de parte da colegialidade, mas o <strong>resultado dialogado </strong>daquilo que de fato expressa a necessidade mais premente de todos. Tal necessidade deve ser expressamente reconhecida e garantida por meio de pessoas que atuem em nome do grupo ou categoria (eleitas preferencialmente por sufr&aacute;gio). Esse deve ser o processo ideal em todas as inst&acirc;ncias de decis&atilde;o, seja nas unidades que denominamos campus ou na reitoria. Conhe&ccedil;a os pilares da Gest&atilde;o Democr&aacute;tica na EPT no infogr&aacute;fico a seguir:</p>


<p><img class="card-curso-topo-image" src="medias/DE.3_INF_8.png" alt="Pilares da Gest&atilde;o Democr&aacute;tica na EPT" width="100%" height="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Pilares da Gest&atilde;o Democr&aacute;tica na EPT<br /><span><strong>Fonte:</strong> Prosa (2024f).</span></p>


<p class="paragrafo">&Eacute; de vital import&acirc;ncia que na representa&ccedil;&atilde;o da categoria estejam minimamente contempladas todas as aspira&ccedil;&otilde;es, tend&ecirc;ncias, demandas e vis&otilde;es poss&iacute;veis. Estar&aacute; comprometido esse processo de democratiza&ccedil;&atilde;o se houver oligarquias (ou uso do poder por parte de alguns) para pautar determinadas demandas de cunho privado como se fossem de interesse comum. Portanto as assembleias, reuni&otilde;es, encontros e forma&ccedil;&otilde;es devem ser espa&ccedil;os de escuta constantes para o treinamento e aprimoramento das decis&otilde;es <strong>em prol da coletividade</strong>. <span style="background-color: #bfedd2;">Esse papel de fomentar o debate e a articula&ccedil;&atilde;o da categoria &eacute; (e deve ser) um compromisso da gest&atilde;o</span>,&nbsp;para que essas inst&acirc;ncias amadure&ccedil;am e cres&ccedil;am visando a pauta da categoria em conson&acirc;ncia com a demanda fim da institui&ccedil;&atilde;o.&nbsp;</p>


<p class="paragrafo"><strong>Estudantes</strong></p>


<p class="paragrafo">A categoria dos estudantes, nos diferentes n&iacute;veis, precisa ser estimulada, a exemplo do movimento de participa&ccedil;&atilde;o gradativa dos T&eacute;cnicos Administrativos. Tanto que nos cursos T&eacute;cnicos Integrados &eacute; de suma import&acirc;ncia o est&iacute;mulo e as orienta&ccedil;&otilde;es para forma&ccedil;&atilde;o de um gr&ecirc;mio estudantil s&oacute;lido e de uma diretoria que de fato represente com qualidade as demandas do segmento estudantil. Conv&eacute;m lembrar que o gr&ecirc;mio estudantil n&atilde;o &eacute; parte da gest&atilde;o de uma unidade, mas &eacute; a voz de participa&ccedil;&atilde;o de estudantes nos processos decis&oacute;rios em todos os n&iacute;veis.&nbsp;</p>


<p class="paragrafo">Para essa categoria, &eacute; importante o exerc&iacute;cio d<span style="color: #000000;">o meio termo. Assim como a administra&ccedil;&atilde;o de uma institui&ccedil;&atilde;o de EPT n&atilde;o pode sequestrar a pauta dos estudantes em seu favor ou desfavor, n</span>&atilde;o &eacute; saud&aacute;vel permitir que essa participa&ccedil;&atilde;o estudantil extrapole a sua finalidade, interferindo em inst&acirc;ncias que n&atilde;o s&atilde;o devidas. O gr&ecirc;mio estudantil &eacute; o espa&ccedil;o de treinamento para a <strong>cidadania ativa e capacita&ccedil;&atilde;o dial&oacute;gica</strong> para novas lideran&ccedil;as. Mas, pela natureza da idade e da finalidade desta agremia&ccedil;&atilde;o, &eacute; importante um acompanhamento por parte das gest&otilde;es locais e reitorias, a fim de formar lideran&ccedil;as e incentivar a representatividade em seu&nbsp;<span class="primary-color"><strong>sentido lato&nbsp;</strong><button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Sentido amplo."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;e estrito.&nbsp;&nbsp;</p>

<p class="paragrafo">De todo modo, &eacute; importante que a <span style="color: #000000;">ger&ecirc;ncia central e das unidades educativas acompanhem e incentivem </span>os estudantes a participarem das decis&otilde;es que lhes dizem respeito, a fim de exercitar a lideran&ccedil;a e a representa&ccedil;&atilde;o, transformando-os em cidad&atilde;os e cidad&atilde;s ativos. Conforme observou a fil&oacute;sofa Martha Nussbaum (2010), a representatividade e o exerc&iacute;cio democr&aacute;tico dependem de &ldquo;compet&ecirc;ncias e habilidades&rdquo; que precisam ser difundidas, treinadas, exercitadas e incentivadas.</p>


<p class="paragrafo">Aqui, &eacute; preciso lembrar da discuss&atilde;o trazida por Hannah Arendt na obra <em>A Condi&ccedil;&atilde;o Humana </em>(2005): <span style="background-color: #bfedd2;">o pr&oacute;prio mundo do trabalho implica, muitas vezes, o abandono da a&ccedil;&atilde;o (como pr&aacute;xis pol&iacute;tica), uma vez que o ser humano fica muito preso &agrave;s demandas estafantes do of&iacute;cio</span>. O modelo de vida social contempor&acirc;neo (fundado no trabalho como modo de sobreviv&ecirc;ncia) distancia-se do modelo antigo de rela&ccedil;&atilde;o com a natureza e com os outros, no qual a ocupa&ccedil;&atilde;o era destinada &agrave; subsist&ecirc;ncia e predominavam as atividades de ca&ccedil;a, coleta e pesca, e a ocupa&ccedil;&atilde;o humana n&atilde;o impedia o cuidado com a conviv&ecirc;ncia familiar ou social.&nbsp;</p>


<p class="paragrafo">Para Arendt (2005), o ciclo hist&oacute;rico da <span class="primary-color"><strong>transi&ccedil;&atilde;o do labor</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Pode referir-se a diversos processos, como a transi&ccedil;&atilde;o de carreira, a transi&ccedil;&atilde;o escola-trabalho, ou a transi&ccedil;&atilde;o entre o trabalho e o tempo pessoal."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;para o trabalho industrial n&atilde;o apenas significou maior quantidade de tempo envolvido nas atividades, mas impactou no <em>modus operandi,</em> pois, segundo a nova l&oacute;gica, a dimens&atilde;o pol&iacute;tica e o exerc&iacute;cio da cidadania ficaram relegados a um segundo plano, em virtude do trabalho ser empreendido para conquistar dividendos que atendessem &agrave;s demandas de consumo do capital.&nbsp;</p>


<p class="paragrafo">Arendt (1997) ainda considera que a defini&ccedil;&atilde;o de pol&iacute;tica e de amor trazidos por Santo Agostinho parece ser intimista demasiadamente. N&atilde;o &eacute; uma busca do autoconhecimento para o saber governar-se ou ser governado, como Plat&atilde;o sugeriu, mas, em tese, &eacute; dedica&ccedil;&atilde;o exclusiva <em>nosce te ipsum </em>(conhece-te a ti mesmo, em latim). Segundo ela, <span style="background-color: #bfedd2;">isso pode reduzir o campo social e pol&iacute;tico ao gosto e o encantamento para uma experi&ecirc;ncia mais subjetiva e solit&aacute;ria, sem o exerc&iacute;cio cidad&atilde;o mais ativo na vida p&uacute;blica</span>. Arendt parece discordar da vis&atilde;o pol&iacute;tica de Santo Agostinho, que subordina as leis humanas &agrave;s divinas e defende que as cidades humanas deveriam ser uma r&eacute;plica da cidade divina (o c&eacute;u). Para a fil&oacute;sofa, a idealiza&ccedil;&atilde;o de uma vida perfeita e feliz (seja aqui neste mundo ou na suposta vida eterna) relativiza a import&acirc;ncia da a&ccedil;&atilde;o humana nesta vida, o que pode incorrer tanto no afastamento da vida ativa na pol&iacute;tica como em pensar que as rela&ccedil;&otilde;es humanas e ef&ecirc;meras deste mundo s&atilde;o casualidades sem import&acirc;ncia, considerando o eterno que vir&aacute; depois. Para ficar mais claro, basta lembrarmos que, por causa das convic&ccedil;&otilde;es agostinianas, as universidades, logo em seu in&iacute;cio, proibiam os textos de Arist&oacute;teles, pois eles traziam um compromisso pol&iacute;tico muito mundano: <em>&ldquo;bene vivere&rdquo; </em>(Rodrigues, 2011). Na vis&atilde;o aristot&eacute;lica, a &eacute;tica e a pol&iacute;tica s&atilde;o inst&acirc;ncias que precisam ser resolvidas na pr&aacute;xis do cotidiano e, para sermos efetivamente felizes, precisamos ser virtuosos aqui e agora &ndash; n&atilde;o na eternidade.&nbsp;</p>


<p class="paragrafo">Esse movimento de cuidado de si acabou incorrendo gradativamente em um processo de preterir a vida p&uacute;blica (a&ccedil;&atilde;o, no sentido pol&iacute;tico) a segundo plano. Para Arendt (2005), esse movimento de <em>enclausuramento</em> do eu favorece tamb&eacute;m, de algum modo, a falta de reflex&atilde;o em torno do impacto de nossas escolhas e ideias no universo pol&iacute;tico e &eacute;tico (coletivo). Com isso, <span style="background-color: #bfedd2;">o gradativo desencanto pela reflex&atilde;o &ndash; e pela import&acirc;ncia do pensamento para a vida coletiva &ndash; abre possibilidades para todo tipo de totalitarismo</span>. Para a fil&oacute;sofa, sistemas autorit&aacute;rios como o nazismo e o fascismo s&atilde;o possibilidades em qualquer espa&ccedil;o e tempo, pois s&atilde;o decorrentes da neglig&ecirc;ncia com a vida reflexiva, que cria as condi&ccedil;&otilde;es para o totalitarismo. &nbsp;</p>


<p class="paragrafo">Dito isso, &eacute; imprescind&iacute;vel que tenhamos o devido cuidado de estimular a reflex&atilde;o e de capacitar nossos estudantes de todos os n&iacute;veis para o exerc&iacute;cio de uma cidadania plena, em todos os momentos e segmentos de nossos cursos. Da mesma forma, os centros acad&ecirc;micos, os cursos de n&iacute;vel superior e mesmo a p&oacute;s-gradua&ccedil;&atilde;o podem e devem ser um espa&ccedil;o de forma&ccedil;&atilde;o de lideran&ccedil;as e de exerc&iacute;cio da democratiza&ccedil;&atilde;o institucional, zelando para que haja leg&iacute;tima representatividade dos estudantes nas inst&acirc;ncias decis&oacute;rias institucionais. <span style="background-color: #bfedd2;">N&atilde;o resta a menor d&uacute;vida de que o ant&iacute;doto contra toda e qualquer perspectiva totalit&aacute;ria decorre da reflex&atilde;o e da participa&ccedil;&atilde;o de todos os segmentos e categorias nas inst&acirc;ncias decis&oacute;rias</span> (Arendt, 2005; Nussbaum, 2010).&nbsp;</p>

<p>&nbsp;</p>
<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="index-3.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina4-3.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 10 de 19</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>