<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Possibilidades da educa&ccedil;&atilde;o emancipat&oacute;ria</strong></p>


<p class="paragrafo">A EPT, conflu&ecirc;ncia entre o trabalho e a educa&ccedil;&atilde;o, herda as contradi&ccedil;&otilde;es desses dois &acirc;mbitos, em particular da subalternidade econ&ocirc;mica, social e cultural expressa na nega&ccedil;&atilde;o dos direitos, seja pela falta de vagas, seja pela precariedade, que leva &agrave; exist&ecirc;ncia e perman&ecirc;ncia hist&oacute;rica da <strong>dualidade educacional</strong>, ou seja, de duas redes: uma para as elites e outra para os trabalhadores e seus filhos.</p>


<p class="paragrafo">Entretanto, a CF/88, ao reconhecer a educa&ccedil;&atilde;o como direito social, exige uma legisla&ccedil;&atilde;o espec&iacute;fica e pol&iacute;ticas p&uacute;blicas consonantes para a garantia do acesso, da participa&ccedil;&atilde;o e da aprendizagem a todas as crian&ccedil;as, adolescentes, jovens, adultos e idosos. Ent&atilde;o, coerente com a <strong>perspectiva emancipat&oacute;ria</strong>, pode-se depreender que as pol&iacute;ticas educacionais no Brasil devem (ou deveriam) conceber a educa&ccedil;&atilde;o a partir dos seguintes princ&iacute;pios e premissas:</p>


<ul>
<li class="paragrafo"><strong>P&uacute;blica</strong>: oferecida e mantida pelo Estado, acess&iacute;vel a todos os cidad&atilde;os, independente de sua condi&ccedil;&atilde;o social, econ&ocirc;mica ou cultural. A educa&ccedil;&atilde;o p&uacute;blica deve garantir igualdade de oportunidades por ser um direito inalien&aacute;vel de cada brasileiro e brasileira.</li>
<li class="paragrafo"><strong>Gratuita</strong>: a gratuidade da educa&ccedil;&atilde;o p&uacute;blica, ou seja, sem cobran&ccedil;a de taxas ou mensalidades para o acesso e a perman&ecirc;ncia dos estudantes nas escolas e universidades mantidas pelo Estado, &eacute; um importante instrumento de redu&ccedil;&atilde;o de desigualdades educacionais. Deste modo, &eacute; assegurado o direito &agrave; educa&ccedil;&atilde;o para as classes subalternas, que possuem menor poder econ&ocirc;mico.</li>
<li class="paragrafo"><span class="primary-color"><strong>Integral</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="N&atilde;o confundir com &ldquo;tempo integral&rdquo;, sobre maior tempo de perman&ecirc;ncia na escola, nem &ldquo;integrado&rdquo;, que une conte&uacute;dos da educa&ccedil;&atilde;o b&aacute;sica e profissional."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>: busca o desenvolvimento pleno enquanto ser humano, trabalhador e cidad&atilde;o, em seus aspectos f&iacute;sico, cognitivo, moral, social e cultural. As dimens&otilde;es de solidariedade, emancipa&ccedil;&atilde;o, liberdade, empatia, criticidade, di&aacute;logo e participa&ccedil;&atilde;o social s&atilde;o essenciais nesta proposta de forma&ccedil;&atilde;o humana.</li>
<li class="paragrafo"><strong>Laica</strong>: independente de qualquer religi&atilde;o ou cren&ccedil;a, sem privil&eacute;gios ou discrimina&ccedil;&otilde;es com base na religiosidade. A laicidade garante, ao mesmo tempo, a liberdade de cren&ccedil;a e a separa&ccedil;&atilde;o entre Estado e religi&atilde;o.</li>
<li class="paragrafo"><span class="primary-color"><strong>De qualidade</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="N&atilde;o confundir com a ideologia da &ldquo;Qualidade Total&rdquo;, criada em ambiente empresarial e transposta acriticamente para o espa&ccedil;o p&uacute;blico."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;<strong>socialmente referenciada</strong>: contextualizada em rela&ccedil;&atilde;o &agrave; realidade local e &agrave;s necessidades da comunidade/territ&oacute;rio, sem perder as correla&ccedil;&otilde;es com os processos sociais mais amplos. A criticidade e o di&aacute;logo entre conhecimentos cient&iacute;ficos e os conhecimentos e saberes pr&eacute;vios, valores e cultura, bem como as demandas dos educandos, s&atilde;o elementos para uma educa&ccedil;&atilde;o que se referencia nos processos sociais.</li>
<li class="paragrafo"><strong>Inclusiva</strong>: que acolhe todos os estudantes, sem exce&ccedil;&atilde;o, respeitando suas diferen&ccedil;as e atendendo &agrave;s suas necessidades espec&iacute;ficas. Combate a discrimina&ccedil;&atilde;o e a segrega&ccedil;&atilde;o, garantindo o acesso e a perman&ecirc;ncia de pessoas com defici&ecirc;ncia, transtornos globais do desenvolvimento e altas habilidades/superdota&ccedil;&atilde;o.</li>
<li class="paragrafo"><strong>Respeito &agrave; diversidade</strong>: valoriza as m&uacute;ltiplas identidades culturais, &eacute;tnico-raciais, de g&ecirc;nero, de gera&ccedil;&atilde;o, de orienta&ccedil;&atilde;o sexual, religiosas etc. Tem como objetivo o combate aos preconceitos, a promo&ccedil;&atilde;o do di&aacute;logo intercultural e a forma&ccedil;&atilde;o de cidad&atilde;os tolerantes e solid&aacute;rios.</li>
<li class="paragrafo"><strong>Participa&ccedil;&atilde;o social</strong>: dos profissionais de educa&ccedil;&atilde;o, estudantes, pais e dos sujeitos sociais do territ&oacute;rio na constru&ccedil;&atilde;o das pol&iacute;ticas, programas e projetos. Isso envolve a participa&ccedil;&atilde;o dessas categorias nas etapas de elabora&ccedil;&atilde;o, execu&ccedil;&atilde;o e acompanhamento das pol&iacute;ticas p&uacute;blicas.</li>
</ul>


<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.2_INF_6.png" alt="card do curso" width="85%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Educa&ccedil;&atilde;o emancipat&oacute;ria<strong><br />Fonte:<span>&nbsp;</span></strong>Prosa (2024f).&nbsp;</p>


<p class="paragrafo">A adequa&ccedil;&atilde;o da legisla&ccedil;&atilde;o educacional aos princ&iacute;pios da Constitui&ccedil;&atilde;o Federal de 1988 imp&otilde;e, deste modo, uma nova Lei de Diretrizes e Bases da Educa&ccedil;&atilde;o Nacional (LDBEN), da qual decorreram outras normativas e a pr&oacute;pria organiza&ccedil;&atilde;o da educa&ccedil;&atilde;o brasileira.</p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura --></div>
<p class="content paragrafo quote citacao-curta strong" style="line-height: 1;"><span style="font-size: 24pt;"><strong>LDBEN: estrutura, contradi&ccedil;&otilde;es e transforma&ccedil;&otilde;es</strong></span></p>


<p class="paragrafo">A LDBEN &ndash; <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/leis/l9394.htm" target="_blank">Lei n&ordm; 9.394, de 20 de dezembro de 1996</a> &ndash; &eacute; uma pe&ccedil;a essencial na legisla&ccedil;&atilde;o educacional brasileira. Seu processo de tramita&ccedil;&atilde;o, bem como suas pol&ecirc;micas e contradi&ccedil;&otilde;es, reflete a din&acirc;mica e a evolu&ccedil;&atilde;o do sistema educacional no Brasil, fruto das tens&otilde;es entre diferentes interesses sociais e pol&iacute;ticos e das correla&ccedil;&otilde;es de for&ccedil;as entre os polos hegem&ocirc;nico e contra-hegem&ocirc;nico da sociedade.</p>


<p class="paragrafo">A regula&ccedil;&atilde;o da educa&ccedil;&atilde;o pelo Estado brasileiro iniciou no Imp&eacute;rio (1822-1889), com a primeira lei acerca desse assunto promulgada em 1827. Mas foi apenas na Rep&uacute;blica (1889 at&eacute; a atualidade), pela Constitui&ccedil;&atilde;o de 1934, que as diretrizes para a educa&ccedil;&atilde;o foram previstas em lei como <strong>responsabilidade da Uni&atilde;o</strong>. Nesse paradigma, a Lei de Diretrizes e Bases (LDB), em sua primeira vers&atilde;o, s&oacute; foi promulgada em 1961 (governo de Jo&atilde;o Goulart), portanto em um contexto democr&aacute;tico, e foi caracterizada pela tentativa de descentralizar a estrutura administrativa da educa&ccedil;&atilde;o, conferindo maior autonomia aos sistemas estaduais de ensino dos estados e munic&iacute;pios.</p>


<p class="paragrafo">Com a Ditadura Militar (1964-1985), a LDB/61, embora vigente, n&atilde;o tinha efetividade e, assim, foi promulgado uma nova LDB em 1971, que manteve aspectos da anterior, embora com uma orienta&ccedil;&atilde;o muito mais conservadora e centralizadora. Ap&oacute;s a <strong>redemocratiza&ccedil;&atilde;o</strong> do Brasil com a Constitui&ccedil;&atilde;o de 1988, cristalizou-se a discuss&atilde;o de um novo marco regulat&oacute;rio para a educa&ccedil;&atilde;o brasileira, culminando na promulga&ccedil;&atilde;o da <strong>LDBEN de 1996</strong>.</p>


<div id="webstories-placeholder" style="display: none; text-align: center; padding: 20px; border: 1px dashed #ccc;">O WebStorie est&aacute; oculto neste ambiente.</div>
<div id="webstories" class="container">
<div class="row justify-content-center justify-content-md-start">
<div class="col-12 col-sm-12 col-md-12 col-lg-12 col-xl-12" style="padding-top: 15px; padding-bottom: 15px;">
<div id="swiffy-animation" class="swiffy-slider slider-item-ratio slider-item-ratio-16x9 slider-nav-visible slider-nav-animation slider-nav-animation-fadein slider-item-first-visible" style="height: 600px;">
<ul id="container1" class="slider-container">
<li id="slide1" class="slide-visible"><img style="object-fit: contain;" src="medias/PP.2_WEB_7 (1).png" alt="..." width="200" /></li>
<li id="slide2"><img style="object-fit: contain;" src="medias/PP.2_WEB_7 (2).png" alt="..." width="200" /></li>
<li id="slide3"><img style="object-fit: contain;" src="medias/PP.2_WEB_7 (3).png" alt="..." width="200" /></li>
<li id="slide4"><img style="object-fit: contain;" src="medias/PP.2_WEB_7 (4).png" alt="..." width="200" /></li>
<li id="slide5"><img style="object-fit: contain;" src="medias/PP.2_WEB_7 (5).png" alt="..." width="200" /></li>
<li id="slide3"><img style="object-fit: contain;" src="medias/PP.2_WEB_7 (6).png" alt="..." width="200" /></li>
<li id="slide4"><img style="object-fit: contain;" src="medias/PP.2_WEB_7 (7).png" alt="..." width="200" /></li>
<li id="slide5"><img style="object-fit: contain;" src="medias/PP.2_WEB_7 (8).png" alt="..." width="200" /></li>
<li id="slide6"><img style="object-fit: contain;" src="medias/PP.2_WEB_7 (9).png" alt="..." width="200" /></li>
</ul>
<button class="slider-nav" style="--swiffy-slider-nav-light: #525AD2; outline: none;" aria-label="Go to previous" type="button"></button> <button class="slider-nav slider-nav-next" style="--swiffy-slider-nav-light: #525AD2; outline: none;" aria-label="Go to next" type="button"></button>
<div class="slider-indicators"><button class="active" aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button></div>
</div>
</div>
</div>
</div>


<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Linha do tempo da LDBEN<strong><br /><span style="background-color: #ffffff;">Fonte: </span></strong><span style="background-color: #ffffff;">Brasil (1988).</span><strong><br />Elabora&ccedil;&atilde;o: </strong>Prosa (2024g).</p>

<p class="paragrafo">Como j&aacute; foi visto, os artigos referentes &agrave; educa&ccedil;&atilde;o na Constitui&ccedil;&atilde;o de 1988, embora contradit&oacute;rios, apresentaram avan&ccedil;os significativos (a educa&ccedil;&atilde;o como direito social, a universaliza&ccedil;&atilde;o do ensino, a valoriza&ccedil;&atilde;o dos profissionais da educa&ccedil;&atilde;o etc.) e diversos outros indicativos que deveriam nortear a nova LDBEN.</p>


<p class="paragrafo">Entretanto, os acirrados debates sobre a educa&ccedil;&atilde;o, que tinham acontecido durante a Assembleia Constituinte, continuaram em um novo patamar com o reagrupamento das for&ccedil;as conservadoras. O processo de elabora&ccedil;&atilde;o dos projetos de lei evidencia as diferen&ccedil;as entre o debate, a participa&ccedil;&atilde;o democr&aacute;tica da sociedade civil e a elabora&ccedil;&atilde;o de gabinete.</p>


<p class="paragrafo">Dois projetos de sociedade e de educa&ccedil;&atilde;o ficaram evidentes: a manuten&ccedil;&atilde;o da dualidade das redes, sendo a <strong>educa&ccedil;&atilde;o p&uacute;blica</strong>, de baixa qualidade e voltada para a forma&ccedil;&atilde;o de m&atilde;o de obra destinada aos filhos dos grupos subalternos, e a <strong>educa&ccedil;&atilde;o privada</strong>, para a reprodu&ccedil;&atilde;o dos quadros da elite. Decorrem disso as disputas pelos sentidos, objetivos, conte&uacute;dos e, tamb&eacute;m, pelo destino dos recursos p&uacute;blicos para a educa&ccedil;&atilde;o. As principais pol&ecirc;micas eram (e continuam a ser):</p>


<ul>
<li class="paragrafo"><strong>A autonomia dos sistemas</strong>: a LDBEN/96 retoma boa parte da autonomia de estados e munic&iacute;pios da LDB/61. Contudo, continuam as discuss&otilde;es sobre os limites desta autonomia (por exemplo, quanto &agrave; oferta de n&iacute;veis, modalidades, seus curr&iacute;culos, a necessidade de garantir a equidade, o padr&atilde;o de qualidade e o financiamento necess&aacute;rio para a execu&ccedil;&atilde;o das pol&iacute;ticas educacionais). Tamb&eacute;m continua inconcluso o debate sobre o regime de colabora&ccedil;&atilde;o entre Uni&atilde;o, estados e munic&iacute;pios.</li>
<li class="paragrafo"><strong>Educa&ccedil;&atilde;o p&uacute;blica e os limites da educa&ccedil;&atilde;o privada</strong>: o intenso e permanente debate sobre o papel do setor privado na educa&ccedil;&atilde;o e o financiamento de institui&ccedil;&otilde;es privadas com recursos p&uacute;blicos. Debate que envolve tanto a forma direta de privatiza&ccedil;&atilde;o (gest&atilde;o administrativa e pedag&oacute;gica de unidades escolares p&uacute;blicas) quanto a forma indireta, como a gest&atilde;o administrativa de equipamentos p&uacute;blicos, a compra de vagas em unidades privadas, a oferta privada de componentes curriculares, a terceiriza&ccedil;&atilde;o de docentes e funcion&aacute;rios, a ado&ccedil;&atilde;o de material did&aacute;tico, consultorias de entidades empresariais, entre outras.</li>
<li class="paragrafo"><strong>Qualidade da educa&ccedil;&atilde;o</strong>: a LDBEN preconiza a educa&ccedil;&atilde;o de qualidade para todos e o debate se d&aacute; em torno do significado dessa qualidade, se socialmente referenciada ou se baseada em padr&otilde;es gerais, aferidos por m&eacute;todos de avalia&ccedil;&atilde;o em massa. A perman&ecirc;ncia das desigualdades educacionais, com milh&otilde;es de pessoas tendo seus direitos &agrave; educa&ccedil;&atilde;o negados, reflete as desigualdades regionais e as disparidades sociais e econ&ocirc;micas no pa&iacute;s.</li>
<li class="paragrafo"><strong>Mudan&ccedil;as curriculares e inclus&atilde;o de temas da pauta identit&aacute;ria e social</strong>: a inclus&atilde;o de temas como as rela&ccedil;&otilde;es &eacute;tnico-raciais e de g&ecirc;nero, educa&ccedil;&atilde;o sexual, diversidade cultural e direitos humanos e, ainda, a presen&ccedil;a/aus&ecirc;ncia de determinados componentes/disciplinas no curr&iacute;culo escolar refletem as tens&otilde;es sociais e pol&iacute;ticas em torno dos objetivos da educa&ccedil;&atilde;o.</li>
<li class="paragrafo"><strong>Valoriza&ccedil;&atilde;o do magist&eacute;rio</strong>: a LDBEN estabeleceu a forma&ccedil;&atilde;o m&iacute;nima para o exerc&iacute;cio docente&nbsp;(licenciatura) e o piso salarial nacional para a educa&ccedil;&atilde;o p&uacute;blica. Entretanto, sob o aparente consenso em rela&ccedil;&atilde;o &agrave; valoriza&ccedil;&atilde;o dos profissionais da educa&ccedil;&atilde;o e os avan&ccedil;os em algumas &aacute;reas, permanecem os baixos sal&aacute;rios, as condi&ccedil;&otilde;es de trabalho prec&aacute;rias, a aus&ecirc;ncia ou a oferta insuficiente de forma&ccedil;&atilde;o inicial e continuada e a discrep&acirc;ncia da forma&ccedil;&atilde;o em rela&ccedil;&atilde;o &agrave; disciplina ministrada. Tais quest&otilde;es t&ecirc;m impacto direto na qualidade da educa&ccedil;&atilde;o.</li>
<li class="paragrafo"><strong>Financiamento da educa&ccedil;&atilde;o</strong>: a LDBEN estabelece diretrizes para o financiamento da educa&ccedil;&atilde;o, mas essas diretrizes s&atilde;o objeto de intensa disputa em rela&ccedil;&atilde;o ao volume de recursos a serem investidos, &agrave; distribui&ccedil;&atilde;o desses recursos entre os n&iacute;veis e etapas da educa&ccedil;&atilde;o e entre os entes federados (estados e munic&iacute;pios) e, tamb&eacute;m, &agrave; fiscaliza&ccedil;&atilde;o do uso destes recursos p&uacute;blicos para seu fim prec&iacute;puo: a escola p&uacute;blica.</li>
</ul>


<p class="paragrafo">Desde sua promulga&ccedil;&atilde;o, a LDBEN passou por muitas atualiza&ccedil;&otilde;es e emendas em apenas cinco anos, todavia, entre 1997 e 2024, n&atilde;o ocorreram modifica&ccedil;&otilde;es. &Eacute; a lei mais alterada da hist&oacute;ria da Rep&uacute;blica, s&oacute; perdendo para a pr&oacute;pria Constitui&ccedil;&atilde;o, o que demonstra a import&acirc;ncia dada &agrave; educa&ccedil;&atilde;o pelos grupos sociais, tanto a elite quanto os subalternos e a oposi&ccedil;&atilde;o.</p>


<p class="paragrafo">Tais mudan&ccedil;as devem ser analisadas como derivadas das <strong>lutas sociais</strong>&nbsp;que se refletem no campo educacional e apresentam avan&ccedil;os e recuos, expressando a conjuntura e respectiva correla&ccedil;&atilde;o de for&ccedil;as. <span class="primary-color"><strong>Outras normativas</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Algumas destas normativas ser&atilde;o abordadas nos T&oacute;picos 4 e 5, incluindo aquelas que deram origem a programas educacionais relacionados &agrave; EPT."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;(leis e decretos) n&atilde;o alteram a <span class="modal-button button" data-toggle="modal" data-target="#modal-1">LDBEN</span>, mas detalham, especificam ou regulamentam artigos que abordam temas complexos, quase sempre pol&ecirc;micos, como o financiamento.</p>


<p class="paragrafo">Ainda assim, ainda que represente posi&ccedil;&otilde;es intermedi&aacute;rias e contradit&oacute;rias, a ess&ecirc;ncia da concep&ccedil;&atilde;o de educa&ccedil;&atilde;o presente na LDBEN/96 &ndash; p&uacute;blica, gratuita, laica, de qualidade e, principalmente, que parte da compreens&atilde;o de educa&ccedil;&atilde;o como direito social de todos e todas, que n&atilde;o prescreve com a idade &ndash; resiste e a LDBEN continua&nbsp;como um dos marcos mais importante na hist&oacute;ria da educa&ccedil;&atilde;o brasileira.</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Se&ccedil;&otilde;es da LDBEN</h5>
</div>
<div class="modal-body nota"><br /><img style="max-width: 100%; padding: 10px;" src="medias/PP.2_INF_8.png" alt="" /><strong> T&iacute;tulo: </strong> Se&ccedil;&otilde;es da LDBEN <strong> Fonte: </strong> Brasil (1996). <strong> Elabora&ccedil;&atilde;o: </strong> Prosa (2024h).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_14.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_17.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 13 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>