<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>No&ccedil;&otilde;es introduzidas pela ideologia neoliberal</strong></p>


<p class="paragrafo">Tamb&eacute;m foi introduzida a no&ccedil;&atilde;o de &ldquo;compet&ecirc;ncias&rdquo; a serem adquiridas no processo formativo: a &ldquo;meritocracia&rdquo;, o &ldquo;empreendedorismo&rdquo; e outras &ldquo;inova&ccedil;&otilde;es&rdquo; que se tornaram correntes nos curr&iacute;culos, na m&iacute;dia, nas pol&iacute;ticas p&uacute;blicas, no discurso de gestores p&uacute;blicos e de pol&iacute;ticos e at&eacute; na linguagem cotidiana como parte da luta simb&oacute;lica, dando suporte &ldquo;te&oacute;rico&rdquo; aos programas e &agrave; legisla&ccedil;&atilde;o.</p>


<p class="paragrafo">Nesse sentido, uma das no&ccedil;&otilde;es introduzidas pelo neoliberalismo &eacute; a de <strong>compet&ecirc;ncias</strong>. Essa, no contexto educacional, <span style="background-color: #bfedd2;">refere-se &agrave; capacidade de mobilizar conhecimentos, habilidades, atitudes e valores para resolver problemas e enfrentar desafios em diferentes contextos da vida cotidiana e do trabalho</span> (Brasil, 2018). Difundida a partir dos organismos multilaterais e <span style="background-color: #bfedd2;">voltada para o aumento da produtividade do trabalho, essa no&ccedil;&atilde;o operativa de forte carga ideol&oacute;gica ganhou espa&ccedil;o no Brasil a partir da d&eacute;cada de 1990</span> em oposi&ccedil;&atilde;o ao conceito de qualifica&ccedil;&atilde;o. Nesse paradigma, estudos cr&iacute;ticos revelam algumas tend&ecirc;ncias:</p>


<ul>
<li class="paragrafo">A fragmenta&ccedil;&atilde;o da aquisi&ccedil;&atilde;o do conhecimento, priorizando habilidades espec&iacute;ficas em detrimento de uma forma&ccedil;&atilde;o mais ampla;&nbsp;</li>
<li class="paragrafo">O resumo dos objetivos a alcan&ccedil;ar profici&ecirc;ncia em tarefas espec&iacute;ficas, sem a compreens&atilde;o dos conceitos e das rela&ccedil;&otilde;es sociais envolvidas;&nbsp;</li>
<li class="paragrafo">A &ecirc;nfase em compet&ecirc;ncias demandadas pelo mercado, ignorando aspectos como a forma&ccedil;&atilde;o cidad&atilde; e a capacidade cr&iacute;tica, essenciais para a forma&ccedil;&atilde;o integral;&nbsp;</li>
<li class="paragrafo">A desconsidera&ccedil;&atilde;o da qualidade da forma&ccedil;&atilde;o e o impacto real das trajet&oacute;rias dos estudantes;&nbsp;</li>
<li class="paragrafo">A acentua&ccedil;&atilde;o das desigualdades, j&aacute; que nem todos os estudantes t&ecirc;m acesso igual a recursos, forma&ccedil;&atilde;o e oportunidades que lhes permitam desenvolver as compet&ecirc;ncias exigidas.</li>
</ul>


<p class="paragrafo">Al&eacute;m disso, observa-se tamb&eacute;m a formula&ccedil;&atilde;o ideol&oacute;gica de <strong>meritocracia</strong>, princ&iacute;pio que <span style="background-color: #bfedd2;">defende que as pessoas devem ser recompensadas ou promovidas com base em seu m&eacute;rito, ou seja, por suas habilidades, esfor&ccedil;os e conquistas, sugerindo que o sucesso deve ser alcan&ccedil;ado por meio do trabalho duro e do talento individual</span>, ignorando fatores como origem social, conex&otilde;es ou privil&eacute;gios. Entretanto, o sistema de privil&eacute;gios das elites, que mant&eacute;m o <em>status quo</em>, desmente cotidianamente a meritocracia, tornando-a uma fal&aacute;cia por n&atilde;o considerar os diferentes &ldquo;pontos de partida&rdquo; individuais e a desigualdade das oportunidades dispon&iacute;veis.</p>


<p class="paragrafo">Ainda, a ideologia neoliberal tamb&eacute;m elabora a ideia de <strong>empreendedorismo</strong>, que &nbsp;&eacute; a <span style="background-color: #bfedd2;">capacidade e disposi&ccedil;&atilde;o de iniciar, desenvolver e gerenciar um novo neg&oacute;cio ou projeto assumindo riscos financeiros e pessoais em busca de lucro ou impacto social.</span> O empreendedorismo &eacute; visto como uma solu&ccedil;&atilde;o para o desemprego, desobrigando o Estado de executar pol&iacute;ticas de gera&ccedil;&atilde;o de empregos e de seguridade social. Essa concep&ccedil;&atilde;o <span style="background-color: #bfedd2;">apresenta forte carga ideol&oacute;gica, na medida que o trabalhador individual perde a sua identidade de subalterno</span> (que continua sendo) e passa a se considerar &ldquo;empres&aacute;rio&rdquo; (parte da elite).</p>


<p class="paragrafo">Essa no&ccedil;&atilde;o est&aacute; em oposi&ccedil;&atilde;o &agrave;s no&ccedil;&otilde;es de trabalho aut&ocirc;nomo, autoemprego e trabalho familiar, al&eacute;m de competir e desestimular solu&ccedil;&otilde;es mais sustent&aacute;veis, como a economia solid&aacute;ria (o trabalho em rede, associado ou cooperativo). Logo, ao promover a ideia de que o sucesso ou fracasso econ&ocirc;mico &eacute; exclusivamente responsabilidade do indiv&iacute;duo, esse sistema ignora deliberadamente os fatores estruturais, a desigualdade social e a falta de pol&iacute;ticas p&uacute;blicas interseccionais, que afetam as oportunidades dispon&iacute;veis para diferentes grupos.</p>


<p class="paragrafo">A <strong>ideologia do empreendedorismo desvia a aten&ccedil;&atilde;o das contradi&ccedil;&otilde;es entre capital e trabalho</strong>, minimizando as quest&otilde;es envolvendo direitos sociais, seguridade social e a melhoria das condi&ccedil;&otilde;es socioecon&ocirc;micas coletivas que impactam os trabalhadores; promove, portanto, a privatiza&ccedil;&atilde;o dos problemas sociais, criando a ideia de que cada indiv&iacute;duo deve se virar sozinha sem apoio coletivo ou governamental. O lucro e a competi&ccedil;&atilde;o substituem os valores da solidariedade, empatia, toler&acirc;ncia e cidadania. Ademais, outro grande impacto negativo do empreendedorismo &eacute; a sua &ecirc;nfase dentro das escolas, que transforma a educa&ccedil;&atilde;o em prepara&ccedil;&atilde;o para o mercado de trabalho, em detrimento da forma&ccedil;&atilde;o integral.</p>


<p class="paragrafo">O resultado da vis&atilde;o de trabalho constru&iacute;da por essas no&ccedil;&otilde;es tem consequ&ecirc;ncias, listadas abaixo:</p>


<div id="webstories-placeholder" style="display: none; text-align: center; padding: 20px; border: 1px dashed #ccc;">O WebStorie est&aacute; oculto neste ambiente.</div>
<div id="webstories" class="container">
<div class="row justify-content-center justify-content-md-start">
<div class="col-12 col-sm-12 col-md-12 col-lg-12 col-xl-12" style="padding-top: 15px; padding-bottom: 15px;">
<div id="swiffy-animation" class="swiffy-slider slider-item-ratio slider-item-ratio-16x9 slider-nav-visible slider-nav-animation slider-nav-animation-fadein slider-item-first-visible" style="height: 600px;">
<ul id="container1" class="slider-container">
<li id="slide1" class="slide-visible"><img style="object-fit: contain;" src="medias/PP.4_WEB_2 (1).png" alt="..." width="200" /></li>
<li id="slide2"><img style="object-fit: contain;" src="medias/PP.4_WEB_2 (2).png" alt="..." width="200" /></li>
<li id="slide3"><img style="object-fit: contain;" src="medias/PP.4_WEB_2 (3) (1).png" alt="..." width="200" /></li>
<li id="slide4"><img style="object-fit: contain;" src="medias/PP.4_WEB_2 (4).png" alt="..." width="200" /></li>
<li id="slide5"><img style="object-fit: contain;" src="medias/PP.4_WEB_2 (5.2).png" alt="..." width="200" /></li>
</ul>
<button class="slider-nav" style="--swiffy-slider-nav-light: #525AD2; outline: none;" aria-label="Go to previous" type="button"></button> <button class="slider-nav slider-nav-next" style="--swiffy-slider-nav-light: #525AD2; outline: none;" aria-label="Go to next" type="button"></button>
<div class="slider-indicators"><button class="active" aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button></div>
</div>
</div>
</div>
</div>

<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Consequ&ecirc;ncias da l&oacute;gica neoliberal no trabalho<br /><strong>Fonte: </strong>Prosa (2025b).</p>


<p class="paragrafo">No Brasil, essas no&ccedil;&otilde;es come&ccedil;aram a ganhar destaque nos anos 1990 ao tempo em que, em contraponto, surgiram as exig&ecirc;ncias de seguridade social pelos trabalhadores diante das crises econ&ocirc;micas, do aumento da inseguran&ccedil;a no trabalho e das mudan&ccedil;as tecnol&oacute;gicas. Dentre as pol&iacute;ticas p&uacute;blicas compensat&oacute;rias, as qualifica&ccedil;&otilde;es profissionais de curta e curt&iacute;ssima dura&ccedil;&atilde;o foram propagandeadas como <strong>&ldquo;pol&iacute;tica ativa de emprego&rdquo;</strong>, como se uma forma&ccedil;&atilde;o aligeirada tivesse o poder de garantir postos de trabalho.</p>


<p class="paragrafo">Aparentemente, a origem do termo <em>e</em><em>nsino profissionalizante</em> (que n&atilde;o consta em nenhuma legisla&ccedil;&atilde;o consultada) &eacute; parte do processo de luta simb&oacute;lica. Como era preciso distinguir a forma&ccedil;&atilde;o profissional de n&iacute;vel m&eacute;dio e superior dos &ldquo;cursos livres&rdquo; e, ao mesmo tempo, valoriz&aacute;-los no imagin&aacute;rio da sociedade, o termo foi inserido pelos setores hegem&ocirc;nicos como sin&ocirc;nimo de forma&ccedil;&atilde;o profissional. Simbolicamente, &eacute; mantido o termo &ldquo;ensino&rdquo; (utilizado desde o Imp&eacute;rio), que remete a processos educativos e se sugere a possibilidade de profissionaliza&ccedil;&atilde;o, com um sufixo que denota a&ccedil;&atilde;o: &ldquo;profissionaliz<em>ante</em>&rdquo;. Na ressignifica&ccedil;&atilde;o cr&iacute;tica do termo, a conota&ccedil;&atilde;o passa a ser de algo prec&aacute;rio e raso, um &ldquo;verniz &ldquo; de qualifica&ccedil;&atilde;o, antinomia de uma verdadeira Educa&ccedil;&atilde;o Profissional.</p>


<p class="paragrafo">Como alternativa &agrave; &ldquo;empregabilidade&rdquo;, a proposta foi a constru&ccedil;&atilde;o de um <strong>sistema p&uacute;blico de emprego</strong>, ou seja, um conjunto de a&ccedil;&otilde;es articuladas com foco em pol&iacute;ticas de gera&ccedil;&atilde;o de trabalho, emprego e renda capazes de minimizar os efeitos da crise sobre os trabalhadores e prepar&aacute;-los para o ciclo econ&ocirc;mico ascendente.</p>


<p class="paragrafo">A posi&ccedil;&atilde;o hegem&ocirc;nica sobre a Educa&ccedil;&atilde;o Profissional est&aacute; expressa na <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/Leis/L8948.htm" target="_blank">Lei n&ordm; 8.948/94</a> (modificada em parte pela Lei n&ordm; 9.649/98), que transformou as escolas t&eacute;cnicas federais em Centros Federais de Educa&ccedil;&atilde;o Tecnol&oacute;gica (CEFETs) e criou o Sistema Nacional de Educa&ccedil;&atilde;o Tecnol&oacute;gica, incluindo tamb&eacute;m, de forma opcional, os servi&ccedil;os sociais de aprendizagem e proibiu a cria&ccedil;&atilde;o de novas unidades em seu par&aacute;grafo 5&ordm; do artigo 3&ordm;. Essa posi&ccedil;&atilde;o est&aacute; presente, tamb&eacute;m, no <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/decreto/d2208.htm" target="_blank">Decreto n&ordm; 2.208/97</a>, que regulamentou os artigos 39 a 42 do cap&iacute;tulo III (&ldquo;da Educa&ccedil;&atilde;o Profissional&rdquo;) do t&iacute;tulo V (&ldquo;Dos n&iacute;veis e modalidades de Educa&ccedil;&atilde;o e Ensino) da LDBEN/96.</p>


<p class="paragrafo">Essas normativas, al&eacute;m de garantir a legalidade da concep&ccedil;&atilde;o descrita anteriormente, tamb&eacute;m realizaram a introdu&ccedil;&atilde;o da <strong>forma&ccedil;&atilde;o modular</strong>, possibilitando a obten&ccedil;&atilde;o do diploma de t&eacute;cnico de n&iacute;vel m&eacute;dio cursando m&oacute;dulos sem conex&atilde;o pedag&oacute;gica ou institucional entre si. Outra quest&atilde;o &eacute; a estrutura curricular sem integra&ccedil;&atilde;o significativa com o Ensino M&eacute;dio, n&atilde;o preparando adequadamente os estudantes para a continuidade dos estudos em n&iacute;vel superior, limitando suas op&ccedil;&otilde;es acad&ecirc;micas. Al&eacute;m disso, a inexist&ecirc;ncia de um sistema claro para o reconhecimento dos diplomas de cursos t&eacute;cnicos em rela&ccedil;&atilde;o aos cursos superiores fazia com que muitos egressos de cursos t&eacute;cnicos enfrentavam dificuldades para ter seus conhecimentos e habilidades validados nas institui&ccedil;&otilde;es de ensino superior, o que restringia seu acesso a essas institui&ccedil;&otilde;es.</p>


<p class="paragrafo">Outras medidas de car&aacute;ter or&ccedil;ament&aacute;rio e organizativo, em particular a <a rel="noopener" href="http://portal.mec.gov.br/setec/arquivos/pdf/PMEC646_97.pdf" target="_blank">Portaria n&ordm; 646/97 do MEC</a>, levaram &agrave; queda vertiginosa dos cursos de Educa&ccedil;&atilde;o Profissional integrados ao Ensino M&eacute;dio na rede federal, sendo privilegiados os cursos subsequentes ao Ensino M&eacute;dio (ou p&oacute;s-m&eacute;dios). Quanto &agrave;s redes estaduais, o acesso a recursos do Programa de Expans&atilde;o da Educa&ccedil;&atilde;o Profissional (PROEP), parceria entre MEC, MTE e Banco Interamericano de Desenvolvimento (BID), exigia a publiciza&ccedil;&atilde;o das redes &ndash; que seriam geridas por organiza&ccedil;&otilde;es sociais, com recursos p&uacute;blicos &ndash; para a oferta exclusiva de cursos t&eacute;cnicos subsequentes e de m&oacute;dulos de qualifica&ccedil;&atilde;o profissional. O objetivo de tais ofertas era <strong>restringir o acesso ao ensino superior</strong>, diminuindo a press&atilde;o social pela expans&atilde;o dos cursos de gradua&ccedil;&atilde;o nas universidades p&uacute;blicas, ao tempo em que se formava m&atilde;o-de-obra qualificada para as demandas do mercado de trabalho.</p>


<p class="paragrafo">Ao mesmo tempo, o Plano Nacional de Qualifica&ccedil;&atilde;o do Trabalhador (PLANFOR), gerido pelo MTE com recursos do Fundo de Amparo ao Trabalhador (FAT), com or&ccedil;amento de cerca de R$1 bilh&atilde;o ao ano, ofertava milhares de cursos cuja m&eacute;dia de carga hor&aacute;ria oscilava entre 40 e 120 horas no per&iacute;odo de 1998 a 2002, o que era insuficiente para garantir uma forma&ccedil;&atilde;o adequada aos trabalhadores desempregados e o p&uacute;blico em geral.</p>


<div id="recursos-azul" class="feat-box-foto">
<div class="title caixa-de-destaque-titulo">

<p class="paragrafo">O fracasso retumbante dessas pol&iacute;ticas levou os movimentos sociais, em particular o sindical e o de trabalhadores rurais, a constru&iacute;rem <strong>experi&ecirc;ncias aut&ocirc;nomas de educa&ccedil;&atilde;o integral e integrada</strong>, articulando a Educa&ccedil;&atilde;o de Jovens e Adultos (EJA) com a Educa&ccedil;&atilde;o Profissional em todo o pa&iacute;s. De car&aacute;ter setorial (metal&uacute;rgicos, qu&iacute;micos, rurais etc.) ou regional, essas experi&ecirc;ncias mantiveram viva a perspectiva emancipat&oacute;ria e inspiraram as pol&iacute;ticas p&uacute;blicas do per&iacute;odo posterior.</p>

</div>
</div>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_29.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_32.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 23 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>