<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Campo social e hegemonia</strong></p>

<p><span style="font-weight: 400;">O soci&oacute;logo franc&ecirc;s Pierre Bourdieu elaborou a </span><strong>Teoria do Campo Social</strong><span style="font-weight: 400;"> a partir da an&aacute;lise de pesquisas emp&iacute;ricas, a fim de </span><span style="font-weight: 400; background-color: #bfedd2;">compreender os sentidos das a&ccedil;&otilde;es humanas dos diferentes sujeitos sociais e das rela&ccedil;&otilde;es de tais a&ccedil;&otilde;es entre si</span><span style="font-weight: 400;">. A perspectiva de an&aacute;lise dessa teoria &eacute; fecunda para compreender, intervir</span><span style="font-weight: 400;"> e, em particular, revelar aos agentes sociais n&atilde;o hegem&ocirc;nicos o que est&aacute; implicado nas defini&ccedil;&otilde;es das pol&iacute;ticas p&uacute;blicas relativas &agrave;quele campo espec&iacute;fico.</span></p>
<p><span style="font-weight: 400;">Os diversos espa&ccedil;os sociais n&atilde;o s&atilde;o id&ecirc;nticos e aqueles que se tornam aut&ocirc;nomos s&atilde;o chamados de campos: jur&iacute;dico, cient&iacute;fico, art&iacute;stico etc. Em cada um deles, observam-se regras gerais (v&aacute;lidas para todos os campos) e espec&iacute;ficas, que facilitam ou dificultam a ascens&atilde;o e/ou a perman&ecirc;ncia de determinados grupos no controle do campo. Assim, esse processo faz com que se construa um </span><strong>espa&ccedil;o social em permanente conflito</strong><span style="font-weight: 400;">, onde a cada momento h&aacute; tens&otilde;es e negocia&ccedil;&otilde;es; enquanto as a&ccedil;&otilde;es se modificam, alian&ccedil;as se formam e se desfazem. Entretanto, isso n&atilde;o &eacute; aleat&oacute;rio: a grande maioria dos agentes sociais seguem regras (que podem estar escritas ou n&atilde;o), ou seja, &ldquo;jogam o jogo&rdquo;.</span></p>
<p><span style="font-weight: 400;">Podemos fazer uma analogia com o futebol. Mesmo uma crian&ccedil;a pequena sabe qual o objetivo do jogo (fazer gols), quem atua (os jogadores) e algumas regras b&aacute;sicas (n&atilde;o pegar as bolas com as m&atilde;os, n&atilde;o bater no advers&aacute;rio, entre outras). Se forem perguntadas: &ldquo;mais algu&eacute;m participa do jogo?&rdquo;, algumas poucas crian&ccedil;as podem citar o juiz, mas fica por a&iacute;. Um n&uacute;mero maior pode citar a posi&ccedil;&atilde;o dos jogadores (centroavante, meio-campo, goleiro etc.).&nbsp;</span></p>

<p><img class="card-curso-topo-image" src="medias/PP.5_ILU_1.png" alt="Campo social" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: <span style="font-weight: 400;">C</span></strong>ampo social<br /><strong>Fonte: <span style="font-weight: 400;">Prosa (2025b).</span></strong></p>

<p><span style="font-weight: 400;">Entretanto, o futebol &eacute; mais complexo que isso e o jogo acontece dentro e fora do campo. No gramado, al&eacute;m das diferen&ccedil;as salariais entre os times (e dentro do pr&oacute;prio time), existem jogadores com pap&eacute;is e status diferentes, existem os reservas, o treinador e a sua equipe. Tamb&eacute;m existem os trabalhadores desempenhando muitos outros pap&eacute;is: gandulas, bandeirinhas, seguran&ccedil;as, equipe m&eacute;dica, bilheteria, limpeza, cinegrafistas, fot&oacute;grafos, jornalistas, entre tantos outros profissionais. E, &eacute; claro, espectadores, pagantes ou n&atilde;o, torcedores individuais ou organizados.&nbsp;</span></p>
<p><span style="font-weight: 400;">Fora do gramado, um grande mercado se conecta com o jogo: passes, apostas, propagandas, direitos de transmiss&atilde;o, produ&ccedil;&atilde;o e venda de camisas, </span><em><span style="font-weight: 400;">souvenirs</span></em><span style="font-weight: 400;"> etc. Ali&aacute;s, os trabalhadores prec&aacute;rios, como motoristas de aplicativo e vendedores de &aacute;gua, de churrasquinho, de camisas e de bonecos n&atilde;o autorizados, tamb&eacute;m constituem presen&ccedil;a forte nesses eventos esportivos. Desse modo, tudo isso &eacute; controlado, em primeira inst&acirc;ncia, pelos donos dos times ou seus representantes, com forte participa&ccedil;&atilde;o dos grandes meios de comunica&ccedil;&atilde;o. </span><strong>Cada sujeito social, individual ou coletivo, possui capital e o utiliza para interagir nessa din&acirc;mica</strong><span style="font-weight: 400;">. O mais &oacute;bvio de todos &eacute; o econ&ocirc;mico: comprar ingressos, passes de jogadores, times e at&eacute; o juiz!</span></p>
<p><span style="font-weight: 400;">Bourdieu identificou que o capital se apresenta de diversas formas e que sua distin&ccedil;&atilde;o &eacute; fundamental para entender as rela&ccedil;&otilde;es sociais e de poder:</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><strong>Capital econ&ocirc;mico:</strong><span style="font-weight: 400;">&nbsp;refere-se aos recursos materiais, como renda e propriedades, que podem ser utilizados para obter vantagens sociais.<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>Capital cultural</strong><span style="font-weight: 400;">: compreende o conhecimento e as habilidades adquiridos e valorizados socialmente, incluindo diplomas e educa&ccedil;&atilde;o formal. No caso do futebol, as habilidades dos jogadores fazerem gols, boas defesas, desarmes e dribles s&atilde;o exemplos de capital cultural.<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>Capital social</strong><span style="font-weight: 400;">: relaciona-se &agrave;s redes de rela&ccedil;&otilde;es sociais que um indiv&iacute;duo possui, permitindo o acesso a recursos e oportunidades, como empregos e prest&iacute;gio. No futebol, a habilidade do jogador e a sua rela&ccedil;&atilde;o com os treinadores e dirigentes cria oportunidades dentro e fora do campo, por meio de patroc&iacute;nios e propagandas.<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>Capital simb&oacute;lico</strong><span style="font-weight: 400;">: refere-se ao prest&iacute;gio, &agrave; honra e ao status que um indiv&iacute;duo ou grupo pode ter na sociedade, influenciando a forma como &eacute; tratado socialmente. Determinados jogadores s&atilde;o verdadeiras celebridades, com f&atilde;-clubes e seguidores nas redes sociais, enquanto a maioria passa despercebida.</span></li>
</ul>
<p><span style="font-weight: 400;">Essas formas de capital interagem entre si e s&atilde;o essenciais para a an&aacute;lise das desigualdades sociais e das din&acirc;micas de domina&ccedil;&atilde;o em diferentes contextos. </span><span style="font-weight: 400; background-color: #bfedd2;">A acumula&ccedil;&atilde;o e a converg&ecirc;ncia entre esses capitais desempenham um papel crucial na manuten&ccedil;&atilde;o das hierarquias sociais.</span></p>
<p><span style="font-weight: 400;">Entre os agentes citados, podemos distinguir os protagonistas, os</span><em><span style="font-weight: 400;"> </span></em><span style="font-weight: 400;">coadjuvantes</span><em><span style="font-weight: 400;"> </span></em><span style="font-weight: 400;">e</span><em><span style="font-weight: 400;"> </span></em><span style="font-weight: 400;">os</span><em><span style="font-weight: 400;"> </span></em><span style="font-weight: 400;">figurantes. Cada um tem uma quantidade de capital diferente, ou seja, s&atilde;o mais ou menos influentes. No caso de jogadores e times, quem faz mais gols, quem est&aacute; melhor posicionado no campeonato, quem atrai mais p&uacute;blico caracteriza-se como o protagonista do time.&nbsp;</span></p>
<p><span style="font-weight: 400;">Tamb&eacute;m pode ser observado que quem controla o jogo estabelece regras e atua no sentido de manter o jogo como ele &eacute;, s&oacute; mudando quando for favor&aacute;vel para si. Estes grupos com tal poder, constituem o </span><strong>polo hegem&ocirc;nico do campo</strong><span style="font-weight: 400;">. O outro polo, o </span><strong>n&atilde;o hegem&ocirc;nico</strong><span style="font-weight: 400;">, pode ter grupos passivos &ndash; que aceitam a situa&ccedil;&atilde;o como est&aacute; &ndash; ou ativos &ndash; que questionam e/ou transgridem as regras e, com isso, tornam-se </span><strong>contra-hegem&ocirc;nicos</strong><span style="font-weight: 400;">. Cada grupo tem uma ideia de como o campo funciona, a maioria de forma parcial. Logo, quanto mais poder um grupo possui, mais conhecimento ele det&eacute;m sobre as regras do campo e a forma de control&aacute;-las. Isso pode ser usado para de modo a gerar viol&ecirc;ncias simb&oacute;licas, que podem caracterizar-se, por exemplo, pelo racismo, pela misoginia e pela LGBTfobia, refor&ccedil;ando cren&ccedil;as de que o futebol s&oacute; pode ser praticado ou apreciado por homens brancos heterossexuais.</span></p>

<p><img class="card-curso-topo-image" src="medias/PP.5_GIF_2.gif" alt="Polos do campo social" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Polos do campo social<strong><br />Fonte: </strong>Prosa (2025c).</p>

<p><span style="font-weight: 400;">Para complicar mais ainda, agentes semelhantes podem ter uma atua&ccedil;&atilde;o diversa na defesa dos seus interesses pessoais. &Eacute; o caso dos jogadores, os quais tornam-se suporte do polo hegem&ocirc;nico e se beneficiam disso com seus altos sal&aacute;rios (e depois tornam-se eles mesmos os empres&aacute;rios) e os que se posicionam, como o saudoso jogador brasileiro <span class="modal-button button" data-toggle="modal" data-target="#modal-1">S&oacute;crates</span></span><span style="font-weight: 400;">&nbsp;e tantos outros, pela democratiza&ccedil;&atilde;o do futebol.&nbsp;</span></p>

<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">S&oacute;crates e sua influ&ecirc;ncia na democratiza&ccedil;&atilde;o do futebol</h5>
</div>
<div class="modal-body nota">S&oacute;crates (1954-2011), paraense, foi um dos maiores jogadores da hist&oacute;ria do futebol brasileiro. Al&eacute;m do seu talento em campo, durante os anos 80, &eacute;poca de regime militar no Brasil, ele liderou a cria&ccedil;&atilde;o da Democracia Corintiana, um movimento que buscava uma gest&atilde;o coletiva do clube Corinthians, time pelo qual jogava. Nessa democracia, os jogadores possu&iacute;am voz ativa nas decis&otilde;es do time, como contrata&ccedil;&otilde;es, sal&aacute;rios e estrat&eacute;gias de jogo, indo contra o autoritarismo dos dirigentes e a favor da autonomia dos jogadores. Assim, o movimento protagonizado por S&oacute;crates foi essencial para a democratiza&ccedil;&atilde;o do futebol, de forma que ele marcou a hist&oacute;ria desse esporte no Brasil n&atilde;o apenas com sua habilidade mas tamb&eacute;m com a sua luta.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><span style="font-weight: 400;"><!-- Fim nota modal --></span></p>

<p><span style="font-weight: 400;">Em resumo, as regras gerais dos campos sociais s&atilde;o:</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">&nbsp;</span><strong>A autonomia de um campo &eacute; relativa</strong>,<strong> </strong><span style="font-weight: 400;">ele est&aacute; sempre conectado a outros campos e &agrave; luta geral na sociedade. Um exemplo &eacute; a ascens&atilde;o recente do futebol feminino, que &eacute; reflexo da luta das mulheres pelo seu reconhecimento e emancipa&ccedil;&atilde;o.<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;"><strong>Os agentes sociais, para estarem no campo, consentem</strong> <strong>(consciente ou inconscientemente)</strong> <strong>com suas regras</strong>, tendo suas a&ccedil;&otilde;es&nbsp;determinadas&nbsp;por elas. Entretanto, tal </span>determina&ccedil;&atilde;o<span style="font-weight: 400;">&nbsp;n&atilde;o &eacute; absoluta, h&aacute; possibilidade de super&aacute;-las, jogando </span><em><span style="font-weight: 400;">com</span></em><span style="font-weight: 400;">&nbsp;e </span><em><span style="font-weight: 400;">contra</span></em><span style="font-weight: 400;"> as regras, simultaneamente.<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>As diferentes formas de capital podem ser convertidas</strong><span style="font-weight: 400;"><strong>&nbsp;entre si</strong>, por meio de </span>media&ccedil;&otilde;es<span style="font-weight: 400;">. Por exemplo, uma pessoa dominante pode adquirir status e construir rela&ccedil;&otilde;es (capital social) ou t&iacute;tulos e obras de arte (capital cultural) utilizando recursos financeiros (capital econ&ocirc;mico). J&aacute; os subalternos adquirem, por esfor&ccedil;o pr&oacute;prio, da fam&iacute;lia e dos educadores, capital social e cultural principalmente na comunidade, na escola e em outros espa&ccedil;os p&uacute;blicos.<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>O uso sistem&aacute;tico da viol&ecirc;ncia simb&oacute;lica</strong><span style="font-weight: 400;">, forma de domina&ccedil;&atilde;o que n&atilde;o se manifesta fisicamente, mas atrav&eacute;s da imposi&ccedil;&atilde;o de s&iacute;mbolos, normas e significados,<strong> &eacute; exercido por meio da linguagem e de representa&ccedil;&otilde;es culturais</strong>, beneficiando aqueles que a praticam, enquanto prejudica grupos subalternos. Essa viol&ecirc;ncia &eacute; uma for&ccedil;a sutil e invis&iacute;vel nas rela&ccedil;&otilde;es sociais e culturais, onde normas e valores da classe dominante s&atilde;o apresentados como padr&otilde;es universais, que cria hierarquias e marginaliza identidades e pr&aacute;ticas que n&atilde;o se alinham a esses padr&otilde;es. A imposi&ccedil;&atilde;o ocorre frequentemente por meio de processos de socializa&ccedil;&atilde;o, educa&ccedil;&atilde;o e m&iacute;dia, levando as pessoas a internalizarem essas normas sem questionar.</span></li>
</ul>
<p><span style="font-weight: 400;">Voc&ecirc; deve estar se perguntando: o que isso tem a ver com a EPT? Bem, se voc&ecirc; n&atilde;o quer ser um mero figurante, cujas a&ccedil;&otilde;es s&atilde;o pr&eacute;-determinadas, e quer fazer a diferen&ccedil;a em prol das classes subalternas, &eacute; necess&aacute;rio compreender os interesses e as formas de a&ccedil;&atilde;o de cada agente. &Eacute; o que veremos nos itens seguintes deste cap&iacute;tulo.</span></p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_36.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_38.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 28 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>