<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->
<p class="content paragrafo quote citacao-curta strong"><strong>Emancipa&ccedil;&atilde;o e subalternidade</strong></p>


<p class="paragrafo">Uma das maneiras de aprofundar a an&aacute;lise de uma pol&iacute;tica, de um programa ou de um projeto, assim como de suas pr&aacute;ticas decorrentes, &eacute; apropriar-se dos conceitos que lhes embasam. Vamos come&ccedil;ar por dois relativamente pouco conhecidos, mas de fundamental import&acirc;ncia para distinguir as propostas de pol&iacute;ticas p&uacute;blicas: <em>emancipa&ccedil;&atilde;o</em> e <em>subalternidade</em>.&nbsp;</p>


<div id="recursos-azul" class="feat-box-foto">

<p>A <strong>emancipa&ccedil;&atilde;o</strong> diz respeito &agrave; liberdade e igualdade de direitos de indiv&iacute;duos e grupos sociais. Emancipar-se significa sair do subjugo, da opress&atilde;o, e tornar-se plenamente livre, ter voz e se fazer representar. J&aacute; a <strong>subalternidade</strong> refere-se &agrave; condi&ccedil;&atilde;o de indiv&iacute;duos ou grupos sociais oprimidos, marginalizados, sem voz ou representa&ccedil;&atilde;o nas estruturas de poder.</p>
<p><span style="background-color: #bfedd2;">Estes conceitos s&atilde;o essenciais para compreender as rela&ccedil;&otilde;es e lutas sociais nos diversos contextos hist&oacute;ricos e espaciais, que resultar&atilde;o em direitos e, por conseguinte, nas pol&iacute;ticas p&uacute;blicas que os garantem.</span></p>

</div>


<p class="paragrafo">A partir da <span class="primary-color"><strong>Revolu&ccedil;&atilde;o Francesa</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="A Revolu&ccedil;&atilde;o Francesa (1789-1799) foi uma revolu&ccedil;&atilde;o burguesa que tinha ideais de liberdade, igualdade e fraternidade."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>, a ideia de garantir, pol&iacute;tica e juridicamente, a liberdade e direitos individuais ganha for&ccedil;a, mas isso acontece de forma limitada e parcial: as classes trabalhadoras, as mulheres e as pessoas n&atilde;o europeias n&atilde;o estavam contidas nessa proposta de cidadania exclusiva para homens europeus detentores de riquezas. Aqui se torna fundamental a distin&ccedil;&atilde;o entre <strong>emancipa&ccedil;&atilde;o pol&iacute;tica</strong> e <strong>emancipa&ccedil;&atilde;o humana</strong>. <span style="background-color: #bfedd2;">A<span class="modal-button button" data-toggle="modal" data-target="#modal-1"> emancipa&ccedil;&atilde;o pol&iacute;tica </span>refere-se &agrave; liberdade do indiv&iacute;duo dentro do Estado, enquanto a <span class="modal-button button" data-toggle="modal" data-target="#modal-2">emancipa&ccedil;&atilde;o humana</span>&nbsp;envolve a supera&ccedil;&atilde;o das condi&ccedil;&otilde;es materiais que perpetuam a opress&atilde;o e a aliena&ccedil;&atilde;o.</span></p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Emancipa&ccedil;&atilde;o pol&iacute;tica</h5>
</div>
<div class="modal-body nota"><strong>1. Movimentos por direitos civis:</strong> a luta vitoriosa pelos direitos civis nos Estados Unidos, liderada por Martin Luther King Jr. e Malcom X, exemplifica a emancipa&ccedil;&atilde;o pol&iacute;tica. Este movimento buscou a igualdade de direitos para os afro-americanos, desafiando as leis discriminat&oacute;rias e promovendo a participa&ccedil;&atilde;o pol&iacute;tica.
<p>&nbsp;</p>
<strong>2. Elei&ccedil;&otilde;es democr&aacute;ticas:</strong> a realiza&ccedil;&atilde;o de elei&ccedil;&otilde;es livres e justas em pa&iacute;ses que anteriormente estavam sob regimes autorit&aacute;rios &eacute; um exemplo claro de emancipa&ccedil;&atilde;o pol&iacute;tica, como no caso da Luta pelas &ldquo;Diretas J&aacute;&rdquo; e a elei&ccedil;&atilde;o da Assembleia Constituinte no Brasil. Outro exemplo &eacute; a conquista do direito ao voto das mulheres.
<p>&nbsp;</p>
<strong>3. Participa&ccedil;&atilde;o cidad&atilde;:</strong> iniciativas que incentivam a participa&ccedil;&atilde;o ativa dos cidad&atilde;os em processos legislativos, como audi&ecirc;ncias p&uacute;blicas e conselhos comunit&aacute;rios, s&atilde;o pr&aacute;ticas que promovem a emancipa&ccedil;&atilde;o pol&iacute;tica ao permitir que as vozes da popula&ccedil;&atilde;o sejam ouvidas nas decis&otilde;es governamentais.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Emancipa&ccedil;&atilde;o humana</h5>
</div>
<div class="modal-body nota"><strong>1. Educa&ccedil;&atilde;o popular:</strong> a abordagem de Paulo Freire na educa&ccedil;&atilde;o, que visa conscientizar os alunos sobre suas realidades sociais e capacit&aacute;-los a transform&aacute;-las, tem como objetivo a emancipa&ccedil;&atilde;o humana. A "Pedagogia do Oprimido" enfatiza a import&acirc;ncia da educa&ccedil;&atilde;o como ferramenta para superar a opress&atilde;o e promover a autonomia.
<p>&nbsp;</p>
<strong>2. Cooperativas de trabalho:</strong> a forma&ccedil;&atilde;o de cooperativas onde os trabalhadores t&ecirc;m controle sobre os meios de produ&ccedil;&atilde;o e as decis&otilde;es empresariais. Essas cooperativas permitem que os indiv&iacute;duos se libertem das rela&ccedil;&otilde;es capitalistas tradicionais, promovendo uma economia mais justa e solid&aacute;ria.
<p>&nbsp;</p>
<strong>3. Movimentos sociais:</strong> grupos que lutam por justi&ccedil;a social, como movimentos feministas e/ou ambientalistas, buscam n&atilde;o apenas mudan&ccedil;as pol&iacute;ticas, mas tamb&eacute;m culturais que levam a uma transforma&ccedil;&atilde;o nas condi&ccedil;&otilde;es materiais que perpetuam a opress&atilde;o.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo">Os <strong>grupos subalternos</strong> s&atilde;o compostos pela classe trabalhadora (oper&aacute;rios, camponeses, trabalhadores do servi&ccedil;o privado e p&uacute;blico, povos origin&aacute;rios e tradicionais etc, ou seja, aqueles que vivem do seu pr&oacute;prio trabalho) e os demais exclu&iacute;dos (imigrantes, marginalizados, entre tantos outros) que sofrem a opress&atilde;o econ&ocirc;mica, social, pol&iacute;tica e cultural dos grupos dominantes. &Eacute; extremamente importante reconhecer que outras formas de opress&atilde;o perpassam os subalternos: de g&ecirc;nero, &eacute;tnico-racial, sobre as pessoas jovens, idosas, com defici&ecirc;ncia, LGBTQIAN+ e tantas outras. Em resumo, todas as classes, grupos, fra&ccedil;&otilde;es e segmentos que n&atilde;o podem produzir e usufruir livremente seu mundo material e espiritual est&atilde;o subordinados economicamente (direta ou indiretamente) e submetidos &agrave;s formas de submiss&atilde;o. Em outras palavras, s&atilde;o <strong>impedidos de exercer sua autonomia e de produzir sua pr&oacute;pria hist&oacute;ria.</strong></p>


<p class="paragrafo">Embora a hist&oacute;ria dos grupos subalternos seja fragmentada e epis&oacute;dica, com momentos de rebeli&atilde;o e de insurg&ecirc;ncia, seguidos ou antecedidos por acomoda&ccedil;&atilde;o e aceita&ccedil;&atilde;o da ordem vigente, a experi&ecirc;ncia da humanidade est&aacute; repleta de exemplos de como um projeto comum de sociedade pode ser forjado. <span style="background-color: #bfedd2;">A domina&ccedil;&atilde;o n&atilde;o &eacute; um processo isento de contradi&ccedil;&otilde;es e falhas, e em muitas vezes as brechas s&atilde;o aproveitadas para dar um passo adiante na mudan&ccedil;a social.</span></p>


<p class="paragrafo">Os subalternos, embora exclu&iacute;dos total ou parcialmente de direitos, est&atilde;o integrados ao sistema hegem&ocirc;nico, de forma passiva, produtos das rela&ccedil;&otilde;es que moldam o Estado moderno. A falta de consci&ecirc;ncia social e a dificuldade de reconhecerem sua pr&oacute;pria hist&oacute;ria, import&acirc;ncia e necessidade de emancipar-se faz com que a supera&ccedil;&atilde;o da subalternidade n&atilde;o ocorra como ato de vontade individual ou espont&acirc;nea.</p>


<p class="paragrafo">Isto n&atilde;o quer dizer que a responsabilidade pela passividade seja dos subalternos. <span style="background-color: #bfedd2;">Um escravo n&atilde;o pode ser culpado pela sua pr&oacute;pria escravid&atilde;o, mas a condi&ccedil;&atilde;o de escravo &eacute; t&atilde;o degradante que, por vezes, ele se esquece que a liberdade existe e que por ela vale lutar.</span> Nos tempos atuais, os subalternos tamb&eacute;m sofrem, de um lado, com a desesperan&ccedil;a (&ldquo;sempre foi assim&rdquo;, &ldquo;sempre haver&aacute; pobres&rdquo;), e, do outro, com as falsas promessas de emancipa&ccedil;&atilde;o econ&ocirc;mica (&rdquo;empreendedorismo&rdquo;, &ldquo;loterias&rdquo;); al&eacute;m disso, a ind&uacute;stria do entretenimento torna todos &ldquo;iguais&rdquo; quanto aos gostos culturais. Por esses motivos, a luta pela emancipa&ccedil;&atilde;o requer a&ccedil;&otilde;es espec&iacute;ficas e constantes no sentido de <strong>construir capacidades de autodire&ccedil;&atilde;o e autonomia</strong> destes grupos sociais subalternos, o que inclui suas vozes e experi&ecirc;ncias.</p>


<p class="paragrafo">A emancipa&ccedil;&atilde;o, entretanto, n&atilde;o se restringe &agrave; dimens&atilde;o econ&ocirc;mica, mas inclui necessariamente a <strong>educa&ccedil;&atilde;o</strong>&nbsp;e a <strong>cultura</strong>, pois estas s&atilde;o utilizadas como ferramentas para manter a subalternidade. Contudo, &eacute; poss&iacute;vel &ldquo;trocar o sinal&rdquo; e utilizar processos educacionais e culturais para promover a emancipa&ccedil;&atilde;o, ajudando os indiv&iacute;duos e grupos sociais a desenvolverem uma consci&ecirc;ncia cr&iacute;tica sobre sua posi&ccedil;&atilde;o na sociedade e a se organizarem e articularem estrat&eacute;gias em prol de seus interesses.</p>


<p class="paragrafo">Neste sentido os docentes e demais trabalhadores da educa&ccedil;&atilde;o podem tornar-se <em>intelectuais org&acirc;nicos</em>, pessoas oriundas das classes subalternas e que <span style="background-color: #bfedd2;">desempenham um papel crucial na <strong>forma&ccedil;&atilde;o da consci&ecirc;ncia</strong>, na <strong>supera&ccedil;&atilde;o da aliena&ccedil;&atilde;o</strong> e na <strong>luta pela emancipa&ccedil;&atilde;o</strong>.</span></p>
<p class="content paragrafo quote citacao-curta strong"><span style="font-size: 24pt;"><strong>Trabalho</strong></span></p>


<p class="paragrafo">Quando falamos de <strong>subordina&ccedil;&atilde;o econ&ocirc;mica</strong>, estamos nos referindo ao uso do trabalho coletivo e &agrave; apropria&ccedil;&atilde;o privada das riquezas que ele produz.</p>


<p><img class="card-curso-topo-image" src="medias/PP.1_MNT_2.png" alt="T&iacute;tulo: For&ccedil;a de trabalho Fonte: Sch&uuml;ler (2023). Elabora&ccedil;&atilde;o: Prosa (2024)." width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: <span style="font-weight: 400;">For&ccedil;a de trabalho</span></strong><br /><strong>Fonte: </strong>Sch&uuml;ler (2023d).<br /><strong>Elabora&ccedil;&atilde;o: </strong>Prosa (2024b).</p>


<p class="paragrafo">Mesmo aqueles que trabalham de forma familiar ou cooperativa que n&atilde;o s&atilde;o explorados na produ&ccedil;&atilde;o s&atilde;o explorados no processo de circula&ccedil;&atilde;o (transporte e comercializa&ccedil;&atilde;o) das<span class="modal-button button" data-toggle="modal" data-target="#modal-1">&nbsp;mercadorias</span>.</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Mercadoria</h5>
</div>
<div class="modal-body nota">A mercadoria, sendo produto do trabalho humano, possui tanto <strong>valor de uso</strong> (sua utilidade) quanto <strong>valor de troca</strong> (sua capacidade de ser trocada por outras mercadorias). O trabalho visto como mercadoria (da&iacute; a express&atilde;o &ldquo;mercado de trabalho&rdquo;) possui, ainda, um valor de troca, podendo ser permutado por outros bens e servi&ccedil;os no mercado. Al&eacute;m de ser considerado uma mercadoria, o trabalho tamb&eacute;m &eacute; a m&eacute;trica sobre a qual se baseia o valor de troca de todas as outras mercadorias, determinado pelo tempo de trabalho socialmente necess&aacute;rio para produzi-las.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo"><span style="background-color: #bfedd2;">As riquezas materiais e imateriais s&atilde;o fruto do trabalho humano.</span> Por meio dele &eacute; que os recursos naturais e culturais s&atilde;o transformados em produtos que satisfa&ccedil;am as necessidades ou desejos humanos, sejam eles naturais (imprescind&iacute;veis para a reprodu&ccedil;&atilde;o f&iacute;sica individual e da esp&eacute;cie) ou sociais, referentes &agrave; reprodu&ccedil;&atilde;o social e cultural que se desenvolvem historicamente. Deste modo, o valor do uso do trabalho humano vai al&eacute;m de sua fun&ccedil;&atilde;o econ&ocirc;mica, envolve a produ&ccedil;&atilde;o de rela&ccedil;&otilde;es sociais e culturais; ou seja, constitui uma vasta e complexa teia de rela&ccedil;&otilde;es, que denominamos <strong>&ldquo;mundo do trabalho&rdquo;</strong>.</p>


<p class="paragrafo">O valor de troca do trabalho humano &eacute; representado pelo <strong>sal&aacute;rio</strong>, que &eacute; o pre&ccedil;o pago pela for&ccedil;a de trabalho, mas o sal&aacute;rio n&atilde;o exprime a totalidade do valor do trabalho produzido. O custo (valor pago) da for&ccedil;a de trabalho &eacute; sempre <strong>menor</strong>&nbsp;que o valor que ela produziu, enquanto a parte excedente &ndash; na maioria das vezes, muito maior que o sal&aacute;rio &ndash; &eacute; apropriada por quem adquiriu a mercadoria de trabalho.</p>


<p><img class="card-curso-topo-image" src="medias/PP.1_MNT_3.png" alt="T&iacute;tulo:&nbsp;For&ccedil;a de trabalho  Fonte:&nbsp;Prosa (2024)." width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Mais-valia<strong><br />Fonte: </strong>Avelludo (2024) e Mcol (2007).<strong><br />Elabora&ccedil;&atilde;o: </strong>Prosa (2024c).</p>


<p class="paragrafo">Os valores de uso e de troca do trabalho v&atilde;o se modificando pelas condi&ccedil;&otilde;es sociais e hist&oacute;ricas em que o trabalho &eacute; realizado, sendo constru&ccedil;&otilde;es sociais que constituem a base da economia. Por&eacute;m, o <span style="background-color: #bfedd2;">trabalho tamb&eacute;m gera rela&ccedil;&otilde;es sociais, conhecimento e cultura</span>, e estas, por sua vez, geram os processos organizativos e a valoriza&ccedil;&atilde;o social do trabalho em si, que podem estar submetidos &agrave; discrimina&ccedil;&atilde;o social, de g&ecirc;nero, &eacute;tnico-racial, et&aacute;ria, entre outras, no &acirc;mbito laboral. Esse processo acarreta na redu&ccedil;&atilde;o do valor de troca do trabalho, ainda que o valor de uso permane&ccedil;a o mesmo.</p>


<p><span style="font-size: 18pt;"><strong>For&ccedil;a de Trabalho</strong></span></p>


<p class="paragrafo">A <strong>potencialidade dos trabalhadores</strong> de produzir riquezas &eacute; denominada <em>capacidade</em>, a qual engloba as habilidades humanas e, em um sentido mais amplo, a consci&ecirc;ncia e a faculdade dos trabalhadores de se organizarem e lutarem por seus direitos. Deste modo, n&atilde;o se resume ao uso das habilidades t&eacute;cnicas, mas tamb&eacute;m abrange a cr&iacute;tica das condi&ccedil;&otilde;es sociais e pol&iacute;ticas que afetam a classe trabalhadora.</p>


<p class="paragrafo">A <em>habilidade</em>&nbsp;&eacute; vista como a <strong>capacidade espec&iacute;fica</strong> de um trabalhador para realizar tarefas. Ao buscar aumentar ao m&aacute;ximo a efici&ecirc;ncia e a produtividade, as classes dominantes introduzem inova&ccedil;&otilde;es tecnol&oacute;gicas (tamb&eacute;m fruto do trabalho humano), levando as habilidades dos trabalhadores a serem cada vez mais especializadas e, com isto, ocorrendo a aliena&ccedil;&atilde;o do produtor em rela&ccedil;&atilde;o ao produto final. Entretanto, a habilidade tamb&eacute;m &eacute; ligada &agrave; educa&ccedil;&atilde;o e &agrave; forma&ccedil;&atilde;o cultural dos trabalhadores, sejam elas formais ou informais. A educa&ccedil;&atilde;o, nesta perspectiva, &eacute; essencial para o desenvolvimento de habilidades tanto para executar tarefas, como para compreender a opress&atilde;o e articular estrat&eacute;gias de emancipa&ccedil;&atilde;o.</p>


<p class="paragrafo">A <em>t&eacute;cnica </em>est&aacute; relacionada ao uso de <strong>ferramentas </strong>e <strong>m&eacute;todos</strong> na produ&ccedil;&atilde;o, e &eacute; uma extens&atilde;o da for&ccedil;a de trabalho. Entretanto, as inova&ccedil;&otilde;es tecnol&oacute;gicas modificam as rela&ccedil;&otilde;es e as condi&ccedil;&otilde;es de trabalho, uma vez que <span style="background-color: #bfedd2;">a t&eacute;cnica <strong>n&atilde;o &eacute; neutra</strong>&nbsp;e interfere diretamente na capacidade e na habilidade dos trabalhadores.</span> Em outras palavras, a t&eacute;cnica n&atilde;o &eacute; apenas instrumento, &eacute; tamb&eacute;m espa&ccedil;o de luta, pois as formas como s&atilde;o aplicadas e disseminadas podem refor&ccedil;ar ou questionar a domina&ccedil;&atilde;o, diminuir ou aumentar a autonomia.</p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.1_INF_4.png" alt="T&iacute;tulo:&nbsp;Elementos do trabalho  Fonte: &nbsp;Sch&uuml;ler (2023).  Elabora&ccedil;&atilde;o:&nbsp;&nbsp;Prosa (2024)." width="95%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Elementos do trabalho<strong><br />Fonte: </strong>Sch&uuml;ler (2023e).<strong><br />Elabora&ccedil;&atilde;o: </strong>Prosa (2024d).</p>


<p class="paragrafo">H&aacute; fortes evid&ecirc;ncias de que a t&eacute;cnica, por si s&oacute;, n&atilde;o &eacute; suficiente para aumentar o controle e a produtividade no ambiente de trabalho. A escolha tecnol&oacute;gica deve ser complementada por uma organiza&ccedil;&atilde;o do trabalho que leve em considera&ccedil;&atilde;o os fatores sociais, culturais e pol&iacute;ticos. A rela&ccedil;&atilde;o entre capital e trabalho, assim como a capacidade dos trabalhadores de introduzir novas tecnologias, s&atilde;o imprescind&iacute;veis para garantir seu controle sobre o processo de trabalho.</p>


<p class="paragrafo">O trabalho possui um car&aacute;ter epistemol&oacute;gico fundamental, na medida em que, <span style="background-color: #bfedd2;">por meio dele, as pessoas produzem conhecimento sobre o mundo e sobre si mesmos.</span>&nbsp;O trabalho, como mencionado anteriormente, &eacute; uma atividade pr&aacute;tica que implica a intera&ccedil;&atilde;o direta com a realidade material e social. Ao executar tarefas, solucionar problemas e lidar com situa&ccedil;&otilde;es concretas, os trabalhadores desenvolvem uma compreens&atilde;o emp&iacute;rica do mundo, adquirindo conhecimentos t&aacute;citos e habilidades pr&aacute;ticas.</p>


<p class="paragrafo">No local de trabalho (&ldquo;ch&atilde;o de f&aacute;brica&rdquo;, &ldquo;ch&atilde;o de escola&rdquo; etc.), por meio da observa&ccedil;&atilde;o, da experimenta&ccedil;&atilde;o e da troca de conhecimentos com os demais trabalhadores (mais experientes ou n&atilde;o), o aprendizado das t&eacute;cnicas, dos valores, das rela&ccedil;&otilde;es e da cultura de trabalho &eacute; cont&iacute;nuo, com constru&ccedil;&atilde;o e reconstru&ccedil;&atilde;o de saberes.</p>


<div id="recursos-azul" class="feat-box-foto">

<p>O trabalho expressa a rela&ccedil;&atilde;o dial&eacute;tica entre teoria e pr&aacute;tica, com a pr&aacute;tica exigindo a mobiliza&ccedil;&atilde;o de conhecimentos te&oacute;ricos e, simultaneamente, retroalimentando e transformando a teoria. Neste processo, ocorre a <strong>produ&ccedil;&atilde;o de conhecimento</strong>.</p>
</div>


<p class="paragrafo">Em uma perspectiva cr&iacute;tica, pode-se falar que os modos de conhecer, propiciados pelo trabalho, contrap&otilde;em-se &agrave;s formas hegem&ocirc;nicas de produ&ccedil;&atilde;o e apropria&ccedil;&atilde;o dos conhecimentos e dos saberes. Em outras palavras, s&atilde;o <strong>epistemologias dissidentes</strong>, contestadoras e com forte influ&ecirc;ncia na forma&ccedil;&atilde;o de identidades e unidade na a&ccedil;&atilde;o. A estas formas, somam-se as experi&ecirc;ncias formais de educa&ccedil;&atilde;o, a transmiss&atilde;o de saberes ancestrais e o conhecimento codificado (manuais, s&iacute;mbolos etc.), obtidos das mais diversas formas e em momentos diversos na vida do trabalhador.</p>

<div class="nav-pagination">
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_2.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_5.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 3 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>