<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Avan&ccedil;os progressistas</strong></p>


<p class="paragrafo">Em 2002, em um contexto marcado por profundas tens&otilde;es pol&iacute;ticas e sociais no Brasil, por uma profunda crise econ&ocirc;mica e com uma desigualdade crescente, o programa de retomar pol&iacute;ticas sociais que priorizassem a inclus&atilde;o, a justi&ccedil;a social, a defesa dos direitos dos trabalhadores, a educa&ccedil;&atilde;o e a sa&uacute;de, al&eacute;m do combate &agrave; fome e &agrave; pobreza, ganhou for&ccedil;a.</p>


<p class="paragrafo">Impulsionado por uma forte mobiliza&ccedil;&atilde;o popular, o novo governo vitorioso nas urnas tem como pol&iacute;ticas priorit&aacute;rias&nbsp;o <strong>fortalecimento da concep&ccedil;&atilde;o emancipat&oacute;ria na educa&ccedil;&atilde;o em geral e na Educa&ccedil;&atilde;o Profissional</strong>. Observa-se, no infogr&aacute;fico abaixo, algumas das iniciativas mais relevantes na educa&ccedil;&atilde;o em geral.</p>


<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.4_INF_3.png" alt="card do curso" width="90%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Principais avan&ccedil;os na educa&ccedil;&atilde;o<br /><strong>Fonte:&nbsp;</strong>Prosa (2025c).</p>


<p class="paragrafo">Medidas foram tomadas com o objetivo de tornar a educa&ccedil;&atilde;o profissional brasileira <strong>mais integral, mais p&uacute;blica e mais acess&iacute;vel</strong> aos diversos setores da popula&ccedil;&atilde;o trabalhadora e seus filhos. As principais medidas envolvendo o MEC e o MTE s&atilde;o:</p>


<ol style="list-style-type: lower-alpha;">
<li class="paragrafo"><strong>Rela&ccedil;&otilde;es de parceria</strong>: o reestabelecimento das rela&ccedil;&otilde;es de parceria e complementaridade entre os dois minist&eacute;rios, alinhando as concep&ccedil;&otilde;es e &nbsp;estabelecendo a complementaridade das a&ccedil;&otilde;es.</li>
<li class="paragrafo"><strong>Cursos integrados:</strong> o retorno da possibilidade de cursos integrados (Educa&ccedil;&atilde;o B&aacute;sica e Profissional), garantindo simultaneamente a terminalidade e o prosseguimento dos estudos, com a revoga&ccedil;&atilde;o do <a rel="noopener" href="http://portal.mec.gov.br/setec/arquivos/pdf/DF2208_97.pdf" target="_blank">decreto n&ordm; 2.208/97</a> e sua substitui&ccedil;&atilde;o pelo <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2004-2006/2004/Decreto/D5154.htm" target="_blank">decreto n&ordm; 5.154/2004</a>.</li>
<li class="paragrafo"><strong>PROEJA: </strong>a cria&ccedil;&atilde;o do Programa de Integra&ccedil;&atilde;o da Educa&ccedil;&atilde;o Profissional &agrave; Educa&ccedil;&atilde;o B&aacute;sica na modalidade de Educa&ccedil;&atilde;o de Jovens e Adultos &nbsp;(PROEJA) &ndash; <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2004-2006/2005/Decreto/D5478.htm#:~:text=DECRETO%20N%C2%BA%205.478%2C%20DE%2024%20DE%20JUNHO%20DE,de%20Educa%C3%A7%C3%A3o%20de%20Jovens%20e%20Adultos%20-%20PROEJA." target="_blank">Decreto n&ordm; 5.478/2005</a>, e posteriormente o <a rel="noopener" href="http://portal.mec.gov.br/setec/arquivos/pdf_legislacao/tecnico/legisla_tecnico_dec5840.pdf#:~:text=DECRETO%20No%205.840%2C%20DE%2013%20DE%20JULHO%20DE,e%20Adultos%20-%20PROEJA%2C%20e%20d%C3%A1%20outras%20provid%C3%AAncias." target="_blank">Decreto n&ordm; 5.840/2006</a> &ndash;, que estabeleceu a meta de 10% das matr&iacute;culas nas institui&ccedil;&otilde;es federais para esta modalidade. Essa mudan&ccedil;a permitiu que a popula&ccedil;&atilde;o exclu&iacute;da da escola retornasse para obter certifica&ccedil;&atilde;o escolar juntamente com o diploma de curso t&eacute;cnico ou certificado de qualifica&ccedil;&atilde;o profissional.</li>
<li class="paragrafo"><strong>Rede federal:</strong> a revoga&ccedil;&atilde;o da proibi&ccedil;&atilde;o de cria&ccedil;&atilde;o de novas unidades da rede federal de Educa&ccedil;&atilde;o Profissional que estava em vigor desde 1994, por meio da <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2004-2006/2005/Lei/L11195.htm" target="_blank">Lei n&ordm; 11.195/2005</a>.</li>
<li class="paragrafo"><strong>Extin&ccedil;&atilde;o do PROEP:</strong> a n&atilde;o renova&ccedil;&atilde;o do Programa de Expans&atilde;o da Educa&ccedil;&atilde;o Profissional (PROEP), criado em 1997, sendo substitu&iacute;do pelos Programas de Expans&atilde;o da Rede Federal e Brasil Profissionalizado (expans&atilde;o das redes estaduais), lan&ccedil;ados em 2005 e 2007, respectivamente, e financiados com recursos p&uacute;blicos.</li>
<li class="paragrafo"><strong>Cursos t&eacute;cnicos integrados:</strong> o estabelecimento de metas para a oferta de cursos t&eacute;cnicos integrados ao Ensino M&eacute;dio tanto pela rede federal em expans&atilde;o quanto pelas redes estaduais. Essa medida ocorre como contrapartida &agrave; assist&ecirc;ncia financeira e t&eacute;cnica para implanta&ccedil;&atilde;o das escolas e centros de Educa&ccedil;&atilde;o Profissional.&nbsp;</li>
<li class="paragrafo"><strong>Plano Nacional de Qualifica&ccedil;&atilde;o (PNQ):</strong> a substitui&ccedil;&atilde;o do PLANFOR/MTE pelo PNQ, em 2003, com carga hor&aacute;ria m&eacute;dia dos cursos aumentada para 200 horas. A partir disso, houve o realinhamento de objetivos, recursos e parcerias com as a&ccedil;&otilde;es governamentais, priorizando mulheres, negros e ind&iacute;genas. Al&eacute;m da obrigatoriedade da introdu&ccedil;&atilde;o de conhecimentos sobre o mundo do trabalho, tornando a qualifica&ccedil;&atilde;o "social e profissional", o PNQ tamb&eacute;m institucionalizou a negocia&ccedil;&atilde;o coletiva da qualifica&ccedil;&atilde;o por meio de planos setoriais de qualifica&ccedil;&atilde;o.</li>
<li class="paragrafo"><strong>Aprendizagem: </strong>a retomada dos cursos de aprendizagem, a&ccedil;&atilde;o gratuita e obrigat&oacute;ria do Sistema S, com acompanhamento e fortalecimento da fiscaliza&ccedil;&atilde;o do MTE, al&eacute;m da reformula&ccedil;&atilde;o legislativa (<a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2004-2006/2005/Lei/L11180.htm" target="_blank">Lei n&ordm; 11.180/2005</a> e <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2004-2006/2005/Decreto/D5598.htm" target="_blank">Decreto n&ordm; 5.598/2005</a>) que ampliou a idade m&aacute;xima para 24 anos e adotou arcos ocupacionais que ampliaram as oportunidades dos aprendizes.</li>
<li class="paragrafo"><strong>Est&aacute;gio</strong><strong>:</strong> a constitui&ccedil;&atilde;o do Grupo Interministerial sobre Est&aacute;gio (2003/2004), cujos estudos fundamentaram a reformula&ccedil;&atilde;o da legisla&ccedil;&atilde;o (<a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2007-2010/2008/Lei/L11788.htm" target="_blank">Lei n&ordm; 11.788/2008</a>), definiu o est&aacute;gio como um ato educativo com salvaguardas contra sua utiliza&ccedil;&atilde;o como trabalho prec&aacute;rio.</li>
<li class="paragrafo"><strong>Certifica&ccedil;&atilde;o profissional: </strong>a constitui&ccedil;&atilde;o do Grupo Interministerial sobre Certifica&ccedil;&atilde;o Profissional (2004-2007), que embasou a proposta do Sistema Nacional de Certifica&ccedil;&atilde;o (n&atilde;o implantado) e inspirou a Rede Certifica da Rede Federal (2009), visando o reconhecimento social dos saberes dos trabalhadores em um vi&eacute;s inclusivo.</li>
<li class="paragrafo"><strong>ProJovem: </strong>a institui&ccedil;&atilde;o do Programa Nacional de Inclus&atilde;o de Jovens (ProJovem) no &acirc;mbito da Pol&iacute;tica P&uacute;blica da Juventude, pela <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2004-2006/2005/Lei/L11129.htm#:~:text=Institui%20o%20Programa%20Nacional%20de%20Inclus%C3%A3o%20de%20Jovens,de%20abril%20de%202002%3B%20e%20d%C3%A1%20outras%20provid%C3%AAncias." target="_blank">Lei n&ordm; 11.129/2005</a> e o <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2004-2006/2005/Decreto/D5557.htm" target="_blank">Decreto n&ordm; 5.557/2005</a>. Inicialmente, era focado na escolariza&ccedil;&atilde;o e profissionaliza&ccedil;&atilde;o via arcos ocupacionais para jovens fora da escola ou do mercado de trabalho nas capitais, posteriormente ampliado para as vertentes adolescente, urbana e rural (<a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2007-2010/2008/Lei/L11692.htm" target="_blank">Lei n&ordm; 11.692/2008</a>).</li>
</ol>


<p class="paragrafo"><span style="background-color: #bfedd2;">Neste contexto, foram refor&ccedil;ados mecanismos para institucionalizar a pol&iacute;tica p&uacute;blica de Educa&ccedil;&atilde;o Profissional, buscando torn&aacute;-la permanente e de Estado</span>, superando um hist&oacute;rico de a&ccedil;&otilde;es epis&oacute;dicas. Destacam-se, abaixo, as seguintes a&ccedil;&otilde;es e suas respectivas normativas.</p>


<p class="paragrafo">De modo a institucionalizar a EPT, houve a reelabora&ccedil;&atilde;o e amplia&ccedil;&atilde;o, por meio da <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2007-2010/2008/Lei/L11741.htm" target="_blank">Lei n&ordm; 11.741/2008</a>, a LDBEN, do cap&iacute;tulo III &ldquo;da Educa&ccedil;&atilde;o Profissional&rdquo;, agora denominada EPT. As modifica&ccedil;&otilde;es, sobretudo do Artigo 39, consolidaram os princ&iacute;pios do <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2004-2006/2004/Decreto/D5154.htm" target="_blank">Decreto n&ordm; 5.154/2004</a>, refor&ccedil;ando a vincula&ccedil;&atilde;o da EPT com a Educa&ccedil;&atilde;o B&aacute;sica e a integra&ccedil;&atilde;o curricular.</p>


<p class="paragrafo">Um outro mecanismo de institucionaliza&ccedil;&atilde;o foi a introdu&ccedil;&atilde;o, no Fundo de Desenvolvimento da Educa&ccedil;&atilde;o B&aacute;sica (FUNDEB), da possibilidade de <strong>financiamento da Educa&ccedil;&atilde;o Profissional</strong> integrada ao Ensino M&eacute;dio, incluindo a modalidade de EJA, executada por estados e munic&iacute;pios.</p>


<p class="paragrafo">Do ponto de vista do fortalecimento das redes p&uacute;blicas, foi dado apoio &agrave; expans&atilde;o das redes estaduais de EPT, por meio de assist&ecirc;ncia t&eacute;cnica e financeira; do <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_ato2007-2010/2007/decreto/d6302.htm" target="_blank">Decreto n&ordm; 6.302/2007</a>, que institui o Programa Brasil Profissionalizado e a expans&atilde;o da Rede Federal; da cria&ccedil;&atilde;o de novas escolas t&eacute;cnicas e agrot&eacute;cnicas (<a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_ato2007-2010/2007/lei/l11534.htm" target="_blank">Lei n&ordm; 11.534/2007</a>); da cria&ccedil;&atilde;o dos <strong>Institutos Federais de Educa&ccedil;&atilde;o, Ci&ecirc;ncia e Tecnologia</strong> <strong>(IFs)</strong>; e da institui&ccedil;&atilde;o da Rede Federal de Educa&ccedil;&atilde;o Profissional, Cient&iacute;fica e Tecnol&oacute;gica (RFRPCT) por meio da <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_ato2007-2010/2008/lei/l11892.htm" target="_blank">Lei n&ordm; 11.892/2008</a>.</p>


<p class="paragrafo">A cria&ccedil;&atilde;o dos IFs, que surgiram a partir da transforma&ccedil;&atilde;o e incorpora&ccedil;&atilde;o dos antigos CEFETs e Escolas T&eacute;cnicas, al&eacute;m da cria&ccedil;&atilde;o de novas unidades, representou uma mudan&ccedil;a profunda na rede federal de Educa&ccedil;&atilde;o Profissional. Os IFs, equiparados &agrave;s institui&ccedil;&otilde;es federais de Ensino Superior, oferecem cursos de forma&ccedil;&atilde;o inicial e continuada de trabalhadores (FIC), cursos t&eacute;cnicos de n&iacute;vel m&eacute;dio, gradua&ccedil;&atilde;o tecnol&oacute;gica, licenciaturas e p&oacute;s-gradua&ccedil;&atilde;o. A proposta organizacional incluiu pol&iacute;ticas sociais como cotas raciais e assist&ecirc;ncia estudantil, al&eacute;m da autonomia inerentes &agrave;s institui&ccedil;&otilde;es de Ensino Superior p&uacute;blicas.</p>


<div id="recursos-azul" class="feat-box-foto">

<p class="paragrafo">A proposta de <strong>forma&ccedil;&atilde;o integral adotada combina ci&ecirc;ncia, tecnologia e cultura</strong>, utilizando pesquisa e tecnologias sociais como ferramentas pedag&oacute;gicas, criando polos de inova&ccedil;&atilde;o para resolver problemas das comunidades locais, interiorizando a EPT. Al&eacute;m disso, o trabalho e a pesquisa como princ&iacute;pios educativos apontam para a contextualiza&ccedil;&atilde;o e territorializa&ccedil;&atilde;o da EPT, tornando-a emancipat&oacute;ria.</p>
</div>


<p class="paragrafo">Antes mesmo de 2003, a concep&ccedil;&atilde;o emancipat&oacute;ria da Educa&ccedil;&atilde;o Profissional tamb&eacute;m foi implementada em diversas redes estaduais de EPT, ainda mais interiorizadas. Al&eacute;m dos princ&iacute;pios assumidos pela rede federal, a incorpora&ccedil;&atilde;o da <strong>interven&ccedil;&atilde;o social como princ&iacute;pio pedag&oacute;gico</strong>&nbsp;foi essencial para a constru&ccedil;&atilde;o de projetos profissionais, produ&ccedil;&atilde;o de tecnologias sociais, f&oacute;runs de discuss&atilde;o sobre educa&ccedil;&atilde;o e juventude, feiras cient&iacute;ficas e planejamento coletivo da EPT no territ&oacute;rio.</p>


<p class="paragrafo">A colabora&ccedil;&atilde;o entre redes federal e estadual de EPT e universidades p&uacute;blicas formou, em alguns locais, <strong>complexos educacionais</strong>, ainda que informais. Entretanto, tais arranjos impactaram positivamente as dimens&otilde;es econ&ocirc;mica e social dos territ&oacute;rios, devendo o sucesso das iniciativas ser atribu&iacute;do ao engajamento de comprometimento de gestores, professores, funcion&aacute;rios e estudantes, al&eacute;m da participa&ccedil;&atilde;o ativa das comunidades.</p>


<p class="paragrafo">Al&eacute;m disso, houve um foco na regula&ccedil;&atilde;o da Educa&ccedil;&atilde;o Profissional com a cria&ccedil;&atilde;o dos <a rel="noopener" href="https://cnct.mec.gov.br/" target="_blank">Cat&aacute;logos Nacionais de Cursos T&eacute;cnicos</a> (CNCT) e <a rel="noopener" href="https://cncst.mec.gov.br/" target="_blank">Tecnol&oacute;gicos</a> (CNST), que normatizaram aspectos como denomina&ccedil;&otilde;es e cargas hor&aacute;rias m&iacute;nimas. A implementa&ccedil;&atilde;o do Sistema Nacional de Informa&ccedil;&otilde;es da Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (SISTEC) buscou garantir o registro de institui&ccedil;&otilde;es e cursos, permitindo a valida&ccedil;&atilde;o nacional dos diplomas.</p>


<p class="paragrafo">Os resultados destas pol&iacute;ticas s&atilde;o positivos, ainda mais comparados com as anteriores, entretanto eram pol&iacute;ticas em desenvolvimento que necessitavam de mais tempo de matura&ccedil;&atilde;o. Mesmo assim, &eacute; poss&iacute;vel afirmar que neste per&iacute;odo <span style="background-color: #bfedd2;">a EPT foi afirmada como direito e como pol&iacute;tica p&uacute;blica de Estado, tendo as redes p&uacute;blicas como protagonistas <strong>deste processo&nbsp;</strong><span class="primary-color"><button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="No cap&iacute;tulo 5, iremos analisar a evolu&ccedil;&atilde;o quantitativa e qualitativa da EPT nacional a partir dessas pol&iacute;ticas e das apresentadas no pr&oacute;ximo t&oacute;pico &rdquo;Tempos Amb&iacute;guos&ldquo;."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>. Outra sinaliza&ccedil;&atilde;o &eacute; a inflex&atilde;o da EPT subalterna aos interesses do mercado de trabalho para a EPT emancipat&oacute;ria, formadora de pessoas, trabalhadores e cidad&atilde;os.</span>&nbsp;</p>


<div id="recursos-azul">
<div id="box-refletir">
<div class="box-refletir-blue">
<div class="header-box-refletir">
<p class="caixa-de-destaque-titulo titulo">As modalidades da EPT, segundo a LDBEN</p>
</div>
<div class="box-refletir-container">

<p class="paragrafo">Art. 39. A educa&ccedil;&atilde;o profissional e tecnol&oacute;gica, no cumprimento dos objetivos da educa&ccedil;&atilde;o nacional, integra-se aos diferentes n&iacute;veis e modalidades de educa&ccedil;&atilde;o e &agrave;s dimens&otilde;es do trabalho, da ci&ecirc;ncia e da tecnologia.<br />&sect; 1&ordm; Os cursos de educa&ccedil;&atilde;o profissional e tecnol&oacute;gica poder&atilde;o ser organizados por eixos tecnol&oacute;gicos, possibilitando a constru&ccedil;&atilde;o de diferentes itiner&aacute;rios formativos, observadas as normas do respectivo sistema e n&iacute;vel de ensino<br />&sect; 2&ordm; A educa&ccedil;&atilde;o profissional e tecnol&oacute;gica abranger&aacute; os seguintes cursos:<br />I &ndash; de forma&ccedil;&atilde;o inicial e continuada ou qualifica&ccedil;&atilde;o profissional;<br />II &ndash; de educa&ccedil;&atilde;o profissional t&eacute;cnica de n&iacute;vel m&eacute;dio;<br />III &ndash; de educa&ccedil;&atilde;o profissional tecnol&oacute;gica de gradua&ccedil;&atilde;o e p&oacute;s-gradua&ccedil;&atilde;o.<br />&sect; 3&ordm; Os cursos de educa&ccedil;&atilde;o profissional tecnol&oacute;gica de gradua&ccedil;&atilde;o e p&oacute;s-gradua&ccedil;&atilde;o organizar-se-&atilde;o, no que concerne a objetivos, caracter&iacute;sticas e dura&ccedil;&atilde;o, de acordo com as diretrizes curriculares nacionais estabelecidas pelo Conselho Nacional de Educa&ccedil;&atilde;o.<br />&sect; 4&ordm; As institui&ccedil;&otilde;es de educa&ccedil;&atilde;o superior dever&atilde;o dar transpar&ecirc;ncia e estabelecer crit&eacute;rios e procedimentos objetivos para o aproveitamento das experi&ecirc;ncias e dos conhecimentos desenvolvidos na educa&ccedil;&atilde;o profissional t&eacute;cnica de n&iacute;vel m&eacute;dio, sempre que o curso desse n&iacute;vel e o de n&iacute;vel superior sejam de &aacute;reas afins, nos termos de regulamento<br />(A reda&ccedil;&atilde;o acima foi inclu&iacute;da na LDB pela <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2007-2010/2008/Lei/L11741.htm" target="_blank">Lei n&ordm; 11.741/2008</a>, a exce&ccedil;&atilde;o do. &sect; 4&ordm;, que foi inclu&iacute;do pela <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2023-2026/2023/Lei/L14645.htm" target="_blank">Lei n&ordm; 14.645/2023</a>).</p>

</div>
</div>
</div>
</div>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_31.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_34.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 24 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>