<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Qualifica&ccedil;&atilde;o</strong></p>

<p>O termo <strong>qualifica&ccedil;&atilde;o</strong> tem muitos significados e formas de uso, ora se referindo ao conceito sociol&oacute;gico, ora &agrave; modalidade educacional (acrescentando o adjetivo &ldquo;profissional&rdquo;). Verificamos uma falsa identidade entre educa&ccedil;&atilde;o e qualifica&ccedil;&atilde;o profissional, como se esta se reduzisse a uma modalidade daquela. Essa utiliza&ccedil;&atilde;o, encontrada tanto na linguagem coloquial como em trabalhos acad&ecirc;micos, refere-se, <span style="background-color: #bfedd2;">por um lado, a concep&ccedil;&otilde;es te&oacute;ricas sobre a rela&ccedil;&atilde;o entre o trabalho e educa&ccedil;&atilde;o, e, por outro, &agrave; estrat&eacute;gia dos agentes sociais em demarcar campos e utilizar os conceitos para os seus pr&oacute;prios fins.</span></p>


<p class="paragrafo">A maneira distorcida de relacionar &ldquo;educa&ccedil;&atilde;o e trabalho&rdquo; se diferencia &ndash; e n&atilde;o apenas em termos sem&acirc;nticos &ndash; da rela&ccedil;&atilde;o dial&eacute;tica entre &ldquo;trabalho e educa&ccedil;&atilde;o&rdquo;. Essa distor&ccedil;&atilde;o oculta as lutas que ocorrem desde a base econ&ocirc;mica, como as hierarquias no ambiente de trabalho, passando pelas classifica&ccedil;&otilde;es de ocupa&ccedil;&otilde;es e planos de cargos e sal&aacute;rios, at&eacute; o reconhecimento social de t&iacute;tulos profissionais e acad&ecirc;micos. Isso contrasta com os saberes e conhecimentos que s&atilde;o realmente <strong>constru&iacute;dos na vida e no trabalho</strong>.</p>


<p class="paragrafo"><span style="font-weight: 400;">&Eacute; fundamental aprofundar a discuss&atilde;o sobre o <strong>conceito de qualifica&ccedil;&atilde;o</strong>, que tem suas ra&iacute;zes na sociologia do trabalho. Embora tenha sido relevante nos debates educacionais no passado, seu uso tem diminu&iacute;do nas produ&ccedil;&otilde;es recentes, especialmente em rela&ccedil;&atilde;o &agrave; an&aacute;lise e &agrave; formula&ccedil;&atilde;o de pol&iacute;ticas p&uacute;blicas para a Educa&ccedil;&atilde;o Profissional. Portanto, &eacute; crucial entender as inten&ccedil;&otilde;es dos agentes sociais em rela&ccedil;&atilde;o &agrave; forma&ccedil;&atilde;o, &agrave;s habilidades e ao valor dos trabalhadores, indo al&eacute;m de meros processos descritivos de habilidades e compet&ecirc;ncias.</span></p>


<p class="paragrafo">Temos, portanto, como ponto de partida, <strong>tr&ecirc;s concep&ccedil;&otilde;es principais</strong>:</p>


<ul>
<li>Qualifica&ccedil;&atilde;o vinculada &agrave;s demandas do posto de trabalho, aos atributos individuais e &agrave; estrutura organizativa da empresa;</li>
<li>Qualifica&ccedil;&atilde;o relacionada ao grau de autonomia do trabalhador, comportando processos de<span class="modal-button button" data-toggle="modal" data-target="#modal-1">&nbsp;qualifica&ccedil;&atilde;o-desqualifica&ccedil;&atilde;o-requalifica&ccedil;&atilde;o</span> e, em decorr&ecirc;ncia, de posi&ccedil;&otilde;es como o <span class="modal-button button" data-toggle="modal" data-target="#modal-2">pessimismo e otimismo tecnol&oacute;gicos</span>, de verifica&ccedil;&atilde;o da<span class="modal-button button" data-toggle="modal" data-target="#modal-3">&nbsp;polariza&ccedil;&atilde;o das qualifica&ccedil;&otilde;es</span> e da <span class="modal-button button" data-toggle="modal" data-target="#modal-4">tese da qualifica&ccedil;&atilde;o relativa</span>;</li>
<li>Qualifica&ccedil;&atilde;o como constru&ccedil;&atilde;o social, complexa, contradit&oacute;ria e multideterminada.&nbsp;</li>
</ul>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Os processos de qualifica&ccedil;&atilde;o-desqualifica&ccedil;&atilde;o-requalifica&ccedil;&atilde;o</h5>
</div>
<div class="modal-body nota">Os processos de qualifica&ccedil;&atilde;o-desqualifica&ccedil;&atilde;o-requalifica&ccedil;&atilde;o defendem que, sob o capitalismo, a for&ccedil;a de trabalho &eacute; continuamente qualificada, posteriormente desqualificada (quando suas habilidades se tornam obsoletas) e novamente requalificada (com outras habilidades, agora necess&aacute;rias), em um ciclo cont&iacute;nuo.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Pessimismo e Otimismo Tecnol&oacute;gicos em rela&ccedil;&atilde;o &agrave; qualifica&ccedil;&atilde;o</h5>
</div>
<div class="modal-body nota"><strong>Otimismo Tecnol&oacute;gico:</strong> essa perspectiva acredita que as inova&ccedil;&otilde;es tecnol&oacute;gicas criar&atilde;o novas oportunidades de emprego e melhorar&atilde;o a efici&ecirc;ncia do trabalho. Os defensores argumentam que a educa&ccedil;&atilde;o deve evoluir a fim de preparar os trabalhadores para essas novas realidades, promovendo uma for&ccedil;a de trabalho mais qualificada.
<p>&nbsp;</p>
<strong> Pessimismo Tecnol&oacute;gico:</strong> em contrapartida, essa vis&atilde;o alerta para os riscos da automa&ccedil;&atilde;o e da Intelig&ecirc;ncia Artificial (IA), os quais podem levar ao aumento do desemprego e &agrave; cria&ccedil;&atilde;o de uma "classe obsoleta". A cren&ccedil;a no determinismo tecnol&oacute;gico sugere que as mudan&ccedil;as tecnol&oacute;gicas podem exacerbar desigualdades sociais, tornando os trabalhadores menos qualificados mais vulner&aacute;veis.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-3" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Polariza&ccedil;&atilde;o das qualifica&ccedil;&otilde;es</h5>
</div>
<div class="modal-body nota">Descreve a crescente divis&atilde;o entre empregos altamente qualificados e aqueles que exigem pouca ou nenhuma qualifica&ccedil;&atilde;o. Essa tend&ecirc;ncia resulta na concentra&ccedil;&atilde;o de empregos bem remunerados em setores tecnol&oacute;gicos avan&ccedil;ados, enquanto muitos trabalhadores enfrentam precariza&ccedil;&atilde;o e desvaloriza&ccedil;&atilde;o no mercado de trabalho.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-4" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Tese da qualifica&ccedil;&atilde;o relativa</h5>
</div>
<div class="modal-body nota">Aponta que as habilidades dos trabalhadores s&atilde;o avaliadas, na maior parte das vezes, em rela&ccedil;&atilde;o &agrave;s exig&ecirc;ncias do mercado de trabalho. Isso implica que mesmo trabalhadores com alta qualifica&ccedil;&atilde;o podem enfrentar a desvaloriza&ccedil;&atilde;o se suas compet&ecirc;ncias n&atilde;o forem mais demandadas.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p>Ou seja, <span style="background-color: #bfedd2;">qualifica&ccedil;&atilde;o &eacute; o conjunto de rela&ccedil;&otilde;es sociais entre trabalho e educa&ccedil;&atilde;o que permite a aquisi&ccedil;&atilde;o e utiliza&ccedil;&atilde;o de conhecimentos, experi&ecirc;ncias e capacidades t&eacute;cnicas e sociais. Assim, isso torna seus &ldquo;portadores&rdquo; capazes de transformar a natureza e a si mesmos</span>, gerando valores de uso, novos conhecimentos e novas rela&ccedil;&otilde;es sociais, incluindo uma forte produ&ccedil;&atilde;o simb&oacute;lica, que &eacute; parte fundamental de uma cultura e de identidades espec&iacute;ficas, a<span class="modal-button button" data-toggle="modal" data-target="#modal-5">&nbsp;cultura do trabalho.</span></p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-5" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Cultura do Trabalho</h5>
</div>
<div class="modal-body nota">Para ter-se ideia da riqueza e complexidade de adotar a concep&ccedil;&atilde;o de <strong>cultura do trabalho</strong>, listamos a seguir quest&otilde;es incontorn&aacute;veis que ela suscita:
<p>&nbsp;</p>
1. Rela&ccedil;&otilde;es <strong>inter, intra e extra classe</strong>. Ou seja, o entrechoque de interesses e motiva&ccedil;&otilde;es inter (capital e trabalhadores), intra (diferentes segmentos dos trabalhadores como engenheiros, t&eacute;cnicos e pe&otilde;es) e extra (cortes por g&ecirc;nero, etnia, gera&ccedil;&atilde;o etc.) classes;
<p>&nbsp;</p>
2. Rela&ccedil;&otilde;es entre <strong>poderes e saberes</strong> no local de trabalho que inclui:
<p>&nbsp;</p>
<ul>
<li>Classificar e categorizar a qualifica&ccedil;&atilde;o, n&atilde;o s&oacute; por parte das chefias, mas tamb&eacute;m pelos trabalhadores;</li>
<li>Considerar a depend&ecirc;ncia da defini&ccedil;&atilde;o de qualifica&ccedil;&atilde;o da tradi&ccedil;&atilde;o, do costume e da organiza&ccedil;&atilde;o coletiva;</li>
<li>Observar a pertin&ecirc;ncia das caracter&iacute;sticas do tipo adquirido (tempo de escolaridade, por exemplo) e das qualidades do tipo adscrito (sexo, cor, idade) na constru&ccedil;&atilde;o das classifica&ccedil;&otilde;es dos trabalhadores e das tarefas por eles executados.</li>
</ul>
3. Capacidades constru&iacute;das por <strong>processos de forma&ccedil;&atilde;o</strong>, transmiss&iacute;veis pela linguagem, compreendendo a n&atilde;o identidade entre a qualifica&ccedil;&atilde;o do posto de trabalho e a qualifica&ccedil;&atilde;o do trabalhador;
<p>&nbsp;</p>
4. As qualifica&ccedil;&otilde;es t&aacute;citas, que s&atilde;o constru&iacute;das tanto no cotidiano do local de trabalho quanto fora dele e n&atilde;o s&atilde;o transmiss&iacute;veis pela linguagem.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo">Em rela&ccedil;&atilde;o &agrave; complexidade do mundo do trabalho, &eacute; preciso reconhecer a heterogeneidade das experi&ecirc;ncias de trabalhadores, que surgem de tarefas e qualifica&ccedil;&otilde;es diferenciadas, influenciadas pelas rela&ccedil;&otilde;es de trabalho.</p>


<p class="paragrafo">Ent&atilde;o, quais seriam as condi&ccedil;&otilde;es concretas para um projeto de qualifica&ccedil;&atilde;o profissional individual? Fatores como a necessidade imediata de sobreviv&ecirc;ncia, a origem regional e a qualifica&ccedil;&atilde;o anterior impactam essa formula&ccedil;&atilde;o. Al&eacute;m disso, existem distin&ccedil;&otilde;es de g&ecirc;nero, a partir das quais os homens t&ecirc;m acesso mais amplo &agrave; qualifica&ccedil;&atilde;o, enquanto as mulheres enfrentam oportunidades limitadas, frequentemente ligadas a suas trajet&oacute;rias pessoais, como a maternidade. A &eacute;tica do provedor, presente no universo masculino, cria barreiras para a mudan&ccedil;a, pois os homens buscam estrat&eacute;gias para aumentar a renda familiar. Por outro lado, as mulheres, apesar de serem consideradas competentes nos seus postos de trabalho, n&atilde;o recebem a remunera&ccedil;&atilde;o condizente e sofrem preconceito e discrimina&ccedil;&atilde;o por sua condi&ccedil;&atilde;o feminina, e s&atilde;o recorrentemente vistas como exigentes e nervosas.</p>



<div id="recursos-azul" class="feat-box-foto">

<p><span style="font-size: 18pt;"><strong>Mulheres na EPT</strong></span></p>
<p>As pesquisas da Sociologia do Trabalho mostram que homens e mulheres, sobretudo no meio oper&aacute;rio, apresentam formas diferenciadas de ver o trabalho. &Eacute; fundamental distinguir isso, pois, <strong>na Educa&ccedil;&atilde;o Profissional, as mulheres j&aacute; s&atilde;o maioria</strong>, mas o processo de ensino-aprendizagem continua, com raras exce&ccedil;&otilde;es, desconhecendo este fato.</p>
<p>Para aprofundar a tem&aacute;tica, sugerimos que voc&ecirc; assista ao v&iacute;deo a seguir:</p>
<ul>
<li><a rel="noopener" href="https://www.youtube.com/watch?v=2TivreYa2To" target="_blank">Desafios para as Mulheres Brasileiras Urbanas no Mundo do Trabalho</a> (2022), trabalho derivado da disserta&ccedil;&atilde;o de mestrado de Suzana Victor da Costa, intitulada "<a rel="noopener" href="https://portal.ifrj.edu.br/sites/default/files/IFRJ/PROPPI/susana_victor_da_costa.pdf" target="_blank">Obst&aacute;culos para Mulheres no Mundo do Trabalho: Um Olhar do Feminismo Marxista e da Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (EPT)</a>"&nbsp;(2022), do Instituto Federal do Rio de Janeiro.</li>
</ul>

</div>


<p class="paragrafo">No contexto masculino, trabalhadores qualificados vivenciam uma &eacute;tica coletiva valorizada pela combina&ccedil;&atilde;o de conhecimento te&oacute;rico, pr&aacute;tico e t&aacute;cito, que se traduz em prazer e valoriza&ccedil;&atilde;o do trabalho. Na f&aacute;brica, todos respeitam aquele trabalhador que conhece o seu of&iacute;cio. Nesse sentido, o desemprego afeta mais fortemente a sa&uacute;de mental dos homens, que perdem o papel de &ldquo;provedor&rdquo; e os la&ccedil;os sociais que os apoiam; por outro lado, estes tamb&eacute;m, geralmente, recusam empregos que exigem menor qualifica&ccedil;&atilde;o.</p>


<p class="paragrafo">Em contrapartida, sem que isso represente aceita&ccedil;&atilde;o ou passividade, as trabalhadoras enfrentam a quest&atilde;o do desemprego, mas reconhecem o valor de seu trabalho pela qualidade do que realizam, mantendo uma rela&ccedil;&atilde;o positiva com a sua atividade, mesmo em condi&ccedil;&otilde;es de desqualifica&ccedil;&atilde;o e baixos sal&aacute;rios. Neste sentido, a luta das mulheres por igualdade salarial, por mais oportunidade de qualifica&ccedil;&atilde;o e de carreira se torna central na atualidade.</p>


<p class="paragrafo">A qualifica&ccedil;&atilde;o como uma constru&ccedil;&atilde;o social tem sua g&ecirc;nese no local de trabalho. Embora existam ag&ecirc;ncias formadoras de m&atilde;o-de-obra, como patronais, estatais e de trabalhadores, a forma&ccedil;&atilde;o cont&iacute;nua e a transmiss&atilde;o do conhecimento s&atilde;o, na verdade, moldadas pela cultura empresarial e pela intera&ccedil;&atilde;o entre os trabalhadores. A <strong>subjetividade</strong> dos indiv&iacute;duos &eacute; um fator crucial nesse processo, pois <span style="background-color: #bfedd2;">permite que conhecimentos e saberes individuais se tornem coletivos e, muitas vezes, tenham impactos significativos na inova&ccedil;&atilde;o e na din&acirc;mica do trabalho.</span></p>

<p><!-- Citação curta --></p>

<div id="recursos-azul" class="quote-1">
<p class="quote citacao-curta" style="display: block;">"A qualifica&ccedil;&atilde;o &eacute; um elemento fundamental na luta pela hegemonia, pois envolve a forma&ccedil;&atilde;o de uma consci&ecirc;ncia cr&iacute;tica nas classes subalternas"</p>
<div class="author citacao-curta-autoria"><strong>(</strong>
<p><strong>Antonio Gramsci, 2024, p.40</strong></p>
<strong>)</strong></div>
</div>


<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.1_ILU_5.png" alt="T&iacute;tulo:&nbsp;Saberes coletivos  Fonte:&nbsp;Prosa (2024)." width="80%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Saberes coletivos<strong><br />Fonte: </strong>Prosa (2024e).<strong><br /><br /></strong></p>
<p class="content paragrafo quote citacao-curta strong"><span style="font-size: 24pt;"><strong>Qualifica&ccedil;&atilde;o e reestrutura&ccedil;&atilde;o produtiva</strong></span></p>

<p>Al&eacute;m disso, a qualifica&ccedil;&atilde;o se mostra um tema multidisciplinar relevante em contextos de <strong>reestrutura&ccedil;&atilde;o produtiva</strong>. O aumento da demanda por trabalhadores mais qualificados e com habilidades e compet&ecirc;ncias diversificadas acompanha a r&aacute;pida inova&ccedil;&atilde;o tecnol&oacute;gica e a necessidade de adapta&ccedil;&atilde;o perante as novas realidades do mercado.</p>


<p class="paragrafo">Contudo, essa busca por profissionais qualificados contrasta com a desestabiliza&ccedil;&atilde;o de v&aacute;rios setores e resulta em formas prec&aacute;rias de trabalho e desemprego: h&aacute; uma tens&atilde;o entre a necessidade de valoriza&ccedil;&atilde;o do trabalhador por meio do enriquecimento do trabalho e o risco de aliena&ccedil;&atilde;o. Tais mudan&ccedil;as nas rela&ccedil;&otilde;es de trabalho afetam a padroniza&ccedil;&atilde;o conquistada pelas lutas sindicais ao longo dos anos. A flexibilidade nos contratos de trabalho resulta em precariza&ccedil;&atilde;o e privatiza&ccedil;&atilde;o de riscos. Assim, <span style="background-color: #bfedd2;">a &ldquo;educa&ccedil;&atilde;o para o trabalho&rdquo; precisa ser repensada, pois n&atilde;o pode garantir a inser&ccedil;&atilde;o no mercado diante das novas exig&ecirc;ncias e instabilidades.</span></p>


<p class="paragrafo">Os processos de qualifica&ccedil;&atilde;o atuais &ndash; na &oacute;tica hegem&ocirc;nica &ndash; visam desenvolver compet&ecirc;ncias de longo prazo, que incluem habilidades de adapta&ccedil;&atilde;o a novas situa&ccedil;&otilde;es e aprendizado cont&iacute;nuo. No entanto, a crescente media&ccedil;&atilde;o da tecnologia tamb&eacute;m resulta em um maior controle sobre trabalhadores, gerando desafios adicionais. Nesta &oacute;tica dominante, os processos educacionais precisam ser ressignificados, ultrapassando a vis&atilde;o funcionalista tradicional. A diverg&ecirc;ncia entre as vis&otilde;es de empres&aacute;rios e trabalhadores<span style="background-color: #bfedd2;"> imp&otilde;e a necessidade de uma abordagem mais inclusiva e capaz de responder verdadeiramente &agrave;s <strong>demandas da sociedade</strong></span> e n&atilde;o apenas ao mercado de trabalho. A escolariza&ccedil;&atilde;o inicial deve ser de qualidade e longa, de qualidade e integral, de modo a preparar os indiv&iacute;duos n&atilde;o para uma demanda imediata do mercado, mas para uma percep&ccedil;&atilde;o mais ampla do <strong>mundo do trabalho</strong>.</p>


<p><img class="card-curso-topo-image" src="medias/PP.1_FT_6.jpg" alt="Fonte: Sch&uuml;ler (2023)." width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Forma&ccedil;&atilde;o de qualidade e integral para o mundo do trabaho<strong><br />Fonte: </strong>Sch&uuml;ler (2023f).</p>


<p class="paragrafo">Por fim, os setores hegem&ocirc;nicos consideram que a defasagem entre a educa&ccedil;&atilde;o e o mercado de trabalho fundamenta um cen&aacute;rio de <strong>crise educacional</strong>.</p>


<p class="paragrafo">Para eles, as reformas curriculares devem promover flexibilidade e uma vis&atilde;o global sobre os processos de trabalho, garantindo a relev&acirc;ncia da qualifica&ccedil;&atilde;o profissional no contexto atual. A necessidade de pesquisa cont&iacute;nua e acompanhamento das pol&iacute;ticas educacionais se faz evidente, questionando se o conceito de qualifica&ccedil;&atilde;o deveria ser substitu&iacute;do pela no&ccedil;&atilde;o de compet&ecirc;ncia e como isso se alinha &agrave;s demandas de um mercado em transforma&ccedil;&atilde;o, principalmente frente aos novos modelos produtivos e &agrave;s realidades que surgem deles.</p>


<p class="paragrafo">Entretanto, apesar da ado&ccedil;&atilde;o da no&ccedil;&atilde;o de compet&ecirc;ncias pelo polo hegem&ocirc;nico (mais adequado a processos formativos alinhados com o mercado de trabalho), o conceito de qualifica&ccedil;&atilde;o, conforme descrito aqui continua extremamente &uacute;til, uma vez que <span style="background-color: #bfedd2;">desvela as contradi&ccedil;&otilde;es inerentes ao processo e permite questionamentos e interven&ccedil;&otilde;es dos principais interessados, os sujeitos trabalhadores.</span></p>


<p class="paragrafo">&Eacute; importante destacar a import&acirc;ncia de um processo cont&iacute;nuo de pesquisa e acompanhamento das pol&iacute;ticas de Educa&ccedil;&atilde;o Profissional, levando em conta as demandas dos agentes sociais dos polos hegem&ocirc;nico e contra hegem&ocirc;nico. Por exemplo, ao explorar as implica&ccedil;&otilde;es do <span class="primary-color"><strong>toytismo</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Modelo de gest&atilde;o, marcado por mudan&ccedil;as tecnol&oacute;gicas e organizacionais, cujo princ&iacute;pio &eacute; a flexibilidade dos produtos e do uso da for&ccedil;a de trabalho."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;na forma&ccedil;&atilde;o dos trabalhadores, verifica-se que este modelo resulta em profissionais polivalentes com qualifica&ccedil;&otilde;es superficiais; por outro lado, leva &agrave; forma&ccedil;&atilde;o de um n&uacute;mero bastante reduzido de trabalhadores mais qualificados e aut&ocirc;nomos, capazes de entender e dominar o fluxo produtivo.</p>


<p class="paragrafo">A possibilidade de desenvolver uma forma&ccedil;&atilde;o polit&eacute;cnica e abrangente, que respeite a <strong>autonomia</strong>&nbsp;e a <strong>cidadania</strong>, assim como a rela&ccedil;&atilde;o entre a forma&ccedil;&atilde;o no local de trabalho, coloca a necessidade de reconsiderar os sistemas educativos, integrando a Educa&ccedil;&atilde;o Profissional &agrave; Educa&ccedil;&atilde;o B&aacute;sica como parte da luta pela democratiza&ccedil;&atilde;o da educa&ccedil;&atilde;o p&uacute;blica a partir da quebra do modelo dual.</p>



<div id="recursos-azul" class="feat-box-foto">
<div class="title caixa-de-destaque-titulo">
<p class="paragrafo">Em resumo, a <strong>concep&ccedil;&atilde;o de qualifica&ccedil;&atilde;o como rela&ccedil;&atilde;o social</strong> al&eacute;m das considera&ccedil;&otilde;es anteriores &ndash; e tendo em conta especificamente os nexos entre educa&ccedil;&atilde;o e qualifica&ccedil;&atilde;o profissional &ndash; se caracteriza por:</p>
<ul>
<li class="paragrafo">Incluir, necessariamente, algum tipo de educa&ccedil;&atilde;o, embora n&atilde;o se resuma ou corresponda exclusivamente a ela;</li>
<li class="paragrafo">N&atilde;o estar dissociada da Educa&ccedil;&atilde;o B&aacute;sica e da forma&ccedil;&atilde;o pol&iacute;tico-social;</li>
<li class="paragrafo">Ser um processo que envolve o conhecimento da cultura geral e t&eacute;cnica, sua reelabora&ccedil;&atilde;o e uso;</li>
<li class="paragrafo">N&atilde;o estar limitada &agrave; forma&ccedil;&atilde;o profissional oferecida por institui&ccedil;&otilde;es formais, mas que inclua os processos de ensino e aprendizagem ao longo da vida: leitura, interpreta&ccedil;&atilde;o e assimila&ccedil;&atilde;o de experi&ecirc;ncias vividas, tanto individual quanto coletivamente;</li>
<li class="paragrafo">Ser, al&eacute;m disso, parte importante do processo de apropria&ccedil;&atilde;o do conhecimento social, patrim&ocirc;nio da humanidade, na busca de sua pr&oacute;pria emancipa&ccedil;&atilde;o, especificamente por possibilitar controle sobre o processo de trabalho e contribuir fortemente para a forma&ccedil;&atilde;o de identidades.</li>
</ul>
</div>
</div>


<p class="paragrafo">Deste modo, a qualifica&ccedil;&atilde;o deve ser concebida como parte do processo de disputa de <span class="primary-color"><strong>hegemonia</strong>&nbsp;<button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Capacidade de um de um grupo ou classe social de incutir sua vontade, interesses e valores aos demais mediante o consentimento ou consenso."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;na sociedade, que tem um dos seus focos no local de trabalho, mas que se espraia para as concep&ccedil;&otilde;es de educa&ccedil;&atilde;o e para a disputa do Estado.</p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_4.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_7.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 4 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>