<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Educa&ccedil;&atilde;o e EPT na Constitui&ccedil;&atilde;o de 1988</strong></p>


<p class="paragrafo">Em rela&ccedil;&atilde;o &agrave; <strong>educa&ccedil;&atilde;o</strong>, al&eacute;m de existir como direito social no artigo 6&ordm; j&aacute; citado, h&aacute; um conjunto de artigos (205 a 214) que detalha os objetivos, a estrutura, a institucionalidade e o financiamento, que sofreram altera&ccedil;&otilde;es em 1996, 2008 e 2020 &ndash; ou seja, momentos hist&oacute;ricos distintos. A an&aacute;lise revela elementos progressistas convivendo com outros que nem tanto e, tamb&eacute;m, as marchas e contramarchas, demonstrando que, apesar do direito &agrave; educa&ccedil;&atilde;o ser cl&aacute;usula p&eacute;trea, h&aacute; a disputa quanto aos seus objetivos e a sua abrang&ecirc;ncia; da rela&ccedil;&atilde;o p&uacute;blico-privado; dos direitos dos trabalhadores &agrave; educa&ccedil;&atilde;o e, ainda, do financiamento e uso dos recursos p&uacute;blicos, os quais est&atilde;o sempre em debate, a partir da correla&ccedil;&atilde;o de for&ccedil;as na sociedade.</p>


<p class="paragrafo">Os artigos refor&ccedil;am a ideia do direito a uma educa&ccedil;&atilde;o que pode ser entendida como <strong>integral</strong>, pois se refere &agrave; forma&ccedil;&atilde;o da <em>pessoa</em>, do <em>cidad&atilde;o</em>&nbsp;e do <em>trabalhador</em> (art. 205). Al&eacute;m disso, o acesso &agrave; educa&ccedil;&atilde;o &eacute; definido como um <strong>direito p&uacute;blico subjetivo</strong>, que n&atilde;o &eacute; prescrito a partir da idade.</p>


<p><img class="card-curso-topo-image" src="medias/PP.2_ILU_5.PNG" alt="card do curso" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo:<span>&nbsp;</span></strong>Educa&ccedil;&atilde;o integral<strong><br />Fonte:<span>&nbsp;</span></strong>Prosa (2024d).</p>


<p class="paragrafo">O direito subjetivo &eacute; aquele em que ao sujeito, no caso qualquer cidad&atilde;o ou cidad&atilde;, &eacute; dado o poder de exigir a garantia do cumprimento de um direito individual j&aacute; previsto na legisla&ccedil;&atilde;o. (art. 206, inc. IX e art. 208, inc. I e &sect; 1&ordm; da CF/88).</p>


<p class="paragrafo">A organiza&ccedil;&atilde;o e o planejamento da educa&ccedil;&atilde;o est&atilde;o previstos nos seguintes dispositivos:</p>


<ul>
<li class="paragrafo" style="line-height: 1;"><strong>Artigo 207</strong>: institui&ccedil;&otilde;es de ensino superior p&uacute;blicas e sua autonomia;</li>
<li class="paragrafo" style="line-height: 1;"><strong>Artigo 210</strong>: conte&uacute;dos &ldquo;m&iacute;nimos&rdquo; para o ensino fundamental;</li>
<li class="paragrafo" style="line-height: 1;"><strong>Artigo 211</strong>: sistemas e regime de colabora&ccedil;&atilde;o entre Uni&atilde;o, estados e munic&iacute;pios;</li>
<li class="paragrafo" style="line-height: 1;"><strong>Artigo 214</strong>: Plano Nacional e Sistema Nacional de Educa&ccedil;&atilde;o.</li>
</ul>


<p class="paragrafo">Em rela&ccedil;&atilde;o ao financiamento e &agrave; rela&ccedil;&atilde;o p&uacute;blico e privado (art. 209, 212, 212-A e 213), evidencia-se de um lado a ambiguidade e do outro a complexidade de garantir, repartir e utilizar os recursos p&uacute;blicos da educa&ccedil;&atilde;o.</p>


<div id="recursos-azul">
<div id="box-refletir">
<div class="box-refletir-blue">
<div class="header-box-refletir">
<p class="caixa-de-destaque-titulo titulo"><span>Artigos selecionados da Constitui&ccedil;&atilde;o referentes &agrave; educa&ccedil;&atilde;o</span></p>
</div>
<div class="box-refletir-container">

<p class="paragrafo"><strong>Objetivos, direito e acesso</strong></p>


<p class="paragrafo"><strong>Art. 205.</strong> A educa&ccedil;&atilde;o, direito de todos e dever do Estado e da fam&iacute;lia, ser&aacute; promovida e incentivada com a colabora&ccedil;&atilde;o da sociedade, visando ao pleno desenvolvimento da pessoa, seu preparo para o exerc&iacute;cio da cidadania e sua qualifica&ccedil;&atilde;o para o trabalho.</p>


<p class="paragrafo"><strong>Art. 206.</strong> O ensino ser&aacute; ministrado com base nos seguintes princ&iacute;pios:<br />I - igualdade de condi&ccedil;&otilde;es para o acesso e perman&ecirc;ncia na escola;<br />II - liberdade de aprender, ensinar, pesquisar e divulgar o pensamento, a arte e o saber;<br />III - pluralismo de ideias e de concep&ccedil;&otilde;es pedag&oacute;gicas, e coexist&ecirc;ncia de institui&ccedil;&otilde;es p&uacute;blicas e privadas de ensino;<br />IV - gratuidade do ensino p&uacute;blico em estabelecimentos oficiais;<br />[...]<br />IX - garantia do direito &agrave; educa&ccedil;&atilde;o e &agrave; aprendizagem ao longo da vida.</p>


<p class="paragrafo"><strong>Art. 208.</strong> O dever do Estado com a educa&ccedil;&atilde;o ser&aacute; efetivado mediante a garantia de:<br />I - educa&ccedil;&atilde;o b&aacute;sica obrigat&oacute;ria e gratuita dos 4 (quatro) aos 17 (dezessete) anos de idade, assegurada inclusive sua oferta gratuita para todos os que a ela n&atilde;o tiveram acesso na idade pr&oacute;pria;<br />II - progressiva universaliza&ccedil;&atilde;o do ensino m&eacute;dio gratuito;<br />III - atendimento educacional especializado aos portadores de defici&ecirc;ncia, preferencialmente na rede regular de ensino;<br />[...]<br />V - acesso aos n&iacute;veis mais elevados do ensino, da pesquisa e da cria&ccedil;&atilde;o art&iacute;stica, segundo a capacidade de cada um;<br />VI - oferta de ensino noturno regular, adequado &agrave;s condi&ccedil;&otilde;es do educando;<br />VII - atendimento ao educando, em todas as etapas da educa&ccedil;&atilde;o b&aacute;sica, por meio de programas suplementares de material did&aacute;tico escolar, transporte, alimenta&ccedil;&atilde;o e assist&ecirc;ncia &agrave; sa&uacute;de.&nbsp;<br />&sect; 1&ordm; O acesso ao ensino obrigat&oacute;rio e gratuito &eacute; direito p&uacute;blico subjetivo.</p>


<p class="paragrafo"><strong>Organiza&ccedil;&atilde;o e planejamento</strong></p>


<p class="paragrafo"><strong>Art. 207.</strong> As universidades gozam de autonomia did&aacute;tico-cient&iacute;fica, administrativa e de gest&atilde;o financeira e patrimonial, e obedecer&atilde;o ao princ&iacute;pio de indissociabilidade entre ensino, pesquisa e extens&atilde;o.</p>


<p class="paragrafo"><strong>Art. 214.</strong> A lei estabelecer&aacute; o plano nacional de educa&ccedil;&atilde;o, de dura&ccedil;&atilde;o decenal, com o objetivo de articular o sistema nacional de educa&ccedil;&atilde;o em regime de colabora&ccedil;&atilde;o e definir diretrizes, objetivos, metas e estrat&eacute;gias de implementa&ccedil;&atilde;o para assegurar a manuten&ccedil;&atilde;o e desenvolvimento do ensino em seus diversos n&iacute;veis, etapas e modalidades por meio de a&ccedil;&otilde;es integradas dos poderes p&uacute;blicos das diferentes esferas federativas que conduzam a;<br />I - erradica&ccedil;&atilde;o do analfabetismo;<br />II - universaliza&ccedil;&atilde;o do atendimento escolar;<br />III - melhoria da qualidade do ensino;<br />IV - forma&ccedil;&atilde;o para o trabalho;<br />V - promo&ccedil;&atilde;o human&iacute;stica, cient&iacute;fica e tecnol&oacute;gica do Pa&iacute;s.<br />VI - estabelecimento de meta de aplica&ccedil;&atilde;o de recursos p&uacute;blicos em educa&ccedil;&atilde;o como propor&ccedil;&atilde;o do produto interno bruto</p>


<p class="paragrafo"><strong>Financiamento</strong></p>


<p class="paragrafo"><strong>Art. 212.</strong> A Uni&atilde;o aplicar&aacute;, anualmente, nunca menos de dezoito, e os Estados, o Distrito Federal e os Munic&iacute;pios vinte e cinco por cento, no m&iacute;nimo, da receita resultante de impostos, compreendida a proveniente de transfer&ecirc;ncias, na manuten&ccedil;&atilde;o e desenvolvimento do ensino<br />&sect; 3&ordm; A distribui&ccedil;&atilde;o dos recursos p&uacute;blicos assegurar&aacute; prioridade ao atendimento das necessidades do ensino obrigat&oacute;rio, no que se refere a universaliza&ccedil;&atilde;o, garantia de padr&atilde;o de qualidade e equidade, nos termos do plano nacional de educa&ccedil;&atilde;o.</p>


<p class="paragrafo"><strong>Art. 212-A.</strong> Os Estados, o Distrito Federal e os Munic&iacute;pios destinar&atilde;o parte dos recursos a que se refere o caput do art. 212 desta Constitui&ccedil;&atilde;o &agrave; manuten&ccedil;&atilde;o e ao desenvolvimento do ensino na educa&ccedil;&atilde;o b&aacute;sica e &agrave; remunera&ccedil;&atilde;o condigna de seus profissionais, respeitadas as seguintes disposi&ccedil;&otilde;es.&nbsp;<br />I - a distribui&ccedil;&atilde;o dos recursos e de responsabilidades entre o Distrito Federal, os Estados e seus Munic&iacute;pios &eacute; assegurada mediante a institui&ccedil;&atilde;o, no &acirc;mbito de cada Estado e do Distrito Federal, de um Fundo de Manuten&ccedil;&atilde;o e Desenvolvimento da Educa&ccedil;&atilde;o B&aacute;sica e de Valoriza&ccedil;&atilde;o dos Profissionais da Educa&ccedil;&atilde;o (Fundeb), de natureza cont&aacute;bil;<br />&sect; 2&ordm; As atividades de pesquisa, de extens&atilde;o e de est&iacute;mulo e fomento &agrave; inova&ccedil;&atilde;o realizadas por universidades e/ou por institui&ccedil;&otilde;es de educa&ccedil;&atilde;o profissional e tecnol&oacute;gica poder&atilde;o receber apoio financeiro do Poder P&uacute;blico.</p>


<p class="paragrafo" style="text-align: right;"><strong>(Brasil, 1988).</strong></p>


</div>
</div>
</div>
</div>


<p class="paragrafo">Al&eacute;m dos artigos espec&iacute;ficos da educa&ccedil;&atilde;o, encontram-se, ao longo do texto constitucional, refer&ecirc;ncias &agrave; forma&ccedil;&atilde;o de pessoas e categorias profissionais. A quest&atilde;o do trabalho vinculado &agrave; sua forma&ccedil;&atilde;o aparece em outras partes da Constitui&ccedil;&atilde;o: servidores p&uacute;blicos (art. 39, &sect; 2&ordm;), trabalhadores da sa&uacute;de (art. 200, inc. III), trabalhadores da cultura (art. 215, &sect; 3&ordm;, inc. III e art. 2160-A, &sect; 2&ordm;, inc. VIII), trabalhadores da ci&ecirc;ncia e tecnologia (art. 218, &sect; 3&ordm; e 4&ordm;), trabalhadores rurais (art. 186), magistrados, militares etc. Curiosamente, embora seja mencionado o plano de carreira e os pisos salariais de docentes e de trabalhadores em educa&ccedil;&atilde;o, n&atilde;o h&aacute; men&ccedil;&atilde;o sobre a sua forma&ccedil;&atilde;o.</p>


<p class="paragrafo">Merece destaque o refor&ccedil;o do <strong>direito &agrave; educa&ccedil;&atilde;o</strong>&nbsp;e &agrave; <strong>profissionaliza&ccedil;&atilde;o</strong>&nbsp;da crian&ccedil;a, adolescente e jovem (art. 227); o apoio &agrave;s institui&ccedil;&otilde;es de ci&ecirc;ncia e tecnologia (onde est&atilde;o inclu&iacute;das as redes federais, estaduais e privadas de EPT) e a forma&ccedil;&atilde;o de recursos humanos para as empresas na &aacute;rea de ci&ecirc;ncia, tecnologia e inova&ccedil;&atilde;o (art. 218 a 219-B).</p>


<div id="recursos-azul">
<div id="box-refletir">
<div class="box-refletir-blue">
<div class="header-box-refletir">
<p class="caixa-de-destaque-titulo titulo"><span>Artigos selecionados da Constitui&ccedil;&atilde;o referentes &agrave; Ci&ecirc;ncia e Tecnologia</span></p>
</div>
<div class="box-refletir-container">

<strong>Art. 218.</strong> O Estado promover&aacute; e incentivar&aacute; o desenvolvimento cient&iacute;fico, a pesquisa, a capacita&ccedil;&atilde;o cient&iacute;fica e tecnol&oacute;gica e a inova&ccedil;&atilde;o.<br />&hellip;<br />&sect; 2&ordm; A pesquisa tecnol&oacute;gica voltar-se-&aacute; preponderantemente para a solu&ccedil;&atilde;o dos problemas brasileiros e para o desenvolvimento do sistema produtivo nacional e regional.<br />&sect; 3&ordm; O Estado apoiar&aacute; a forma&ccedil;&atilde;o de recursos humanos nas &aacute;reas de ci&ecirc;ncia, pesquisa, tecnologia e inova&ccedil;&atilde;o, inclusive por meio do apoio &agrave;s atividades de extens&atilde;o tecnol&oacute;gica, e conceder&aacute; aos que delas se ocupem meios e condi&ccedil;&otilde;es especiais de trabalho<br />&sect; 4&ordm; A lei apoiar&aacute; e estimular&aacute; as empresas que invistam em pesquisa, cria&ccedil;&atilde;o de tecnologia adequada ao Pa&iacute;s, forma&ccedil;&atilde;o e aperfei&ccedil;oamento de seus recursos humanos e que pratiquem sistemas de remunera&ccedil;&atilde;o que assegurem ao empregado, desvinculada do sal&aacute;rio, participa&ccedil;&atilde;o nos ganhos econ&ocirc;micos resultantes da produtividade de seu trabalho.<br />&sect; 5&ordm; &Eacute; facultado aos Estados e ao Distrito Federal vincular parcela de sua receita or&ccedil;ament&aacute;ria a entidades p&uacute;blicas de fomento ao ensino e &agrave; pesquisa cient&iacute;fica e tecnol&oacute;gica.<br />&sect; 6&ordm; O Estado, na execu&ccedil;&atilde;o das atividades previstas no caput, estimular&aacute; a articula&ccedil;&atilde;o entre entes, tanto p&uacute;blicos quanto privados, nas diversas esferas de governo<br />&sect; 7&ordm; O Estado promover&aacute; e incentivar&aacute; a atua&ccedil;&atilde;o no exterior das institui&ccedil;&otilde;es p&uacute;blicas de ci&ecirc;ncia, tecnologia e inova&ccedil;&atilde;o, com vistas &agrave; execu&ccedil;&atilde;o das atividades previstas no caput.<br />
<p>&nbsp;</p>
<p class="paragrafo"><strong>Art. 219.</strong> O mercado interno integra o patrim&ocirc;nio nacional e ser&aacute; incentivado de modo a viabilizar o desenvolvimento cultural e socioecon&ocirc;mico, o bem-estar da popula&ccedil;&atilde;o e a autonomia tecnol&oacute;gica do Pa&iacute;s, nos termos de lei federal.<br />Par&aacute;grafo &uacute;nico. O Estado estimular&aacute; a forma&ccedil;&atilde;o e o fortalecimento da inova&ccedil;&atilde;o nas empresas, bem como nos demais entes, p&uacute;blicos ou privados, a constitui&ccedil;&atilde;o e a manuten&ccedil;&atilde;o de parques e polos tecnol&oacute;gicos e de demais ambientes promotores da inova&ccedil;&atilde;o, a atua&ccedil;&atilde;o dos inventores independentes e a cria&ccedil;&atilde;o, absor&ccedil;&atilde;o, difus&atilde;o e transfer&ecirc;ncia de tecnologia</p>


<p class="paragrafo"><strong>Art. 219-A.</strong> A Uni&atilde;o, os Estados, o Distrito Federal e os Munic&iacute;pios poder&atilde;o firmar instrumentos de coopera&ccedil;&atilde;o com &oacute;rg&atilde;os e entidades p&uacute;blicos e com entidades privadas, inclusive para o compartilhamento de recursos humanos especializados e capacidade instalada, para a execu&ccedil;&atilde;o de projetos de pesquisa, de desenvolvimento cient&iacute;fico e tecnol&oacute;gico e de inova&ccedil;&atilde;o, mediante contrapartida financeira ou n&atilde;o financeira assumida pelo ente benefici&aacute;rio, na forma da lei</p>


<p class="paragrafo" style="text-align: right;"><strong>(Brasil, 1988).</strong></p>


</div>
</div>
</div>
</div>


<p class="paragrafo">Finalizando, o <a rel="noopener" href="https://www.jusbrasil.com.br/topicos/10639039/artigo-22-da-constituicao-federal-de-1988?msockid=0412fca326da66d41992e952276b6791" target="_blank">artigo 22</a>, incisos I, XVI e XXIV, respectivamente, estabelecem que &eacute; de compet&ecirc;ncia exclusiva da Uni&atilde;o legislar sobre o trabalho, sobre o sistema de emprego e exerc&iacute;cio das profiss&otilde;es e sobre a educa&ccedil;&atilde;o. Isto significa que a regula&ccedil;&atilde;o e respectivas normas valem para todos os n&iacute;veis da Federa&ccedil;&atilde;o, enquanto prerrogativa do Estado, embora &nbsp;submetidos &agrave; governan&ccedil;a dos sistemas estaduais e municipais. Assim, planos, programas, projetos e a&ccedil;&otilde;es gerais e espec&iacute;ficas, incluindo os respectivos planejamentos, acompanhamento, monitoramento e avalia&ccedil;&atilde;o devem necessariamente seguir as regras nacionais.</p>


<div id="webstories-placeholder" style="display: none; text-align: center; padding: 20px; border: 1px dashed #ccc;">O WebStorie est&aacute; oculto neste ambiente.</div>
<div id="webstories" class="container">
<div class="row justify-content-center justify-content-md-start">
<div class="col-12 col-sm-12 col-md-12 col-lg-12 col-xl-12" style="padding-top: 15px; padding-bottom: 15px;">
<div id="swiffy-animation" class="swiffy-slider slider-item-ratio slider-item-ratio-16x9 slider-nav-visible slider-nav-animation slider-nav-animation-fadein slider-item-first-visible" style="height: 600px;">
<ul id="container1" class="slider-container">
<li id="slide1" class="slide-visible"><img style="object-fit: contain;" src="medias/PP.2_WEB_9 (1).png" alt="..." width="200" /></li>
<li id="slide2"><img style="object-fit: contain;" src="medias/PP.2_WEB_9 (2).png" alt="..." width="200" /></li>
<li id="slide3"><img style="object-fit: contain;" src="medias/PP.2_WEB_9 (3).png" alt="..." width="200" /></li>
<li id="slide4"><img style="object-fit: contain;" src="medias/PP.2_WEB_9 (4).png" alt="..." width="200" /></li>
<li id="slide5"><img style="object-fit: contain;" src="medias/PP.2_WEB_9 (5).png" alt="..." width="200" /></li>
<li id="slide6"><img style="object-fit: contain;" src="medias/PP.2_WEB_9 (6).png" alt="..." width="200" /></li>
</ul>
<button class="slider-nav" style="--swiffy-slider-nav-light: #525AD2; outline: none;" aria-label="Go to previous" type="button"></button> <button class="slider-nav slider-nav-next" style="--swiffy-slider-nav-light: #525AD2; outline: none;" aria-label="Go to next" type="button"></button>
<div class="slider-indicators"><button class="active" aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button></div>
</div>
</div>
</div>
</div>


<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Estruturas da educa&ccedil;&atilde;o<strong><br />Fonte:<span>&nbsp;</span></strong>Prosa (2024e).</p>


<p class="paragrafo">Embora a EPT n&atilde;o seja citada explicitamente como direito na CF/88, pode-se depreender que, ao se referir repetidamente ao direito das pessoas &agrave; educa&ccedil;&atilde;o e ao trabalho (direitos sociais p&eacute;treos) e aos processos de forma&ccedil;&atilde;o, capacita&ccedil;&atilde;o, profissionaliza&ccedil;&atilde;o e &ldquo;qualifica&ccedil;&atilde;o para o trabalho&rdquo;, o texto constitucional consagra a EPT como direito subjetivo. Neste sentido, exige pol&iacute;ticas p&uacute;blicas permanentes, participa&ccedil;&atilde;o e controle social, legisla&ccedil;&atilde;o espec&iacute;fica, forma&ccedil;&atilde;o de profissionais e financiamento p&uacute;blico.</p>


<div id="recursos-azul" class="feat-box-foto">

<p><strong>Resumindo</strong>, embora a educa&ccedil;&atilde;o seja entendida na CF/88 como direito social e subjetivo &ndash; que n&atilde;o prescreve com a idade &ndash;, <strong>as grandes contradi&ccedil;&otilde;es da educa&ccedil;&atilde;o brasileira est&atilde;o presentes no texto constitucional, tanto os objetivos da educa&ccedil;&atilde;o quanto a tens&atilde;o entre o p&uacute;blico e o privado</strong>, al&eacute;m do compartilhamento das responsabilidades e dos recursos entre os entes federados. As sucessivas mudan&ccedil;as nos artigos referentes &agrave; educa&ccedil;&atilde;o expressam as lutas e debates na sociedade, cada vez mais acirradas, no contexto da reestrutura&ccedil;&atilde;o produtiva, da globaliza&ccedil;&atilde;o excludente e da reforma do estado.</p>

</div>

<p>&nbsp;</p>
<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_13.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_16.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 12 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>