<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Pol&iacute;ticas contempor&acirc;neas de EPT (2000-2016)</strong></p>

<p><span style="font-weight: 400;">As pol&iacute;ticas atuais de EPT podem ser analisadas em compara&ccedil;&atilde;o com as anteriores. De fato, as antinomias e as contradi&ccedil;&otilde;es sinalizadas nos cap&iacute;tulos anteriores se materializam nestas pol&iacute;ticas, sendo poss&iacute;vel seguir o &ldquo;fio da meada&rdquo; conceitual. As tr&ecirc;s quest&otilde;es centrais &ndash; objetivos da Educa&ccedil;&atilde;o Profissional, curr&iacute;culos/metodologias e financiamento (tens&atilde;o p&uacute;blico x privado) &ndash; sempre est&atilde;o presentes, adquirindo formas diferentes a partir das correla&ccedil;&otilde;es de for&ccedil;a no campo.</span></p>
<p><span style="font-weight: 400;">No final dos anos 1990 e in&iacute;cio dos anos 2000, a concep&ccedil;&atilde;o da EPT instrumental para atender o mercado de trabalho e para &ldquo;compensar&rdquo; a falta de emprego decorrente da crise econ&ocirc;mica</span>&nbsp;era hegem&ocirc;nica<span style="font-weight: 400;">, e a </span><span style="font-weight: 400; background-color: #bfedd2;">separa&ccedil;&atilde;o entre Educa&ccedil;&atilde;o B&aacute;sica e Profissional e a expans&atilde;o da EPT via setor privado <span style="font-weight: 400;">eram expl&iacute;citas</span></span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">.</span> Assim s&atilde;o explicadas a:</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><strong>Separa&ccedil;&atilde;o de tarefas</strong><span style="font-weight: 400;">&nbsp;entre Minist&eacute;rio da Educa&ccedil;&atilde;o (cursos t&eacute;cnicos de n&iacute;vel m&eacute;dio e superior) e Minist&eacute;rio do Trabalho (cursos de curta dura&ccedil;&atilde;o, sem vincula&ccedil;&atilde;o com a escolaridade);<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>Cria&ccedil;&atilde;o do Programa de Expans&atilde;o da Educa&ccedil;&atilde;o Profissional</strong><span style="font-weight: 400;"> (Proep/MEC), focado na cria&ccedil;&atilde;o de unidades escolares geridas por organiza&ccedil;&otilde;es sociais &ndash; privadas &ndash; financiadas com recursos p&uacute;blicos e na proibi&ccedil;&atilde;o da expans&atilde;o das redes federal e estadual p&uacute;blicas;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>Cria&ccedil;&atilde;o do Plano Nacional de Qualifica&ccedil;&atilde;o Do Trabalhador</strong><span style="font-weight: 400;">&nbsp;(Planfor), focado na oferta de cursos de qualifica&ccedil;&atilde;o de curta dura&ccedil;&atilde;o com recursos p&uacute;blicos (Fundo de Amparo ao Trabalhador - FAT) executados por entidades privadas, com destaque para o SENAI e SENAC.</span></li>
</ul>
<p><span style="font-weight: 400;">J&aacute; a partir de 2003, a concep&ccedil;&atilde;o de EPT assumida pelo Governo Federal e por diversos estados foi a de uma </span><span style="font-weight: 400; background-color: #bfedd2;">perspectiva emancipat&oacute;ria vinculada ao desenvolvimento nacional, com forma&ccedil;&atilde;o integral (social e profissional, proped&ecirc;utica e t&eacute;cnica); com &ecirc;nfase na forma de articula&ccedil;&atilde;o integrada ao Ensino M&eacute;dio e no financiamento das redes p&uacute;blicas.</span><span style="font-weight: 400;">&nbsp;O que explica:&nbsp;</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A </span><strong>revoga&ccedil;&atilde;o das normativas</strong><span style="font-weight: 400;">&nbsp;que impediam a expans&atilde;o da rede federal e dificultavam a forma de articula&ccedil;&atilde;o integrada;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O </span><strong>Programa de Expans&atilde;o da Rede Federal</strong><span style="font-weight: 400;">, interiorizando a oferta federal por meio da cria&ccedil;&atilde;o dos Institutos Federais de Educa&ccedil;&atilde;o, Ci&ecirc;ncia e Tecnologia (IFs);<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O </span><strong>Programa Brasil Profissionalizado</strong>,<span style="font-weight: 400;"> de fomento &agrave;s redes p&uacute;blicas estaduais, com &ecirc;nfase na oferta de cursos t&eacute;cnicos integrados ao n&iacute;vel m&eacute;dio;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A extin&ccedil;&atilde;o do Planfor, substitu&iacute;do pelo </span><strong>Programa Nacional de Qualifica&ccedil;&atilde;o</strong><span style="font-weight: 400;">&nbsp;(PNQ), em 2003, com concep&ccedil;&atilde;o direcionada para a forma&ccedil;&atilde;o social e profissional de grupos de trabalhadores mais vulner&aacute;veis, com maior carga hor&aacute;ria e menor volume de recursos;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A cria&ccedil;&atilde;o de </span><strong>normativas regulat&oacute;rias</strong> <span style="font-weight: 400;"><strong>que fortaleceram a institucionalidade da EPT</strong>, como a modifica&ccedil;&atilde;o do artigo 39 da LDBEN, espec&iacute;fico sobre a Educa&ccedil;&atilde;o Profissional, alterado pela </span><span style="font-weight: 400;"><a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2007-2010/2008/Lei/L11741.htm" target="_blank">Lei n&ordm; 11.741/2008</a></span><span style="font-weight: 400;">,&nbsp; o Cat&aacute;logo Nacional de Cursos T&eacute;cnicos (CNCT, 1&ordf; vers&atilde;o em 2008) e seu correlato para cursos superiores de Tecnologia (CNCST, 1&ordf; vers&atilde;o em 2006);<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A cria&ccedil;&atilde;o do Programa Nacional de Integra&ccedil;&atilde;o da Educa&ccedil;&atilde;o Profissional com a Educa&ccedil;&atilde;o B&aacute;sica na Modalidade de Educa&ccedil;&atilde;o de Jovens e Adultos </span><strong>(PROEJA)</strong><span style="font-weight: 400;">;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A </span><strong>representa&ccedil;&atilde;o de trabalhadores</strong><span style="font-weight: 400;"> nos Conselhos Nacionais e Estaduais dos Servi&ccedil;os de Aprendizagem (2007) e os &ldquo;Acordos de Gratuidade&rdquo; (2008) &ndash; amplia&ccedil;&atilde;o gradativa da oferta de cursos gratuitos por estas entidades &ndash;, com o debate sobre o alinhamento da oferta de cursos aos projetos de desenvolvimento nacional.</span></li>
</ul>
<p><span style="font-weight: 400;">Deve ser ressaltado que o esfor&ccedil;o quanto &agrave; institucionaliza&ccedil;&atilde;o da pol&iacute;tica p&uacute;blica de Educa&ccedil;&atilde;o Profissional, no sentido de torn&aacute;-la de Estado, supera um passado recorrente de a&ccedil;&otilde;es circunscritas ao tempo de governo. Em alian&ccedil;a com os pa&iacute;ses africanos e europeus progressistas, o Brasil e os pa&iacute;ses do Mercosul, na 93&ordf; Confer&ecirc;ncia Geral da Organiza&ccedil;&atilde;o Internacional do Trabalho (&ldquo;Uma globaliza&ccedil;&atilde;o Justa, criando oportunidade para todos&rdquo;), mantiveram a qualifica&ccedil;&atilde;o profissional como direito a ser negociado de forma tripartite na </span><a rel="noopener" href="https://www.oitcinterfor.org/sites/default/files/edit/docref/rec195.pdf" target="_blank"><span style="font-weight: 400;">Recomenda&ccedil;&atilde;o 195</span></a><span style="font-weight: 400;">&nbsp;&ndash; &ldquo;Sobre o desenvolvimento dos Recursos Humanos: Educa&ccedil;&atilde;o, Forma&ccedil;&atilde;o e Aprendizagem Permanente&rdquo;.</span></p>
<p><span style="font-weight: 400;">No Brasil, al&eacute;m das normativas citadas, a cria&ccedil;&atilde;o dos Institutos Federais de Educa&ccedil;&atilde;o, Ci&ecirc;ncia e Tecnologia (IFs) vinculados ao desenvolvimento inclusivo territorial, substituindo os antigos CEFETS e Escolas T&eacute;cnicas e Agrot&eacute;cnicas, e a emerg&ecirc;ncia das redes p&uacute;blicas estaduais, sobretudo no Nordeste, possibilitou a cria&ccedil;&atilde;o de centenas de unidades pelo Brasil afora. Logo, as redes p&uacute;blicas em seu conjunto tornaram-se n&atilde;o s&oacute; as maiores ofertantes de cursos t&eacute;cnicos de n&iacute;vel m&eacute;dio do pa&iacute;s, com foco na forma de articula&ccedil;&atilde;o integrada ao Ensino M&eacute;dio e &agrave; EJA, mas as mais <span class="primary-color"><strong>capilares</strong>&nbsp;<button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="O termo 'capilaridade' se refere &agrave; qualidade daquilo que &eacute; capaz de instalar-se e funcionar simultaneamente em diversos espa&ccedil;os de m&uacute;ltiplos tamanhos."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span></span><strong></strong><span style="font-weight: 400;">&nbsp;tamb&eacute;m. Discutiremos esses resultados a partir da apresenta&ccedil;&atilde;o e discuss&atilde;o de dados, ainda neste t&oacute;pico.</span></p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/53297908723_6524939c1c_c (1).jpg" alt="" width="85%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Amplia&ccedil;&atilde;o do acesso &agrave; EPT<strong><br />Fonte: </strong>Sch&uuml;ler (2023b).</p>
<p><span style="font-weight: 400;">Essas iniciativas aumentaram o capital do polo n&atilde;o hegem&ocirc;nico, com alguns agentes passando de coadjuvantes e figurantes a protagonistas, em particular no espa&ccedil;o p&uacute;blico. A EPT passou a ser vista como uma </span><strong>pol&iacute;tica estrat&eacute;gica, permanente, essencial para o desenvolvimento do pa&iacute;s</strong><span style="font-weight: 400;">. Esse processo significou uma diferen&ccedil;a fundamental em rela&ccedil;&atilde;o aos programas e planos anteriores e posteriores, entretanto a crise pol&iacute;tica, a necessidade de manter a governabilidade e a capacidade do polo hegem&ocirc;nico de se adaptar, utilizando o capital pr&eacute;-existente, levou a recuos e a </span><strong>&ldquo;solu&ccedil;&otilde;es de compromisso&rdquo;</strong><span style="font-weight: 400;">. Esses se expressam em programas que, se de in&iacute;cio pareciam atender aos interesses dos dois polos, desenvolveram-se para atender quase exclusivamente ao polo hegem&ocirc;nico, como demonstram o ProJovem e o PRONATEC.</span></p>
<p><span style="font-weight: 400;">O Programa Nacional de Inclus&atilde;o de Jovens </span><strong>(ProJovem)</strong><span style="font-weight: 400;">, de 2005, foi concebido como programa especial de</span><span style="font-weight: 400;"> </span><span style="font-weight: 400;">oferta de Educa&ccedil;&atilde;o Profissional integrada &agrave; EJA para um p&uacute;blico espec&iacute;fico: jovens que, nas estat&iacute;sticas, pertenciam ao segmento que n&atilde;o trabalhava, n&atilde;o estudava e n&atilde;o tinha conclu&iacute;do o Ensino Fundamental.</span><strong> </strong><span style="font-weight: 400;">O curr&iacute;culo inovador, o material did&aacute;tico de excelente qualidade, as estrat&eacute;gias metodol&oacute;gicas ousadas de perman&ecirc;ncia e a intersetorialidade entre trabalho, educa&ccedil;&atilde;o e assist&ecirc;ncia social n&atilde;o resistiram &agrave; l&oacute;gica da execu&ccedil;&atilde;o em larga escala realizada por estados e munic&iacute;pios, com muitos deles terceirizando esse processo para as entidades privadas. Com uma multiplicidade de entidades executoras, sem vincula&ccedil;&atilde;o obrigat&oacute;ria com as secretarias de educa&ccedil;&atilde;o, o Projovem passou a competir com a oferta permanente de EJA. Em 2008, houve uma atualiza&ccedil;&atilde;o, segmentando mais os p&uacute;blicos, mas a a&ccedil;&atilde;o perdeu prioridade e foi incorporada, em escala bem menor, pelo Minist&eacute;rio da Educa&ccedil;&atilde;o.</span></p>
<p><span style="font-weight: 400;">O Programa Nacional de Acesso ao Ensino T&eacute;cnico e ao Emprego </span><strong>(PRONATEC)</strong><span style="font-weight: 400;"> significou uma concess&atilde;o bem maior. J&aacute; na sua primeira vers&atilde;o, em 2009, abriu espa&ccedil;o para que um eterno protagonista do campo se recuperasse, na medida em que permitiu aos Servi&ccedil;os Nacionais de Aprendizagem retomarem o acesso ao financiamento p&uacute;blico em larga escala.</span></p>
<p><span style="font-weight: 400;">O PRONATEC visava integrar a&ccedil;&otilde;es de diversos minist&eacute;rios e alinhar provedores de cursos t&eacute;cnicos &agrave;s pol&iacute;ticas de desenvolvimento inclusivo. Em sua fase inicial (2009), promoveu um in&eacute;dito alinhamento entre as demandas das secretarias de Educa&ccedil;&atilde;o, Ci&ecirc;ncia e Tecnologia e a oferta de cursos por institui&ccedil;&otilde;es federais, estaduais e os Servi&ccedil;os Nacionais de Aprendizagem. A vers&atilde;o subsequente, j&aacute; em 2011, ampliou as concess&otilde;es incluindo munic&iacute;pios e redes privadas, sendo que o foco se deslocou da oferta de cursos t&eacute;cnicos de n&iacute;vel m&eacute;dio para os de qualifica&ccedil;&atilde;o de curta dura&ccedil;&atilde;o.&nbsp;</span></p>
<p><span style="font-weight: 400;">Os impactos se fizeram sentir naquelas institui&ccedil;&otilde;es de EPT e nos estados que consideraram o PRONATEC a sua principal a&ccedil;&atilde;o e n&atilde;o como complementar a uma estrat&eacute;gia mais ampla. Nestes casos, as redes se fragilizaram e perderam autonomia e capital no campo, o que, na pr&aacute;tica, gerou a diminui&ccedil;&atilde;o de recursos destinados &agrave; expans&atilde;o e &agrave; consolida&ccedil;&atilde;o das redes p&uacute;blicas. </span><span style="font-weight: 400; background-color: #bfedd2;">A falta de estudos sobre demanda de diferentes metodologias, a aus&ecirc;ncia de um sistema de avalia&ccedil;&atilde;o da qualidade dos cursos ofertados, as assimetrias da capacidade de execu&ccedil;&atilde;o das institui&ccedil;&otilde;es ofertantes e a n&atilde;o aten&ccedil;&atilde;o &agrave;s varia&ccedil;&otilde;es regionais levaram a n&atilde;o se alcan&ccedil;ar os objetivos originais do programa</span><span style="font-weight: 400;">,&nbsp;que n&atilde;o foi extinto formalmente, mas teve seus recursos diminu&iacute;dos nos anos subsequentes, sendo utilizados saldos remanescentes de repasses anteriores.</span></p>
<p><span style="font-weight: 400;">As tens&otilde;es entre os diferentes interesses e concep&ccedil;&otilde;es se fizeram presentes em outros terrenos, como o da certifica&ccedil;&atilde;o profissional. A certifica&ccedil;&atilde;o de saberes adquiridos na vida e no trabalho come&ccedil;ou a ser discutida no final dos anos 1990, a partir de uma perspectiva excludente, sendo a discuss&atilde;o retomada por iniciativa do Minist&eacute;rio do Trabalho em 2003, estendendo-se at&eacute; 2007. Apesar de intensos debates, a proposta do Sistema Nacional de Certifica&ccedil;&atilde;o Profissional que articulava o reconhecimento gratuito, de car&aacute;ter inclusivo e articulado com o Sistema de Educa&ccedil;&atilde;o para a eleva&ccedil;&atilde;o de escolaridade e com o Sistema P&uacute;blico de Emprego, Trabalho e Renda para reinser&ccedil;&atilde;o laboral n&atilde;o se efetivou. Somente em 2009, foi criada a rede </span><strong>Certifica</strong><span style="font-weight: 400;">, restrita aos IFs e posteriormente atualizada em 2014, com a participa&ccedil;&atilde;o dos Servi&ccedil;os Nacionais de Aprendizagem, que j&aacute; atuavam neste terreno a partir das experi&ecirc;ncias <span class="primary-color"><strong>anglo-sax&ocirc;nicas</strong>&nbsp;<button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Anglo-sax&otilde;es eram povos germ&acirc;nicos oriundos de algumas regi&otilde;es da Europa, como Reino Unido, Austr&aacute;lia e Nova Zel&acirc;ndia."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span></span><span style="font-weight: 400;">&nbsp;de car&aacute;ter excludente.</span></p>
<p><span style="font-weight: 400;">Outra sinaliza&ccedil;&atilde;o da for&ccedil;a do polo hegem&ocirc;nico e da capacidade do polo n&atilde;o hegem&ocirc;nico de se contrapor foi a elabora&ccedil;&atilde;o das </span><strong>Diretrizes Nacionais do Ensino M&eacute;dio</strong><a rel="noopener" href="http://portal.mec.gov.br/index.php?option=com_docman&amp;view=download&amp;alias=9917-rceb002-12-1&amp;Itemid=30192" target="_blank"><span style="font-weight: 400;"> (</span><span style="font-weight: 400;">Resolu&ccedil;&atilde;o CNE/CEB 02/2012)</span></a><span style="font-weight: 400;">, que tratou da especificidade do Ensino M&eacute;dio integrado, e das </span><strong>Diretrizes Nacionais da Educa&ccedil;&atilde;o Profissional</strong><span style="font-weight: 400;">&nbsp;(</span><a rel="noopener" href="http://portal.mec.gov.br/index.php?option=com_docman&amp;view=download&amp;alias=11663-rceb006-12-pdf&amp;category_slug=setembro-2012-pdf&amp;Itemid=30192" target="_blank"><span style="font-weight: 400;">Resolu&ccedil;&atilde;o CNE/CEB 06/2012</span></a><span style="font-weight: 400;">), no &acirc;mbito do Conselho Nacional de Educa&ccedil;&atilde;o (CNE). Em particular na segunda resolu&ccedil;&atilde;o citada, podem ser observadas &ldquo;solu&ccedil;&otilde;es de compromisso&rdquo;, ou seja, a presen&ccedil;a de interesses dos dois polos.</span></p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.5_INF_5.png" alt="Projetos de menor porte, alcance e/ou dura&ccedil;&atilde;o vinculados &agrave; EPT" width="90%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: <span style="font-weight: 400;">Projetos de menor porte, alcance e/ou dura&ccedil;&atilde;o vinculados &agrave; EPT</span></strong><br /><strong>Fonte: <span style="font-weight: 400;">Prosa (2025f).</span></strong></p>
<p><span style="font-weight: 400;">&Eacute; importante ressaltar que essas disputas n&atilde;o eram (e n&atilde;o s&atilde;o) exclusivas do campo qualifica&ccedil;&atilde;o. Elas refletem a luta geral que ocorria na sociedade, com concess&otilde;es e avan&ccedil;os do polo hegem&ocirc;nico em todos os espa&ccedil;os sociais. No que diz respeito &agrave; EPT, embora o resultado tenha sido um realinhamento e um fortalecimento do polo hegem&ocirc;nico, as a&ccedil;&otilde;es anteriores colocaram em cena as redes p&uacute;blicas e, com elas, milhares de docentes e centenas de milhares de estudantes, cujas pr&aacute;ticas demonstraram a possibilidade de uma EPT emancipat&oacute;ria nos cantos mais rec&ocirc;nditos locais do pa&iacute;s. Tais pr&aacute;ticas, analisadas em pesquisas cient&iacute;ficas rigorosas, constitu&iacute;ram um volume consider&aacute;vel de capital. N&atilde;o seria poss&iacute;vel, a partir da&iacute;, ignorar a exist&ecirc;ncia desses espa&ccedil;os p&uacute;blicos e de seus intelectuais org&acirc;nicos que questionaram (e questionam) o pensamento hegem&ocirc;nico sobre a EPT, n&atilde;o apenas no plano te&oacute;rico, mas com evid&ecirc;ncias emp&iacute;ricas robustas.</span></p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_39.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_41.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 31 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>