<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Reformas de base e rea&ccedil;&atilde;o ultraconservadora</strong></p>


<p class="paragrafo">A LDB de 1961 (<a rel="noopener" href="https://www2.camara.leg.br/legin/fed/lei/1960-1969/lei-4024-20-dezembro-1961-353722-publicacaooriginal-1-pl.html" target="_blank">Lei n&ordm; 4.024/61</a>) foi criada em um per&iacute;odo de transi&ccedil;&atilde;o pol&iacute;tica, ap&oacute;s a ren&uacute;ncia do presidente J&acirc;nio Quadros e a ascens&atilde;o do vice-presidente Jo&atilde;o Goulart. Prevista na Constitui&ccedil;&atilde;o de 1946, levou 15 anos para ser promulgada. O ambiente era de fortes tens&otilde;es e lutas por reformas sociais e educacionais.</p>


<p class="paragrafo">Neste sentido, a LDB/61 incorporou diversos princ&iacute;pios do <strong>movimento escolanovista</strong>, que defendia uma educa&ccedil;&atilde;o mais democr&aacute;tica e voltada para o desenvolvimento do estudante, sendo criticada pelos setores conservadores, incluindo as escolas confessionais (vinculadas a institui&ccedil;&otilde;es religiosas, majoritariamente a igreja cat&oacute;lica) e pelos setores empresariais, beneficiados pelas reformas Capanema, implementadas durante a ditadura varguista, cujo legado inclui a cria&ccedil;&atilde;o dos Servi&ccedil;os de Aprendizagem Industrial e Comercial (SENAI e SENAC).</p>


<p class="paragrafo"><span style="background-color: #bfedd2;">O foco estava na forma&ccedil;&atilde;o humanista e na valoriza&ccedil;&atilde;o da educa&ccedil;&atilde;o como um direito social</span>, o que &eacute; um avan&ccedil;o consider&aacute;vel. A lei buscou descentralizar a administra&ccedil;&atilde;o da educa&ccedil;&atilde;o, permitindo maior autonomia para estados e munic&iacute;pios, al&eacute;m de promover a diversifica&ccedil;&atilde;o das modalidades de ensino. No que se refere &agrave; Educa&ccedil;&atilde;o Profissional (cap&iacute;tulo III, do &ldquo;Ensino T&eacute;cnico&rdquo;), ela era vista como uma modalidade que deveria ser integrada ao curr&iacute;culo de etapas da Educa&ccedil;&atilde;o B&aacute;sica: &ldquo;gin&aacute;sio&rdquo; (equivalente aos anos finais do Ensino Fundamental) e &ldquo;colegial&rdquo; (equivalente ao Ensino M&eacute;dio), enquanto um complemento &agrave; forma&ccedil;&atilde;o geral.</p>
<p class="paragrafo" style="text-align: center;"><img src="medias/ginasiovocacional.jpeg" alt="" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo:&nbsp;</strong>Atividades de Artes Pl&aacute;sticas desenvolvidas por professores e estudantes do Gin&aacute;sio Vocacional Candido Portinari, Batatais/SP<br /><strong>Fonte: </strong>Acervo CEDIC-PUC (1966).<br /><strong>Elabora&ccedil;&atilde;o: </strong>Memorial da Resist&ecirc;ncia de S&atilde;o Paulo.</p>

<p class="paragrafo">Embora houvesse a possibilidade de cursar o Ensino Superior, essa dualidade estrutural persistia. Tal dualidade nasceu no Brasil Col&ocirc;nia, com a divis&atilde;o da popula&ccedil;&atilde;o entre escravos, trabalhadores livres e elites, atravessou o Brasil Imp&eacute;rio, acrescentando os &ldquo;&oacute;rf&atilde;os e desvalidos&rdquo;, e fortaleceu-se no Brasil Rep&uacute;blica, com a perman&ecirc;ncia da separa&ccedil;&atilde;o entre os trabalhadores e as elites. Assim, tornou-se um elemento constante na educa&ccedil;&atilde;o brasileira.</p>


<p class="paragrafo">Mesmo assim, os setores conservadores (em particular os empresariais) fizeram cr&iacute;ticas &agrave; nova LDBEN (<a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/leis/l9394.htm" target="_blank">Lei n&ordm; 9394/1996</a>), principalmente quanto &agrave; falta de defini&ccedil;&atilde;o de diretrizes ou objetivos espec&iacute;ficos voltados ao atendimento das demandas do mercado de trabalho. Entretanto, por meio dos cursos de aprendizagem com terminalidade no ensino secund&aacute;rio, a previs&atilde;o da participa&ccedil;&atilde;o das empresas sinalizava certa orienta&ccedil;&atilde;o para o mercado.</p>


<p class="paragrafo">A <a rel="noopener" href="https://www.camara.leg.br/proposicoesWeb/prop_mostrarintegra?codteor=713997&amp;filename=LegislacaoCitada+-PL+6416/2009" target="_blank">Lei n&ordm; 5.692/71</a> foi promulgada durante o regime militar (1964-1985), um per&iacute;odo ditatorial marcado por repress&atilde;o pol&iacute;tica e censura. <span style="background-color: #bfedd2;">A educa&ccedil;&atilde;o foi utilizada como ferramenta para consolidar o controle social e promover os valores do regime, buscando formar &ldquo;cidad&atilde;os&rdquo; que se encaixassem nos padr&otilde;es desejados pelo regime ditatorial militar</span>. Dentro deste per&iacute;odo, suprimiu-se do curr&iacute;culo escolar as disciplinas de Sociologia e de Filosofia e foram inclu&iacute;das disciplinas que promoviam valores &eacute;ticos alinhados ao Estado, como Educa&ccedil;&atilde;o Moral e C&iacute;vica e Organiza&ccedil;&atilde;o Social e Pol&iacute;tica do Brasil. Nesse caminho, foram proibidos, nas demais disciplinas, autores, textos, met&aacute;foras ou qualquer atividade ou alus&atilde;o feitas contra a ditadura.</p>


<p class="paragrafo">Revogando praticamente todos os artigos da LDB/61, estabeleceu-se uma nova organiza&ccedil;&atilde;o educacional no pa&iacute;s, a Lei n&ordm; 5.692/71, que promoveu a unifica&ccedil;&atilde;o do ensino prim&aacute;rio e ginasial em um &uacute;nico ciclo de 1&ordm; grau, alterando a estrutura educacional anterior, eliminando exames de admiss&atilde;o e enfatizando uma forma&ccedil;&atilde;o t&eacute;cnica e profissional alinhada &agrave;s necessidades do mercado de trabalho e &agrave; <strong>l&oacute;gica produtivista</strong>&nbsp;do governo militar. Ao mesmo tempo, determinou-se que os curr&iacute;culos dos cursos de 2&ordm; grau deveriam incluir disciplinas preparat&oacute;rias para o mercado de trabalho &ndash; com base em levantamentos peri&oacute;dicos das necessidades locais ou regionais. Isso significava ent&atilde;o que as escolas deveriam adaptar sua oferta educacional &agrave;s demandas do mercado.</p>


<p class="paragrafo">Em contraste &agrave; LDB/61, a Lei n&ordm; 5.692/71 definia o ensino t&eacute;cnico como uma parte essencial do ensino de 2&ordm; grau que deveria incluir a habilita&ccedil;&atilde;o profissional, enfatizando-a como um objetivo central. A <strong>profissionaliza&ccedil;&atilde;o compuls&oacute;ria</strong>, que aparentemente eliminava a dualidade estrutural, transformaria todo o ensino secund&aacute;rio brasileiro em ensino t&eacute;cnico, por&eacute;m n&atilde;o foi isso que aconteceu: as escolas da elite continuaram com seus curr&iacute;culos amplos formadores da classe dirigente e as escolas p&uacute;blicas, sem estrutura, financiamento e professores, ofertaram cursos prec&aacute;rios.</p>


<p class="paragrafo">Dentre outras normativas do per&iacute;odo, devem ser citadas a <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/LEIS/L6545.htm#:~:text=Disp%C3%B5e%20sobre%20a%20transforma%C3%A7%C3%A3o%20das%20Escolas%20T%C3%A9cnicas%20Federais,Federais%20de%20Educa%C3%A7%C3%A3o%20Tecnol%C3%B3gica%20e%20d%C3%A1%20outras%20provid%C3%AAncias" target="_blank">Lei n&ordm; 6.545/78</a> e o <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/decreto/1980-1989/d87310.htm" target="_blank">Decreto n&ordm; 87.310/82</a> que a regulamenta, relativos &agrave; transforma&ccedil;&atilde;o de tr&ecirc;s escolas t&eacute;cnicas federais (MG, PR e RJ) em centros de educa&ccedil;&atilde;o federal, permitindo-lhes oferecer cursos tecnol&oacute;gicos de n&iacute;vel superior. Segundo a professora <span class="primary-color"><strong>Silvia Manfredi</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Prof&ordf;. Dra. livre-docente aposentada da FE-Unicamp e pesquisadora refer&ecirc;ncia em hist&oacute;ria da Educa&ccedil;&atilde;o Profissional."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>, em seu livro <em>Educa&ccedil;&atilde;o Profissional no Brasil: atores e cen&aacute;rios ao longo da hist&oacute;ria</em>&nbsp;&ndash; leitura considerada obrigat&oacute;ria para quem quer compreender os processos que moldaram a EPT no Brasil &ndash;, a Educa&ccedil;&atilde;o Profissional de qualidade sobreviveu apenas nas escolas t&eacute;cnicas e agrot&eacute;cnicas.</p>


<p class="paragrafo">O modelo compuls&oacute;rio, que acentuou a <strong>precariza&ccedil;&atilde;o social e educacional</strong> da escola p&uacute;blica, teve a sua <span class="primary-color"><strong>"p&aacute;-de-cal"</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Express&atilde;o que significa encerrar, finalizar.
"> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;com a <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/Leis/L7044.htm" target="_blank">Lei n&ordm; 7.044/82</a>, que, na pr&aacute;tica, retorna ao modelo anterior de separa&ccedil;&atilde;o entre os cursos t&eacute;cnicos e cursos proped&ecirc;uticos. A luta pela forma&ccedil;&atilde;o integral e pela Educa&ccedil;&atilde;o Profissional p&uacute;blica teve continuidade, junto com as lutas pela redemocratiza&ccedil;&atilde;o, desaguando nas lutas por uma LDB democr&aacute;tica, ainda que restrita, e al&eacute;m dela, como ser&aacute; visto no pr&oacute;ximo item.</p>
<p class="content paragrafo quote citacao-curta strong"><span style="font-size: 24pt;"><strong>Democracia e neoliberalismo</strong></span></p>


<p class="paragrafo">No segundo cap&iacute;tulo, foi discutido o contexto da elabora&ccedil;&atilde;o da LDBEN/1996 (<a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/Leis/L9394.htm" target="_blank">Lei 9.394/96</a>), o da redemocratiza&ccedil;&atilde;o e o da continuidade das lutas entre os setores progressistas e conservadores. Contudo, a vit&oacute;ria relativa que resultou na &ldquo;Constitui&ccedil;&atilde;o Cidad&atilde;&rdquo; de 1988 n&atilde;o implicou em avan&ccedil;os imediatos na educa&ccedil;&atilde;o. Como foi visto anteriormente, o processo de elabora&ccedil;&atilde;o da LDBEN foi arrastado por anos, com voltas e reviravoltas, at&eacute; 1996. No que se refere &agrave; Educa&ccedil;&atilde;o Profissional, a LDBEN trouxe novidades auspiciosas, ainda que o cap&iacute;tulo terceiro (da &ldquo;Educa&ccedil;&atilde;o Profissional&rdquo;) apresentasse lacunas que foram aproveitadas para uma regulamenta&ccedil;&atilde;o conservadora, principalmente por meio do <a rel="noopener" href="http://portal.mec.gov.br/setec/arquivos/pdf/DF2208_97.pdf" target="_blank">Decreto n&ordm; 2.208/97</a>.</p>


<p class="paragrafo"><span style="background-color: #bfedd2;">A LDBEN/1996 reconheceu a Educa&ccedil;&atilde;o Profissional como uma modalidade da Educa&ccedil;&atilde;o B&aacute;sica. </span>Ao substituir &ldquo;ensino&rdquo; por &ldquo;educa&ccedil;&atilde;o&rdquo;, sinalizou-se a necessidade de conte&uacute;dos, m&eacute;todos e forma&ccedil;&atilde;o de docentes espec&iacute;ficos que, embora se relacionassem com o mundo do trabalho, estavam intimamente vinculados ao campo educacional &ndash; particularmente ao Ensino M&eacute;dio. Ainda que de forma imprecisa, retomava-se, assim, o intuito de <strong>integra&ccedil;&atilde;o da forma&ccedil;&atilde;o t&eacute;cnica &agrave; forma&ccedil;&atilde;o geral.</strong></p>


<p class="paragrafo">Entretanto, as reformas do Ensino M&eacute;dio e da Educa&ccedil;&atilde;o Profissional estavam em curso e intimamente relacionadas ao projeto neoliberal de Estado e de sociedade. No &acirc;mbito dessas reformas, reproduziam-se os debates entre as diversas for&ccedil;as sociais, dentre elas: os trabalhadores representados pelas centrais sindicais; os empres&aacute;rios, representados pelas respectivas confedera&ccedil;&otilde;es e servi&ccedil;os de aprendizagem; as diferentes fac&ccedil;&otilde;es do governo, representados pelo Minist&eacute;rio da Educa&ccedil;&atilde;o (MEC) e pelo Minist&eacute;rio do Trabalho e Emprego (MTE), ent&atilde;o Minist&eacute;rio do Trabalho (MTb).</p>


<p class="paragrafo">As diferentes posi&ccedil;&otilde;es no governo de Fernando Henrique Cardoso (1995-2002) e a posi&ccedil;&atilde;o empresarial conflu&iacute;ram para uma posi&ccedil;&atilde;o hegem&ocirc;nica, que foi implantada n&atilde;o sem a resist&ecirc;ncia dos trabalhadores e da comunidade acad&ecirc;mica. Essa posi&ccedil;&atilde;o caracterizava-se por:</p>


<ol style="list-style-type: lower-alpha;">
<li class="paragrafo">o alinhamento dos cursos com o mercado de trabalho, em detrimento da educa&ccedil;&atilde;o integral;</li>
<li class="paragrafo">o aprofundamento da dualidade estrutural da educa&ccedil;&atilde;o;</li>
<li class="paragrafo">a separa&ccedil;&atilde;o da Educa&ccedil;&atilde;o B&aacute;sica da Educa&ccedil;&atilde;o Profissional;</li>
<li class="paragrafo">a desvincula&ccedil;&atilde;o da qualifica&ccedil;&atilde;o profissional da eleva&ccedil;&atilde;o da escolaridade;</li>
<li class="paragrafo">o fortalecimento das redes privadas em detrimento das redes p&uacute;blicas (federal, estadual e municipal);</li>
<li class="paragrafo">a separa&ccedil;&atilde;o de fun&ccedil;&otilde;es entre o MEC (cursos t&eacute;cnicos e tecnol&oacute;gicos) e o MTE (qualifica&ccedil;&atilde;o profissional de curta dura&ccedil;&atilde;o).</li>
</ol>


<p class="paragrafo">Tal concep&ccedil;&atilde;o, coerente com o ide&aacute;rio neoliberal, e as premissas dos organismos multilaterais resultaram na <span style="background-color: #bfedd2;">estagna&ccedil;&atilde;o das redes p&uacute;blicas, na cria&ccedil;&atilde;o de um enorme contingente de jovens egressos do Ensino M&eacute;dio sem acesso &agrave; Educa&ccedil;&atilde;o Profissional, al&eacute;m de milh&otilde;es de reais gastos em cursos de curta dura&ccedil;&atilde;o que nem qualificavam, nem garantiam a t&atilde;o desejada &ldquo;empregabilidade&rdquo;.</span> Esta passou por v&aacute;rias adequa&ccedil;&otilde;es em contextos variados (apesar de ser utilizada desde 1900 nos estudos econ&ocirc;micos e sociol&oacute;gicos sobre o emprego) para ressurgir na onda neoliberal dos anos 80 como explica&ccedil;&atilde;o para o fen&ocirc;meno do desemprego persistente.</p>


<div id="recursos-azul" class="feat-box-foto">

<p class="paragrafo">Enquanto a <strong>empregabilidade-iniciativa </strong>enfatizava a responsabilidade individual na constru&ccedil;&atilde;o de compet&ecirc;ncias e de redes sociais, a <strong>empregabilidade-interativa </strong>considera as intera&ccedil;&otilde;es sociais na busca por emprego. Ambas perspectivas retiram do Estado e dos empres&aacute;rios a responsabilidade pelo emprego, que passa a ser &ldquo;culpa&rdquo; do trabalhador individual &ldquo;n&atilde;o qualificado&rdquo;, e desconsideram fatores estruturais como pol&iacute;ticas econ&ocirc;micas, desigualdade social e elementos estruturais do pr&oacute;prio mercado de trabalho.</p>

</div>

<div id="recursos-azul"><!-- Box Refletir - titulo video texto -->
<div id="box-refletir">
<div class="box-refletir-blue">
<div class="header-box-refletir">
<p class="caixa-de-destaque-titulo titulo">Saiba mais: contexto social, cultural e pol&iacute;tico dos anos 1990</p>
</div>
<div class="box-refletir-container">
<div><iframe title="YouTube video player" width="100%" height="415" src="https://www.youtube.com/embed/hYXVoIwCyrg?si=oeh1quD1K9458M21" data-mce-fragment="1"></iframe></div>
<div>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo:</strong><span> Legisla&ccedil;&atilde;o e pol&iacute;ticas p&uacute;blicas para EPT</span><span><br /></span><strong>Fonte:</strong> Legisla&ccedil;&atilde;o... (2019).&nbsp;</p>
</div>
<div>

<p class="destaque texto">Para aprofundar seus estudos, sugerimos assistir ao v&iacute;deo acima, que apresenta um panorama geral sobre o contexto social, cultural e pol&iacute;tico dos anos 1990 e tematiza o conceito de globaliza&ccedil;&atilde;o, a partir da perspectiva de Milton Santos, o avan&ccedil;o neoliberal e suas consequ&ecirc;ncias para o Estado, o mundo do trabalho e a LDBEN/1996.&nbsp;</p>
<p class="destaque texto"><span style="color: #000000;">Registre as reflex&otilde;es geradas em seu <strong>Memorial</strong>&nbsp;e/ou siga as instru&ccedil;&otilde;es de seu tutor.</span></p>

</div>
</div>
</div>
</div>
</div>


<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura --></div>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_28.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_31.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 22 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>