<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>A EPT nas CNEs, no PNE e no Sistema Nacional de Educa&ccedil;&atilde;o</strong></p>

<p><span style="font-weight: 400;">Como foi estudado no cap&iacute;tulo 2, a redemocratiza&ccedil;&atilde;o do pa&iacute;s impulsionou as demandas de amplia&ccedil;&atilde;o da participa&ccedil;&atilde;o da sociedade na elabora&ccedil;&atilde;o, no acompanhamento e na avalia&ccedil;&atilde;o das pol&iacute;ticas p&uacute;blicas, inscrevendo na Constitui&ccedil;&atilde;o de 1988 o direito de participar de todo o ciclo de cria&ccedil;&atilde;o dessas pol&iacute;ticas. As escutas e consultas, por diversos meios (audi&ecirc;ncias, semin&aacute;rios, confer&ecirc;ncias etc.) garantiram, em certa medida, que movimentos sociais, representa&ccedil;&otilde;es de trabalhadores, empres&aacute;rios, gestores e usu&aacute;rios das pol&iacute;ticas p&uacute;blicas implantadas se manifestassem. Com os eventos nacionais quase sempre precedidos por etapas municipais e estaduais, podem ser listados como <strong>principais exemplos que envolvem a &aacute;rea educacional e a EPT</strong>:</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">1&ordm; Semin&aacute;rio Nacional de Educa&ccedil;&atilde;o Profissional (2003);</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">1&ordf; Confer&ecirc;ncia Nacional de Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (2006);</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Confer&ecirc;ncia Nacional da Educa&ccedil;&atilde;o B&aacute;sica (2008);&nbsp;</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">1&ordm;, 2&ordm; e 3&ordm; F&oacute;rum Mundial de Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (2009, 2012, 2015);</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Confer&ecirc;ncia Nacional Popular da Educa&ccedil;&atilde;o &ndash; Conape (2018 e 2022);</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Confer&ecirc;ncia Nacional de Educa&ccedil;&atilde;o - Conae (2010, 2014, 2024).</span></li>
</ul>
<p><span style="font-weight: 400;">Al&eacute;m disso, eventos espec&iacute;ficos sobre EPT ocorreram em diversas edi&ccedil;&otilde;es do F&oacute;rum Mundial da Educa&ccedil;&atilde;o e do F&oacute;rum Social Mundial, todos com ampla participa&ccedil;&atilde;o de gestores, professores, estudantes e com a representa&ccedil;&atilde;o de trabalhadores.</span></p>
<p><span style="font-weight: 400;">Tamb&eacute;m deve ser ressaltado que os &oacute;rg&atilde;os colegiados, a exemplo do <a rel="noopener" href="https://portal.conif.org.br/" target="_blank">Conselho Nacional dos Institutos Federais</a> (Conif), do F&oacute;rum de Gestores Estaduais de Educa&ccedil;&atilde;o Profissional (vinculado ao Conselho Nacional de Secret&aacute;rios Estaduais de Educa&ccedil;&atilde;o &ndash; Consed), do Conselho Deliberativo do Fundo de Amparo ao Trabalhador (Codefat) e das Comiss&otilde;es Tripartite de emprego estaduais, passaram a participar das consultas relativas &agrave; EPT.</span></p>
<p><span style="font-weight: 400;">A </span><strong>gest&atilde;o democr&aacute;tica da educa&ccedil;&atilde;o nacional</strong><span style="font-weight: 400;">, prevista na LDBEN/96, &eacute; composta por diversos &oacute;rg&atilde;os, sendo eles o F&oacute;rum Nacional de Educa&ccedil;&atilde;o (</span><span style="font-weight: 400;">FNE), a </span><span style="font-weight: 400;">Confer&ecirc;ncia Nacional de Educa&ccedil;&atilde;o (Conae), o </span><span style="font-weight: 400;">Plano Nacional de Educa&ccedil;&atilde;o (PNE) e o Sistema Nacional de Educa&ccedil;&atilde;o (SNE).</span></p>
<p><span style="font-weight: 400;">Ao </span><strong>FNE</strong><span style="font-weight: 400;">, composto por representantes dos mais diversos setores e entidades educacionais da sociedade civil e do Estado, compete convocar e coordenar a Conae e acompanhar, monitorar e avaliar o PNE. O avan&ccedil;o das pol&iacute;ticas de educa&ccedil;&atilde;o para o estabelecimento do PNE 2014-2024 e seus correlatos &ndash; planos estaduais/distrital (PEEs/PDE) e planos municipais (PMEs) &ndash; para a sua implementa&ccedil;&atilde;o e avalia&ccedil;&atilde;o pode ser atribu&iacute;do ao amplo </span><span style="font-weight: 400;">processo de participa&ccedil;&atilde;o da sociedade civil na 2&ordf; Confer&ecirc;ncia Nacional de Educa&ccedil;&atilde;o (Conae 2014), nas etapas preparat&oacute;rias nos munic&iacute;pios, nos estados e no Distrito Federal,&nbsp;</span></p>
<p><span style="font-weight: 400;">Em 2017, o ent&atilde;o governo excluiu, de forma arbitr&aacute;ria, entidades populares do FNE e inviabilizou a participa&ccedil;&atilde;o ampla e democr&aacute;tica na Conae 2018, que aconteceu esvaziada e deslegitimada. Em resposta, foi criado o </span><strong>F&oacute;rum Nacional Popular de Educa&ccedil;&atilde;o (FNPE)</strong><span style="font-weight: 400;">, que assumiu a organiza&ccedil;&atilde;o da Confer&ecirc;ncia Nacional Popular de Educa&ccedil;&atilde;o (Conape 2018). A mesma situa&ccedil;&atilde;o se repetiu em 2022, com a realiza&ccedil;&atilde;o da </span><strong>Conae &ldquo;oficial&rdquo; e a Conape &ldquo;popular&rdquo;</strong><span style="font-weight: 400;">. Somente em 2023, com a recomposi&ccedil;&atilde;o do FNE, foi organizada a Conae extraordin&aacute;ria 2024, finalmente unificada.</span></p>
<p><span style="font-weight: 400;">A Conae 2024 mobilizou dezenas de milhares de pessoas que atuam na educa&ccedil;&atilde;o de todo o pa&iacute;s em etapas municipais, estaduais e nacionais. Al&eacute;m disso, foram realizadas </span><strong>&ldquo;Confer&ecirc;ncias Livres&rdquo;</strong><span style="font-weight: 400;">, que s&atilde;o atividades tem&aacute;ticas que podem ser organizadas por qualquer entidade, ap&oacute;s consulta ao FNE. As Conae 2014 e 2024 precederam e embasaram, com suas resolu&ccedil;&otilde;es, a elabora&ccedil;&atilde;o dos respectivos PNEs.&nbsp;</span></p>
<p><span style="font-weight: 400;">O </span><strong>Plano Nacional de Educa&ccedil;&atilde;o (PNE)</strong><span style="font-weight: 400;"> &eacute; um documento que estabelece diretrizes, metas e estrat&eacute;gias para a pol&iacute;tica educacional no Brasil em um per&iacute;odo de dez anos. A partir das propostas aprovadas na Conae,&nbsp;</span>uma proposta&nbsp;<span style="font-weight: 400;">&eacute; elaborada pelo MEC e &eacute; encaminhada ao Congresso Nacional. Ap&oacute;s discuss&otilde;es envolvendo governos, educadores, especialistas e a sociedade civil, a proposta final &eacute; votada e encaminhada para a san&ccedil;&atilde;o presidencial. </span><span style="font-weight: 400; background-color: #bfedd2;">A import&acirc;ncia do PNE adv&eacute;m da sua legitimidade e legalidade, sendo o guia para elabora&ccedil;&atilde;o de pol&iacute;ticas p&uacute;blicas nacionais, orientando tamb&eacute;m a constru&ccedil;&atilde;o dos planos estaduais e municipais de Educa&ccedil;&atilde;o.</span></p>
<p><span style="font-weight: 400;">O PNE vigente (2014-2024) foi sancionado pela </span><a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_ato2011-2014/2014/lei/l13005.htm" target="_blank"><span style="font-weight: 400;">Lei n&ordm; 13.005/2014</span></a><span style="font-weight: 400;">&nbsp;e est&aacute; em vigor desde 25 de junho de 2014. Ele cont&eacute;m 20 metas estruturadas em quatro eixos principais, apresentadas no infogr&aacute;fico abaixo:</span></p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.5_INF_9.png" alt="Metas do Plano Nacional de Educa&ccedil;&atilde;o" width="90%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo:</strong><strong>&nbsp;</strong><span style="font-weight: 400;">Metas do Plano Nacional de Educa&ccedil;&atilde;o (2014-2024)</span><strong><br /></strong><strong>Fonte: </strong><span style="font-weight: 400;">Brasil (2014b).<br /></span><strong>Elabora&ccedil;&atilde;o: </strong><span style="font-weight: 400;">Prosa (2025r).</span></p>

<p><span style="font-weight: 400;">Embora todas as metas do PNE 2014-2024 se relacionem direta ou indiretamente com a EPT, ser&atilde;o detalhadas aquelas espec&iacute;ficas ou com correla&ccedil;&atilde;o imediata:&nbsp;</span></p>

<div id="recursos-azul" class="feat-box-foto">
<ul>
<li><strong>Meta 7</strong><span style="font-weight: 400;">: elevar a escolaridade m&eacute;dia da popula&ccedil;&atilde;o e melhorar a qualidade da educa&ccedil;&atilde;o;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="2"><strong>Meta 8</strong><span style="font-weight: 400;">: aumentar a escolaridade m&eacute;dia da popula&ccedil;&atilde;o jovem para pelo menos 12 anos de estudo;<br /><br /></span></li>
<li><strong style="font-size: 1em;">Meta 9</strong><span style="font-weight: 400;">: elevar a taxa de alfabetiza&ccedil;&atilde;o da popula&ccedil;&atilde;o com 15 anos ou mais;<br /><br /></span></li>
<li><strong style="font-size: 1em;">Meta 10</strong><span style="font-weight: 400;">: integrar 25% das matr&iacute;culas de Educa&ccedil;&atilde;o de Jovens e Adultos (EJA) ao Ensino Fundamental e M&eacute;dio com a Educa&ccedil;&atilde;o Profissional;<br /><br /></span></li>
<li><strong style="font-size: 1em;">Meta 11</strong><span style="font-weight: 400;">: triplicar as matr&iacute;culas em cursos t&eacute;cnicos de n&iacute;vel m&eacute;dio, com pelo menos 50% dessa expans&atilde;o no setor p&uacute;blico;<br /><br /></span></li>
<li><strong style="font-size: 1em;">Meta 12</strong><span style="font-weight: 400;">: elevar a taxa bruta de matr&iacute;cula na Educa&ccedil;&atilde;o Superior para 50% e a taxa l&iacute;quida para 33% da popula&ccedil;&atilde;o de 18 a 24 anos.</span></li>
</ul>

</div>

<p><span style="font-weight: 400;">As mudan&ccedil;as de governo, com concep&ccedil;&otilde;es diferentes sobre o papel da educa&ccedil;&atilde;o no desenvolvimento nacional, parecem ser respons&aacute;veis, junto com a Pandemia da COVID-19, pelo n&atilde;o alcance da maioria das metas do PNE vigente. Por exemplo, em 2023 s&oacute; foram apuradas 4,7 % das matr&iacute;culas de EPT Integrada &agrave; EJA, frente aos 25% previstos na META 10. Do mesmo modo, quanto &agrave; META 11, as matr&iacute;culas de EPT n&atilde;o triplicaram, "apenas" passaram de </span><span style="font-weight: 400;">1</span><span style="font-weight: 400;">.602.946 (2013) para 2.271.607 (2023); por outro lado, a participa&ccedil;&atilde;o p&uacute;blica na expans&atilde;o superou o previsto de 50%, chegando a 54,4%.</span></p>
<p><span style="font-weight: 400;">Al&eacute;m disso, os maiores pontos cr&iacute;ticos foram o </span><strong>financiamento insuficiente</strong><span style="font-weight: 400;">&nbsp;da educa&ccedil;&atilde;o p&uacute;blica e a </span><strong>desvaloriza&ccedil;&atilde;o dos profissionais da educa&ccedil;&atilde;o</strong><span style="font-weight: 400;"> (sal&aacute;rios, condi&ccedil;&otilde;es de trabalho, forma&ccedil;&atilde;o, atratividade da carreira), quest&otilde;es que dever&atilde;o estar presentes na formula&ccedil;&atilde;o e execu&ccedil;&atilde;o do pr&oacute;ximo Plano Nacional.</span></p>
<p><span style="font-weight: 400;">O pr&oacute;ximo PNE (2025-2034) est&aacute; em fase de discuss&atilde;o e elabora&ccedil;&atilde;o, com a proposta elaborada pelo MEC com base nas Resolu&ccedil;&otilde;es da Conae enviado ao Congresso Nacional em 16 de junho de 2024 para debate, que certamente ir&aacute; apresentar as diferentes concep&ccedil;&otilde;es e interesses em jogo. O projeto pode ser acessado na forma do <a rel="modal noopener" href="https://www.camara.leg.br/proposicoesWeb/prop_mostrarintegra?codteor=2443432&amp;filename=PL%202614/2024" target="_blank">Projeto de Lei n&ordm; 2.614/2024</a> e sua tramita&ccedil;&atilde;o pode ser acompanhada pelo <a rel="noopener" href="https://www.camara.leg.br/proposicoesWeb/fichadetramitacao?idProposicao=2443764" target="_blank">Portal da C&acirc;mara dos Deputados</a>. Al&eacute;m de quest&otilde;es de princ&iacute;pios, presentes no PNE anterior (mas nem por isso isento de pol&ecirc;micas), como a universaliza&ccedil;&atilde;o da Educa&ccedil;&atilde;o B&aacute;sica, a redu&ccedil;&atilde;o das desigualdades educacionais, a amplia&ccedil;&atilde;o do financiamento e a integra&ccedil;&atilde;o entre Educa&ccedil;&atilde;o e Trabalho, a proposta elenca alguns eixos, temas e metas tais como</span><span style="font-weight: 400;">: </span><span style="background-color: #bfedd2;"><span style="font-weight: 400;">recupera&ccedil;&atilde;o das perdas da pandemia;</span><span style="font-weight: 400;"> </span><span style="font-weight: 400;">tecnologia e inova&ccedil;&atilde;o; educa&ccedil;&atilde;o inclusiva; forma&ccedil;&atilde;o e valoriza&ccedil;&atilde;o dos professores;</span><span style="font-weight: 400;"> </span><span style="font-weight: 400;">sustentabilidade e educa&ccedil;&atilde;o ambiental; </span><span style="font-weight: 400;">e</span><span style="font-weight: 400;">xpans&atilde;o do Ensino T&eacute;cnico e Superior.</span></span></p>
<p><span style="font-weight: 400;">A EPT est&aacute; contemplada na proposta de PNE enviada ao Congresso Nacional em dois objetivos:&nbsp;</span></p>

<p><img class="card-curso-topo-image" src="medias/PP.5_MNT_16 final2.png" alt="Objetivos da EPT no Plano Nacional de Educa&ccedil;&atilde;o" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong><span style="font-weight: 400;">Objetivos da EPT no Plano Nacional de Educa&ccedil;&atilde;o (2025-2034)</span><strong><br /></strong><strong>Fonte: </strong><span style="font-weight: 400;">Brasil (2024) e Sch&uuml;ler (2023c).<br /></span><strong>Elabora&ccedil;&atilde;o: </strong><span style="font-weight: 400;">Prosa (2025s).</span></p>
<p><span style="font-weight: 400;">Em rela&ccedil;&atilde;o ao PNE vigente, os aspectos positivos est&atilde;o relacionados ao </span><strong>reconhecimento da import&acirc;ncia social da EP e do setor p&uacute;blico</strong><span style="font-weight: 400;">, com fortalecimento das redes, inclusive as estaduais. Tamb&eacute;m s&atilde;o citadas quest&otilde;es ausentes no ciclo anterior, como orienta&ccedil;&atilde;o profissional, verticaliza&ccedil;&atilde;o, as mulheres na EPT, a assist&ecirc;ncia estudantil e a especifica&ccedil;&atilde;o da oferta integrada para as popula&ccedil;&otilde;es do campo e para as comunidades ind&iacute;genas e quilombolas. Em contrapartida, no mesmo documento, h&aacute; a retirada da prioridade da forma integrada, abrindo espa&ccedil;o para as formas concomitante e subsequente e para cursos de curta dura&ccedil;&atilde;o, como nas seguintes metas:</span></p>

<div id="recursos-azul" class="feat-box-foto">
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Garantir </span><strong>25% </strong><span style="font-weight: 400;">das matr&iacute;culas de educa&ccedil;&atilde;o de jovens e adultos, nos ensinos fundamental e m&eacute;dio, na forma articulada &agrave; educa&ccedil;&atilde;o profissional.;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>Tr&ecirc;s milh&otilde;es de matr&iacute;culas</strong><span style="font-weight: 400;"> em cursos de qualifica&ccedil;&atilde;o profissional com carga hor&aacute;ria m&iacute;nima de cento e sessenta horas;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>Aumento de 50%</strong><strong>&nbsp;</strong><span style="font-weight: 400;">da forma subsequente ao ensino m&eacute;dio;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>Expans&atilde;o EP t&eacute;cnica de n&iacute;vel m&eacute;dio 50%</strong><span style="font-weight: 400;">&nbsp;do ensino m&eacute;dio, com no m&iacute;nimo,</span><strong>&nbsp;45%</strong><strong></strong><span style="font-weight: 400;">&nbsp;da expans&atilde;o nas redes p&uacute;blicas.</span></li>
</ul>
<p style="text-align: right;"><span style="font-weight: 400;">(Brasil, 2024, grifo nosso).</span></p>
</div>
<p><span style="font-weight: 400;">Tamb&eacute;m &eacute; preocupante e levanta d&uacute;vidas a introdu&ccedil;&atilde;o de a&ccedil;&otilde;es aparentemente &ldquo;voltadas para a qualidade&rdquo;, mas que t&ecirc;m origem no ide&aacute;rio do polo hegem&ocirc;nico, suscitadas em express&otilde;es como:&nbsp;</span></p>
<ul>
<li><span style="font-weight: 400;">&ldquo;referenciais nacionais de qualidade&rdquo; - </span><strong>elaborados por quem?</strong><strong><br /><br /></strong></li>
<li><span style="font-weight: 400;">&ldquo;padr&otilde;es adequados de aprendizagem&rdquo; &ndash; </span><strong>baseados em que perspectiva?<br /><br /></strong></li>
<li aria-level="1"><span style="font-weight: 400;">&ldquo;incentivar a flexibiliza&ccedil;&atilde;o curricular para atender p&uacute;blicos espec&iacute;ficos&rdquo; &ndash; </span><strong>uma nova dualidade educacional no interior da EPT?</strong></li>
</ul>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">&ldquo;Estimular a expans&atilde;o da pr&aacute;tica profissional&rdquo; &ndash; <strong>aligeiramento da forma&ccedil;&atilde;o por incorpora&ccedil;&atilde;o do tempo de trabalho?</strong> </span><strong>Submiss&atilde;o do curr&iacute;culo ao saber-fazer, cindindo o par teoria-pr&aacute;tica?<br /><br /></strong></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">&ldquo;Alinhamento oferta e demanda&rdquo; &ndash; </span><strong>a que demanda, da sociedade ou do mercado?</strong><strong>&nbsp;</strong></li>
</ul>
<p><span style="font-weight: 400;">A redu&ccedil;&atilde;o do papel da expans&atilde;o p&uacute;blica abre espa&ccedil;o para o financiamento das redes privadas com recursos p&uacute;blicos, inclusive viabilizando o criticado &ldquo;5&ordm; itiner&aacute;rio&rdquo;</span>,<strong> </strong><span style="font-weight: 400;">objeto de desejo das redes privadas.</span></p>

<div id="recursos-azul">
<div id="box-refletir">
<div class="box-refletir-blue">
<div class="header-box-refletir">
<p class="caixa-de-destaque-titulo titulo">Para refletir: PNE e EPT</p>
</div>
<div class="box-refletir-container">
<p><span style="font-weight: 400;">Como um exerc&iacute;cio para agregar ao seu Memorial, responda &agrave;s seguintes perguntas:</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Voc&ecirc; conhecia as metas 10 e 11 do PNE e suas estrat&eacute;gias? Considera elas suficientes para o avan&ccedil;o da EPT no Brasil? E no seu territ&oacute;rio?<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Voc&ecirc; conhece a proposta do novo PNE, encaminhada ao Congresso pelo Governo?&nbsp;</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Analise as propostas para a EPT, debata com seus colegas no sentido de perceber:&nbsp;<br /><br /></span>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">as principais quest&otilde;es da EPT est&atilde;o presentes;&nbsp;</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">a contribui&ccedil;&atilde;o das metas e estrat&eacute;gias para a solu&ccedil;&atilde;o de problemas que sua unidade escolar vivencia e se &eacute; suficiente;&nbsp;</span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">a necessidade de acr&eacute;scimos, modifica&ccedil;&otilde;es ou supress&otilde;es que poderiam ser encaminhadas ao Congresso Nacional.</span></li>
</ul>
</li>
</ul>
<p style="text-align: center;"><span style="font-weight: 400;">***</span></p>
<p>A seguir, disponibilizamos uma s&eacute;rie de v&iacute;deos curtos sobre cada um dos eixos que estruturam a proposta do novo PNE (2024 - 2034). Sugerimos que voc&ecirc; leia os t&iacute;tulos e explore aqueles que lhe s&atilde;o mais interessantes ou que dialogam mais com a sua realidade:</p>
<ul>
<li><strong>EIXO I</strong> - <a rel="noopener" href="https://www.youtube.com/watch?v=b3pMsvVrW0k" target="_blank">O PNE como articulador do Sistema Nacional de Educa&ccedil;&atilde;o</a>;</li>
<li><strong>EIXO II</strong> - <a rel="noopener" href="https://www.youtube.com/watch?v=7xkARG4Tm2M&amp;list=PL9nJ11ynWg3fy6HkTCJE9RWw-ndJLJhas&amp;index=22" target="_blank">A garantia do direito de todas as pessoas &agrave; educa&ccedil;&atilde;o de qualidade</a>;</li>
<li><strong>EIXO III</strong> - <a rel="noopener" href="https://www.youtube.com/watch?v=fNAmNXKDl7c&amp;list=PL9nJ11ynWg3fy6HkTCJE9RWw-ndJLJhas&amp;index=21" target="_blank">Educa&ccedil;&atilde;o, Direitos Humanos, Inclus&atilde;o e Diversidade</a>;</li>
<li><strong>EIXO IV</strong> - <a rel="noopener" href="https://www.youtube.com/watch?v=lefSSdQuw8c&amp;list=PL9nJ11ynWg3fy6HkTCJE9RWw-ndJLJhas&amp;index=20" target="_blank">Gest&atilde;o democr&aacute;tica e educa&ccedil;&atilde;o de qualidade</a>;</li>
<li><strong>EIXO V</strong> - <a rel="noopener" href="https://www.youtube.com/watch?v=Z1V-q9_Kg7M&amp;list=PL9nJ11ynWg3fy6HkTCJE9RWw-ndJLJhas&amp;index=19" target="_blank">Valoriza&ccedil;&atilde;o de profissionais da educa&ccedil;&atilde;o</a>;</li>
<li><strong>EIXO VI</strong> - <a rel="noopener" href="https://www.youtube.com/watch?v=KKxfPaXjX7Y&amp;list=PL9nJ11ynWg3fy6HkTCJE9RWw-ndJLJhas&amp;index=18" target="_blank">Financiamento p&uacute;blico da educa&ccedil;&atilde;o p&uacute;blica</a>;</li>
<li><strong>EIXO VII</strong> - <a rel="noopener" href="https://www.youtube.com/watch?v=Ves5twb9XXo&amp;list=PL9nJ11ynWg3fy6HkTCJE9RWw-ndJLJhas&amp;index=17" target="_blank">Educa&ccedil;&atilde;o comprometida com a justi&ccedil;a social, a prote&ccedil;&atilde;o da biodiversidade, o desenvolvimento socioambiental sustent&aacute;vel e o enfrentamento das desigualdades e da pobreza</a>.</li>
</ul>
</div>
</div>
</div>
</div>
<p><span style="font-weight: 400;">Tamb&eacute;m se esperam dificuldades na tramita&ccedil;&atilde;o do documento devido ao cen&aacute;rio pol&iacute;tico atual extremamente polarizado. Ainda, outras duas preocupa&ccedil;&otilde;es se fazem presentes quanto &agrave; garantia de recursos p&uacute;blicos suficientes para implementar as metas em um contexto de ajuste fiscal e ao efetivo monitoramento e avalia&ccedil;&atilde;o das metas.<br /></span><strong></strong></p>
<p><span style="font-weight: 400;">A implanta&ccedil;&atilde;o do </span><strong>Sistema Nacional de Educa&ccedil;&atilde;o (SNE)</strong><span style="font-weight: 400;">&nbsp;tem sido tortuosa e complexa. Desde a Constitui&ccedil;&atilde;o de 1988, est&aacute; prevista a organiza&ccedil;&atilde;o dos sistemas de ensino em regime de colabora&ccedil;&atilde;o entre Uni&atilde;o, estados, Distrito Federal e munic&iacute;pios, mas isso nunca foi regulamentado claramente. O SNE &eacute; fundamental para o pleno desenvolvimento da Educa&ccedil;&atilde;o em geral e para a EPT, em especial quanto &agrave;s possibilidades de se constitu&iacute;rem processos de verticaliza&ccedil;&atilde;o no &acirc;mbito do territ&oacute;rio educativo das unidades das diversas depend&ecirc;ncias administrativas.</span></p>
<p><span style="font-weight: 400;">Apesar do aparente consenso, a cria&ccedil;&atilde;o do SNE est&aacute; em tramita&ccedil;&atilde;o no Congresso Nacional h&aacute; anos, devido &agrave; dificuldade de constru&ccedil;&atilde;o de consensos entre as diferentes concep&ccedil;&otilde;es dos agentes sociais. Os debates se d&atilde;o sobre qual a melhor maneira de estabelecer mecanismos legais para essa colabora&ccedil;&atilde;o acontecer de forma efetiva, sendo as principais quest&otilde;es:&nbsp;</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A </span><strong>regulamenta&ccedil;&atilde;o</strong><span style="font-weight: 400;">&nbsp;do regime de colabora&ccedil;&atilde;o, com defini&ccedil;&atilde;o precisa dos pap&eacute;is, responsabilidades, financiamento, entre outros;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A </span><strong>descentraliza&ccedil;&atilde;o e autonomia</strong><span style="font-weight: 400;">&nbsp;dos entes federados sem tirar a prerrogativa da Uni&atilde;o de estabelecer diretrizes nacionais (coordena&ccedil;&atilde;o interfederativa);<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O papel do SNE na viabiliza&ccedil;&atilde;o, no monitoramento e na avalia&ccedil;&atilde;o permanente do PNE conforme discutido na Conae/2024;&nbsp;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A </span><strong>estrutura&ccedil;&atilde;o</strong><span style="font-weight: 400;"> do sistema, com possibilidade da cria&ccedil;&atilde;o de subsistemas espec&iacute;ficos para avalia&ccedil;&atilde;o, financiamento e gest&atilde;o;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Os processos de </span><strong>integra&ccedil;&atilde;o</strong><span style="font-weight: 400;"> da Educa&ccedil;&atilde;o B&aacute;sica e Superior, EPT e Educa&ccedil;&atilde;o proped&ecirc;utica, incluindo a p&oacute;s-gradua&ccedil;&atilde;o e a Educa&ccedil;&atilde;o a Dist&acirc;ncia (EaD);<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A defini&ccedil;&atilde;o de &oacute;rg&atilde;os e mecanismos de </span><strong>controle social e participa&ccedil;&atilde;o</strong><span style="font-weight: 400;">&nbsp;nos processos de decis&atilde;o do SNE, para garantir a gest&atilde;o democr&aacute;tica e o envolvimento da sociedade.</span></li>
</ul>
<p><span style="font-weight: 400;">Os </span><strong>argumentos a favor</strong><span style="font-weight: 400;">&nbsp;da regulamenta&ccedil;&atilde;o do SNE acentuam seu papel na </span><strong>(1)</strong><span style="font-weight: 400;"> articula&ccedil;&atilde;o e colabora&ccedil;&atilde;o mais efetiva entre os diferentes n&iacute;veis de governo (Uni&atilde;o, estados, munic&iacute;pios e Distrito Federal), facilitando a troca de experi&ecirc;ncias; </span><strong>(2)</strong><span style="font-weight: 400;"> na redu&ccedil;&atilde;o de desigualdades, com maior uniformidade nas pol&iacute;ticas educacionais, garantindo que todos os estudantes tenham acesso a uma educa&ccedil;&atilde;o de qualidade, independentemente de sua localiza&ccedil;&atilde;o geogr&aacute;fica;&nbsp;</span><strong>(3)</strong><span style="font-weight: 400;">&nbsp;na solu&ccedil;&atilde;o de conflitos e sobreposi&ccedil;&otilde;es de responsabilidades entre os entes federativos; </span><strong>(4)</strong><span style="font-weight: 400;"> na implementa&ccedil;&atilde;o de avalia&ccedil;&otilde;es e monitoramento da qualidade educacional, permitindo a identifica&ccedil;&atilde;o de boas pr&aacute;ticas e a corre&ccedil;&atilde;o de falhas nos sistemas de ensino. Quanto &agrave; participa&ccedil;&atilde;o social, o SNE consolida os conselhos e f&oacute;runs nas diversas inst&acirc;ncias que garantem a participa&ccedil;&atilde;o da sociedade civil nas decis&otilde;es sobre pol&iacute;ticas educacionais, promovendo uma gest&atilde;o democr&aacute;tica e inclusiva.</span></p>
<p><span style="font-weight: 400;">J&aacute; os </span><strong>argumentos contra</strong><span style="font-weight: 400;">&nbsp;a regulamenta&ccedil;&atilde;o do SNE apontam para </span><strong>(1)</strong><span style="font-weight: 400;">&nbsp;a possibilidade de centraliza&ccedil;&atilde;o excessiva das decis&otilde;es educacionais, limitando a autonomia de estados e munic&iacute;pios para adaptar as pol&iacute;ticas &agrave;s suas realidades locais; </span><strong>(2)</strong><span style="font-weight: 400;"> a burocratiza&ccedil;&atilde;o; </span><strong>(3)</strong><span style="font-weight: 400;"> o conflito de interesses entre os diferentes entes federativos, especialmente quando se trata de aloca&ccedil;&atilde;o de recursos e responsabilidades e, por &uacute;ltimo, para a </span><strong>(4)</strong><span style="font-weight: 400;">&nbsp;falta de garantia de financiamento adequado &agrave; implanta&ccedil;&atilde;o e efetividade do sistema.&nbsp;</span></p>


<div id="recursos-azul" class="feat-box-foto">
<p><span style="font-weight: 400;">Nesse sentido, s&atilde;o exatamente essas quest&otilde;es que constituem a realidade educacional brasileira na atualidade e que a proposta do SNE pretende resolver. A <strong>quest&atilde;o de fundo</strong> n&atilde;o se limita &agrave; resist&ecirc;ncia &agrave; mudan&ccedil;a de setores que j&aacute; est&atilde;o acostumados com o sistema atual, dificultando a ado&ccedil;&atilde;o de novas diretrizes e pr&aacute;ticas, mas <strong>se situa no &acirc;mbito da nega&ccedil;&atilde;o de processos regulat&oacute;rios da sociedade sobre as pol&iacute;ticas sociais, em particular sobre a educa&ccedil;&atilde;o privada.</strong></span><span style="font-weight: 400;"> </span><span style="font-weight: 400;">Entretanto, a quest&atilde;o central da constru&ccedil;&atilde;o de um SNE &eacute; atender &agrave;s diversas realidades e necessidades do Brasil, buscando um equil&iacute;brio entre a centraliza&ccedil;&atilde;o e a autonomia dos entes federativos de modo a garantir a toda a popula&ccedil;&atilde;o o direito &agrave; educa&ccedil;&atilde;o, incluindo a EPT.</span></p>

</div>

<p><span style="font-weight: 400;">&nbsp;</span></p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_42.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_44.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 34 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>