<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Reestrutura&ccedil;&atilde;o produtiva</strong></p>


<p class="paragrafo">As <strong>Revolu&ccedil;&otilde;es Industriais</strong>&nbsp;s&atilde;o per&iacute;odos hist&oacute;ricos do capitalismo que foram marcados por grandes transforma&ccedil;&otilde;es tecnol&oacute;gicas, econ&ocirc;micas e sociais, as quais se alastram pelo mundo e impactam profundamente a sociedade desde ent&atilde;o. A seguir, ser&aacute; apresentado, respectivamente, as revolu&ccedil;&otilde;es que ocorreram at&eacute; hoje.</p>


<ul>
<li class="paragrafo">Segunda metade do s&eacute;culo XVIII e primeira metade do s&eacute;culo XIX: a <span style="background-color: #bfedd2;">primeira Revolu&ccedil;&atilde;o Industrial</span> se caracterizou pela introdu&ccedil;&atilde;o do uso da energia do vapor e de ferramentas mec&acirc;nicas, criando a <strong>produ&ccedil;&atilde;o industrial</strong>.</li>
<li class="paragrafo">Segunda metade do s&eacute;culo XIX e in&iacute;cio do s&eacute;culo XX: a <span style="background-color: #bfedd2;">segunda</span> Revolu&ccedil;&atilde;o Industrial &eacute; a da energia el&eacute;trica e do petr&oacute;leo, com ferramentas eletromec&acirc;nicas e com a <strong>produ&ccedil;&atilde;o em massa</strong>.</li>
<li class="paragrafo">Segunda metade do s&eacute;culo XX: a <span style="background-color: #bfedd2;">terceira</span> Revolu&ccedil;&atilde;o Industrial, baseada na microeletr&ocirc;nica e na inform&aacute;tica, continua utilizando a energia el&eacute;trica, diversificando as fontes (nuclear, e&oacute;lica, solar, de hidrog&ecirc;nio) com a <strong>produ&ccedil;&atilde;o flex&iacute;vel</strong>.</li>
<li class="paragrafo">A partir da d&eacute;cada de 2010: na <span style="background-color: #bfedd2;">atualidade</span>, vivencia-se uma nova fase com a introdu&ccedil;&atilde;o da Ind&uacute;stria 4.0, que envolve <strong>produ&ccedil;&atilde;o virtual</strong>, Intelig&ecirc;ncia Artificial (IA) e outros avan&ccedil;os tecnol&oacute;gicos recentes, fazendo com que alguns autores a denominem como quarta revolu&ccedil;&atilde;o industrial.</li>
</ul>


<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.3_INF_1.png" alt="card do curso" width="90%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>As revolu&ccedil;&otilde;es industriais<br /><strong>Fonte: </strong>Prosa (2025a).</p>


<p class="paragrafo">Enquanto as Revolu&ccedil;&otilde;es Industriais indicam o momento ou intervalo crucial de introdu&ccedil;&atilde;o de novas m&aacute;quinas, materiais e fontes de energia, a <strong>reestrutura&ccedil;&atilde;o produtiva</strong> aponta para um processo complexo de longa dura&ccedil;&atilde;o. Assim, ele est&aacute; relacionado &agrave; transforma&ccedil;&atilde;o das formas de produzir e organizar o trabalho, constituindo novas rela&ccedil;&otilde;es sociais e laborais, ou seja, um novo modelo de produ&ccedil;&atilde;o. Entretanto, como o<span class="modal-button button" data-toggle="modal" data-target="#modal-1">&nbsp;modo de produ&ccedil;&atilde;o </span>continua sendo o capitalista, a an&aacute;lise da reestrutura&ccedil;&atilde;o produtiva envolve, al&eacute;m da produ&ccedil;&atilde;o, a circula&ccedil;&atilde;o e o consumo.</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Modo de produ&ccedil;&atilde;o</h5>
</div>
<div class="modal-body nota">Forma como uma sociedade produz e distribui bens e servi&ccedil;os, &eacute; constitu&iacute;do pelas for&ccedil;as produtivas (trabalho humano e meios de produ&ccedil;&atilde;o: conhecimento t&eacute;cnico, m&aacute;quinas, infraestrutura, mat&eacute;rias primas, seres vivos e terra) e as rela&ccedil;&otilde;es de produ&ccedil;&atilde;o (propriedade, poder, controle, associa&ccedil;&otilde;es, classes sociais etc).</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo">N&atilde;o &eacute; coincid&ecirc;ncia o fato de que a reestrutura&ccedil;&atilde;o produtiva se intensificou a partir da segunda metade do s&eacute;culo XX, a partir da terceira Revolu&ccedil;&atilde;o Industrial. Esta, tamb&eacute;m conhecida como <em>revolu&ccedil;&atilde;o tecnocient&iacute;fica</em>&nbsp;ou <em>revolu&ccedil;&atilde;o informacional</em> pela forte integra&ccedil;&atilde;o entre ci&ecirc;ncia, tecnologia e produ&ccedil;&atilde;o, trouxe, junto com os avan&ccedil;os tecnol&oacute;gicos, o aumento e a diversifica&ccedil;&atilde;o da produ&ccedil;&atilde;o, al&eacute;m de diversas consequ&ecirc;ncias sociais. Entre elas, as mais imediatas s&atilde;o:</p>


<ul>
<li class="paragrafo">A automa&ccedil;&atilde;o e a robotiza&ccedil;&atilde;o, acarretando a diminui&ccedil;&atilde;o da demanda por m&atilde;o de obra em diversas &aacute;reas;</li>
<li class="paragrafo">As novas profiss&otilde;es relacionadas &agrave; tecnologia, enquanto <strong>outras desapareceram&nbsp;</strong><span class="primary-color"><button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Exemplo de profiss&otilde;es que desapareceram ou tiveram redu&ccedil;&atilde;o de contingente: porteiros, leitores de contadores de &aacute;gua e luz e reveladores de fotografia anal&oacute;gica."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>;</li>
<li class="paragrafo">A necessidade imposta de requalifica&ccedil;&atilde;o e adapta&ccedil;&atilde;o constante dos trabalhadores;</li>
<li class="paragrafo">A desigualdade digital acentuada, com boa parte da popula&ccedil;&atilde;o exclu&iacute;da do acesso &agrave;s novas tecnologias;&nbsp;</li>
<li class="paragrafo">A maior concentra&ccedil;&atilde;o de renda interna e entre os pa&iacute;ses.</li>
</ul>


<p class="paragrafo">A reestrutura&ccedil;&atilde;o produtiva &eacute; um conceito que se torna mais claro ao analisarmos as mudan&ccedil;as em rela&ccedil;&atilde;o ao modelo anterior de produ&ccedil;&atilde;o, o <strong>taylorismo-fordismo</strong>.</p>


<p class="paragrafo">O <strong>fordismo</strong> &eacute; fundamentado na ger&ecirc;ncia cient&iacute;fica do taylorismo e sua implementa&ccedil;&atilde;o enfrentou significativa resist&ecirc;ncia dos trabalhadores. Essa resist&ecirc;ncia foi manifestada de forma individual, por meio de absente&iacute;smo - falta de assiduidade no cumprimento de um trabalho/obriga&ccedil;&atilde;o -, o que gerou uma queda brusca na qualidade do trabalho, e, tamb&eacute;m, de forma coletiva, com as greves.</p>


<p class="paragrafo">Abaixo, em um infogr&aacute;fico, listamos as principais caracter&iacute;sticas do taylorismo-fordismo e, ainda, as contradi&ccedil;&otilde;es internas desse modelo, que foram as grandes causadoras da resist&ecirc;ncia por parte dos trabalhadores a esse sistema de trabalho:</p>


<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.3_INF_2.png" alt="card do curso" width="90%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: <span style="font-weight: 400;">Fordismo vs. Taylorismo-fordismo</span></strong><br /><strong>Fonte: </strong>Prosa (2025b).</p>


<p class="paragrafo">A partir da d&eacute;cada de 1960, as contradi&ccedil;&otilde;es do taylorismo-fordismo se tornam insustent&aacute;veis, levando a uma estagna&ccedil;&atilde;o da taxa de lucro, al&eacute;m disso fatores externos, como a crise do petr&oacute;leo nos anos 1970, agravam essa situa&ccedil;&atilde;o. Em resposta, os pa&iacute;ses centrais adotam pol&iacute;ticas monetaristas que visam reconstruir o intervalo entre planejamento e execu&ccedil;&atilde;o. Em vista disso, a chegada da microeletr&ocirc;nica traz flexibilidade &agrave; produ&ccedil;&atilde;o, permitindo a fabrica&ccedil;&atilde;o diversificada em pequenos lotes e adapta&ccedil;&otilde;es cont&iacute;nuas. Esse processo resulta em ritmos de trabalho mais pr&oacute;ximos aos das f&aacute;bricas de produ&ccedil;&atilde;o cont&iacute;nua, onde o ritmo da m&aacute;quina predomina sobre o trabalhador.</p>


<p class="paragrafo">As transforma&ccedil;&otilde;es no ch&atilde;o de f&aacute;brica refletem uma altera&ccedil;&atilde;o nas atitudes gerenciais e nas pol&iacute;ticas econ&ocirc;micas. As mudan&ccedil;as no mercado e nas regras de negocia&ccedil;&atilde;o coletiva ocorrem rapidamente, acompanhando as inova&ccedil;&otilde;es tecnol&oacute;gicas e organizacionais, como as novas formas de gest&atilde;o a fim de otimizar os processos, sendo elas: <span class="modal-button button" data-toggle="modal" data-target="#modal-2"><em>just-in-time</em>, <em>kanban</em>, reengenharia e qualidade total</span>.</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Modelos de gest&atilde;o de tarefas</h5>
</div>
<div class="modal-body nota"><strong><em>Just-in-time:</em></strong> forma de gest&atilde;o do processo de trabalho que busca otimizar a produ&ccedil;&atilde;o, entregando produtos ou servi&ccedil;os conforme a demanda, com o objetivo de reduzir estoques e minimizar desperd&iacute;cios. <br /><br /><strong><em>Kanban:</em></strong> sistema visual que organiza o trabalho nas etapas "a fazer", "em progresso" e "conclu&iacute;do", facilitando o acompanhamento das atividades e a identifica&ccedil;&atilde;o de obst&aacute;culos, tornando o fluxo mais eficiente. <br /><br /><strong>Reengenharia:</strong> abordagem que foca na an&aacute;lise e reformula&ccedil;&atilde;o dos processos internos de uma empresa, com o objetivo de melhorar seu desempenho e agilidade e reduzir os custos, de modo a aumentar a qualidade dos seus produtos ou servi&ccedil;os. <br /><br /><strong>Qualidade total:</strong> forma de gest&atilde;o do trabalho que envolve todas as pessoas de uma empresa e vista da melhoria dos seus processos de trabalho, buscando uma maior satisfa&ccedil;&atilde;o dos clientes, bem como a maximiza&ccedil;&atilde;o dos lucros via a minimiza&ccedil;&atilde;o das perdas e o uso intensivo da for&ccedil;a de trabalho.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<div id="recursos-azul" class="feat-box-foto">

<p>Em suma, a reestrutura&ccedil;&atilde;o produtiva representa uma resposta &agrave;s limita&ccedil;&otilde;es do modelo taylorista-fordista, buscando maior flexibilidade e efici&ecirc;ncia nas rela&ccedil;&otilde;es de trabalho e na produ&ccedil;&atilde;o, al&eacute;m de atenuar as reivindica&ccedil;&otilde;es dos trabalhadores por maior participa&ccedil;&atilde;o nas decis&otilde;es e no controle do trabalho.</p>

</div>


<p class="paragrafo">Entretanto, a reestrutura&ccedil;&atilde;o produtiva implanta um novo modelo de produ&ccedil;&atilde;o, o <strong>toyotismo</strong>, que, na maioria dos setores, resulta em desemprego e precariza&ccedil;&atilde;o do trabalho, uma vez que a automa&ccedil;&atilde;o e a flexibiliza&ccedil;&atilde;o podem levar &agrave; elimina&ccedil;&atilde;o de postos de trabalho. Alguns poucos setores geram postos de trabalho com sal&aacute;rios atrativos, mas nem de longe suprem a demanda de emprego criada pelas demiss&otilde;es em massa. Uma das consequ&ecirc;ncias &eacute; a polariza&ccedil;&atilde;o entre os trabalhadores qualificados e os n&atilde;o qualificados, aumentando a desigualdade social.</p>


<p class="paragrafo">Para aprofundarmos sobre os impactos comprovados pela reestrutura&ccedil;&atilde;o produtiva excludente, citamos alguns deles abaixo:</p>


<ol style="list-style-type: lower-alpha;">
<li class="paragrafo"><strong>Perda de direitos:</strong> a flexibiliza&ccedil;&atilde;o do trabalho est&aacute; associada &agrave; eros&atilde;o de direitos trabalhistas e &agrave; desregulamenta&ccedil;&atilde;o das rela&ccedil;&otilde;es de trabalho, resultando em condi&ccedil;&otilde;es laborais mais prec&aacute;rias e na diminui&ccedil;&atilde;o da capacidade de negocia&ccedil;&atilde;o dos trabalhadores;</li>
<li class="paragrafo"><strong>Impactos psicossociais:</strong> a inseguran&ccedil;a no emprego e a press&atilde;o por produtividade podem levar a problemas de sa&uacute;de mental entre os trabalhadores, como estresse e <em>burnout</em>, refletindo a tens&atilde;o entre a necessidade de adapta&ccedil;&atilde;o &agrave;s novas exig&ecirc;ncias do mercado e a manuten&ccedil;&atilde;o de um equil&iacute;brio saud&aacute;vel entre a vida pessoal e a profissional;</li>
<li class="paragrafo"><strong>Preju&iacute;zos ao meio ambiente:</strong>&nbsp;a busca incessante por efici&ecirc;ncia e lucro pode levar &agrave; explora&ccedil;&atilde;o excessiva dos recursos naturais, levantando preocupa&ccedil;&otilde;es sobre a sustentabilidade ambiental e a responsabilidade social das empresas;</li>
<li class="paragrafo"><strong>Desigualdade do acesso &agrave; qualifica&ccedil;&atilde;o:</strong>&nbsp;a necessidade de requalifica&ccedil;&atilde;o constante dos trabalhadores para se adaptarem &agrave;s novas tecnologias e processos gera um desafio adicional, especialmente para aqueles que n&atilde;o t&ecirc;m escolariza&ccedil;&atilde;o e acesso &agrave; forma&ccedil;&atilde;o adequada.</li>
</ol>


<p class="paragrafo">A ado&ccedil;&atilde;o do novo modelo est&aacute; longe de ser universal. Sobrevivem em alguns setores produtivos o taylorismo-fordismo, a manufatura e o artesanato, embora o modelo toyotista seja dominante nas grandes empresas e tenha exigido fortes investimentos para sua implanta&ccedil;&atilde;o.</p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_20.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_23.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 17 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>