<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>A rela&ccedil;&atilde;o hist&oacute;rica da EPT com o EM e outras modalidades da Educa&ccedil;&atilde;o</strong></p>


<p class="paragrafo">A rela&ccedil;&atilde;o hist&oacute;rica entre a Educa&ccedil;&atilde;o Profissional e o<span class="modal-button button" data-toggle="modal" data-target="#modal-1">&nbsp;Ensino M&eacute;dio </span>no Brasil &eacute; marcada pela <strong>dualidade das redes p&uacute;blica e privada</strong>, heran&ccedil;a colonial perpetuada pelo Imp&eacute;rio e nas diversas fases da Rep&uacute;blica. A Educa&ccedil;&atilde;o Profissional, enquanto aprendizagem de artes e of&iacute;cios, sempre esteve ligada ao horror ao trabalho manual que a elite escravocrata nunca disfar&ccedil;ou. A instru&ccedil;&atilde;o secund&aacute;ria e proped&ecirc;utica preparava seus filhos para os estudos superiores, geralmente na Europa.</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">N&iacute;veis da Educa&ccedil;&atilde;o</h5>
</div>
<div class="modal-body nota">A educa&ccedil;&atilde;o no Brasil &eacute; organizada em n&iacute;veis, etapas e modalidades, conforme estabelecido na LDBEN. Sendo assim, os seus n&iacute;veis s&atilde;o: <br /><br />1 <strong>Educa&ccedil;&atilde;o B&aacute;sica</strong>, que compreende tr&ecirc;s etapas: <br /><br />1.1 <strong>Educa&ccedil;&atilde;o Infantil</strong>: destinada a crian&ccedil;as de 0 a 5 anos, dividida em creches (at&eacute; 3 anos) e pr&eacute;-escolas (4 e 5 anos); <br /><br />1.2 <strong>Ensino Fundamental</strong>: abrange dois ciclos, os anos iniciais (1&ordm; ao 5&ordm; ano, para crian&ccedil;as de 6 a 10 anos) e os anos finais (6&ordm; ao 9&ordm; ano, para alunos de 11 a 14 anos); <br /><br />1.3 <strong>Ensino M&eacute;dio:</strong> para jovens de 15 a 17 anos, com foco na forma&ccedil;&atilde;o geral e prepara&ccedil;&atilde;o para o mundo do trabalho e para a educa&ccedil;&atilde;o superior; <br /><br />2<strong> Educa&ccedil;&atilde;o Superior</strong>, que inclui cursos de: <br /><br />2.1 <strong>Gradua&ccedil;&atilde;o</strong>: (licenciaturas, bacharelados e tecnol&oacute;gicos); <br /><br />2.2 <strong>P&oacute;s-gradua&ccedil;&atilde;o</strong>: lato sensu (especializa&ccedil;&atilde;o) e stricto sensu (mestrado, doutorado e p&oacute;s-doutorado).</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo">A demanda de forma&ccedil;&atilde;o de m&atilde;o de obra qualificada para a industrializa&ccedil;&atilde;o crescente n&atilde;o aumentou a oferta do Ensino M&eacute;dio na primeira metade do s&eacute;culo XX para os subalternos, nem o status social dos trabalhadores qualificados. Em plena ditadura militar, foi promulgada a Lei n&ordm; 5.692/1971, que introduziu a <strong>Educa&ccedil;&atilde;o Profissional como parte do Ensino M&eacute;dio</strong>, preparando os alunos para o mercado de trabalho. N&atilde;o alcan&ccedil;ou seus objetivos, uma vez que o ensino p&uacute;blico n&atilde;o teve recursos para uma Educa&ccedil;&atilde;o Profissional de qualidade e a educa&ccedil;&atilde;o privada continuou a preparar os estudantes para os vestibulares.</p>


<p class="paragrafo">As possibilidades de romper com a dualidade surgiram com a LDB/61, bombardeada pelo peso das escolas confessionais vinculadas &agrave; Igreja Cat&oacute;lica e posteriormente pelo golpe civil-militar; e, ainda, com a LDBEN/96, torpedeada pelas empresas educacionais e por aqueles que defendiam o Estado m&iacute;nimo. Ao contr&aacute;rio, o <span class="primary-color"><strong>Decreto n&ordm; 2.208/1997</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Os Decretos n&ordm; 2.208/1997 e n&ordm; 5.154/2004 e as Leis n&ordm; 11.741/2008, 13.415/2017, 14.645/2023 e 14.945/2024 ser&atilde;o aprofundados nos pr&oacute;ximos cap&iacute;tulos."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;&ldquo;interpretou&rdquo; a LDBEN ao regulamentar a Educa&ccedil;&atilde;o Profissional e, na pr&aacute;tica, impediu a oferta da Educa&ccedil;&atilde;o Profissional integrada ao Ensino M&eacute;dio.</p>


<p class="paragrafo">Somente com o <a rel="noopener" href="http://portal.mec.gov.br/setec/arquivos/pdf_legislacao/superior/legisla_superior_dec5154.pdf" target="_blank">Decreto n&ordm; 5.154/2004</a> e, posteriormente, com a sua incorpora&ccedil;&atilde;o na LDBEN por meio da <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2007-2010/2008/Lei/L11741.htm" target="_blank">Lei n&ordm; 11.741/2008</a> &eacute; que foi refor&ccedil;ada a articula&ccedil;&atilde;o entre Educa&ccedil;&atilde;o Profissional e Ensino M&eacute;dio, acompanhada da ado&ccedil;&atilde;o de pol&iacute;ticas p&uacute;blicas que fomentaram a expans&atilde;o das redes p&uacute;blicas (federais e estaduais), sobretudo na forma de articula&ccedil;&atilde;o integrada. A Educa&ccedil;&atilde;o Profissional passou a ter destaque e recursos e, como era de se esperar, velhas e novas disputas se acirraram.&nbsp;</p>


<p class="paragrafo">O &ldquo;contra-ataque&rdquo;, representado pela <strong>Reforma do Novo Ensino M&eacute;dio</strong> (2017), foi precedido de diversas outras medidas que minaram os espa&ccedil;os de uma poss&iacute;vel EPT emancipat&oacute;ria. <span style="background-color: #bfedd2;">Tal reforma, considerada por muitos uma contrarreforma, institui a precariza&ccedil;&atilde;o, a banaliza&ccedil;&atilde;o e a perda da qualidade da EPT</span>, permitindo a oferta de itiner&aacute;rios formativos, dos quais o quinto seria a Educa&ccedil;&atilde;o Profissional. As lutas pela revers&atilde;o da contrarreforma e a minimiza&ccedil;&atilde;o de seus efeitos danosos levaram a novas propostas, e o resultado provis&oacute;rio, desfavor&aacute;vel &agrave; EPT, est&aacute; consubstanciado nas leis n&ordm; 14.645/2023 e n&ordm; 14.945/2024.</p>


<p class="paragrafo">Dizemos provis&oacute;rio pois, como se alertou na introdu&ccedil;&atilde;o deste t&oacute;pico, as leis s&atilde;o definidas pelas correla&ccedil;&otilde;es de for&ccedil;a na sociedade. Se, no momento, tal correla&ccedil;&atilde;o pende para o polo hegem&ocirc;nico, essa posi&ccedil;&atilde;o poder&aacute; mudar (como aconteceu anteriormente). Para quando isso aconte&ccedil;a, &eacute; importante ter em mente qual projeto de sociedade, de educa&ccedil;&atilde;o e de EPT &eacute; mais adequado &agrave;s necessidades das classes subalternas.</p>


<div id="recursos-azul" class="feat-box-foto">
<p class="destaque">A <strong>perspectiva emancipat&oacute;ria</strong> entende a EPT como elemento fundamental do desenvolvimento socioecon&ocirc;mico e ambiental, com inclus&atilde;o e trabalho decente, &eacute; um dos pilares de garantia da democracia e da soberania nacional. Percebida, tamb&eacute;m, como intercessora e promotora do direito ao trabalho e &agrave; educa&ccedil;&atilde;o, previstos na Constitui&ccedil;&atilde;o de 1988, exige uma forma&ccedil;&atilde;o integral, vinculada ao territ&oacute;rio e &agrave;s comunidades do entorno, formando pessoas, trabalhadores, cidad&atilde;os e sujeitos de direitos. Essa modalidade educacional, que antes era vista com descaso e preconceito, passou a ser considerada&nbsp; como uma das maiores promotoras de oportunidades de <strong>emancipa&ccedil;&atilde;o</strong> de jovens e adultos trabalhadores no Brasil<span style="font-size: 1em;">.</span></p>

</div>


<p class="paragrafo">Deste modo, existe uma rela&ccedil;&atilde;o hist&oacute;rica da EPT com o Ensino M&eacute;dio, com outras <span class="modal-button button" data-toggle="modal" data-target="#modal-2">modalidades de educa&ccedil;&atilde;o</span>&nbsp;de trabalhadores e trabalhadoras &ndash; <span class="primary-color"><strong>Educa&ccedil;&atilde;o de Jovens e Adultos (EJA)</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="A forma da organiza&ccedil;&atilde;o da EPT ser&aacute; detalhada no cap&iacute;tulo 4: &ldquo;EPT na LDB (anos 1990 e 2000) e as normativas infralegais nacionais e estaduais&rdquo;."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;e <span class="primary-color"><strong>Educa&ccedil;&atilde;o do Campo</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="EJA, EPT e Educa&ccedil;&atilde;o do Campo s&atilde;o chamadas de &ldquo;Educa&ccedil;&atilde;o de Trabalhadores&rdquo;. J&aacute; a Educa&ccedil;&atilde;o Ind&iacute;gena e a Educa&ccedil;&atilde;o Quilombola referem-se aos povos tradicionais."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>&nbsp;&ndash; e com a educa&ccedil;&atilde;o ind&iacute;gena e quilombola. Os pontos de converg&ecirc;ncia podem ser:</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Modalidades de educa&ccedil;&atilde;o</h5>
</div>
<div class="modal-body nota"><strong>Educa&ccedil;&atilde;o de Jovens, Adultos e Idosos (EJA)</strong>: destinada &agrave;s pessoas que n&atilde;o completaram a Educa&ccedil;&atilde;o B&aacute;sica na inf&acirc;ncia ou adolesc&ecirc;ncia; <br /><br /><strong>Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (EPT)</strong>: visa a forma&ccedil;&atilde;o para o mundo do trabalho, sem excluir a forma&ccedil;&atilde;o geral, integrando teoria e pr&aacute;tica em cursos de qualifica&ccedil;&atilde;o profissional/forma&ccedil;&atilde;o inicial (FIC) e cursos t&eacute;cnicos de n&iacute;vel m&eacute;dio e n&iacute;vel superior (tecnol&oacute;gico);<br /><br /><strong>Educa&ccedil;&atilde;o do Campo</strong>: voltada para a popula&ccedil;&atilde;o que vive no meio rural, considerando as especificidades do seu contexto social, cultural, territorial - agr&iacute;colas e n&atilde;o-agr&iacute;colas- e as necessidades locais; <br /><br /><strong>Educa&ccedil;&atilde;o Ind&iacute;gena</strong>: adequada &agrave;s realidades culturais, sociais e territoriais dos povos ind&iacute;genas, com doc&ecirc;ncia preferencialmente end&oacute;gena, promovendo uma abordagem intercultural e bil&iacute;ngue; <br /><br /><strong>Educa&ccedil;&atilde;o Quilombola:</strong> adequada &agrave;s realidades culturais, sociais e territoriais das comunidades quilombolas, com doc&ecirc;ncia preferencialmente end&oacute;gena, promovendo uma abordagem intercultural; <br /><br /><strong>Educa&ccedil;&atilde;o Inclusiva</strong>: focada nos estudantes com defici&ecirc;ncias de qualquer natureza (f&iacute;sica, visual, auditiva, intelectual, psicossocial, m&uacute;ltiplas, etc.), oferecendo suporte espec&iacute;fico para a inclus&atilde;o no ambiente escolar regular; <br /><br /><strong>Educa&ccedil;&atilde;o a Dist&acirc;ncia (EAD)</strong>: modalidade em que alunos e professores n&atilde;o est&atilde;o no mesmo espa&ccedil;o f&iacute;sico e/ou momento temporal, utilizando as tecnologias de informa&ccedil;&atilde;o e a comunica&ccedil;&atilde;o para o ensino e a aprendizagem.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<ul>
<li class="paragrafo"><strong>O p&uacute;blico</strong>: todos os grupos subalternos, como trabalhadores e trabalhadoras, seus filhos e filhas (adolescentes e jovens) e grupos &eacute;tnicos em luta por seus direitos. Pode-se ainda acrescentar as pessoas com defici&ecirc;ncia (fazendo um elo com a Educa&ccedil;&atilde;o Inclusiva) e as pessoas privadas de liberdade (em medidas socioeducativas ou em regime prisional);</li>
<li class="paragrafo"><strong>O trabalho como princ&iacute;pio educativo</strong>: para permitir o olhar al&eacute;m da mera instrumentaliza&ccedil;&atilde;o para o mercado e, assim, fazer com que percebam o valor do seu trabalho e a possibilidade de formas de labor, as quais respeitem a dignidade e o potencial humano, sem explora&ccedil;&atilde;o. A <strong>forma&ccedil;&atilde;o cr&iacute;tica</strong> contribui para desafiar a aliena&ccedil;&atilde;o e fomentar a autonomia e, al&eacute;m disso, d&aacute; sentido, pela criticidade, reflex&atilde;o e ressignifica&ccedil;&atilde;o, &agrave;s pr&aacute;ticas e viv&ecirc;ncias pr&eacute;vias que ocorrem durante o processo educativo. J&aacute; a elabora&ccedil;&atilde;o e implementa&ccedil;&atilde;o de projetos comunit&aacute;rios ou de atividades que abordem as necessidades locais fortalece a identidade e a solidariedade entre os membros dos grupos subalternos;</li>
<li class="paragrafo"><strong>A luta pela emancipa&ccedil;&atilde;o</strong>: essa n&atilde;o se limita &agrave; aquisi&ccedil;&atilde;o de habilidades t&eacute;cnicas, mas inclui desenvolver conhecimentos e habilidades sociais e pol&iacute;ticas que permitam a compreens&atilde;o das realidades social e econ&ocirc;mica em que se vive e os mecanismos de opress&atilde;o e desigualdade que as perpetua. A capacita&ccedil;&atilde;o para a organiza&ccedil;&atilde;o e luta pelos direitos promove a forma&ccedil;&atilde;o da consci&ecirc;ncia coletiva, que &eacute; fundamental para a emancipa&ccedil;&atilde;o.</li>
</ul>


<p class="paragrafo">A converg&ecirc;ncia dos objetivos e princ&iacute;pios, al&eacute;m dos conte&uacute;dos necess&aacute;rios, as metodologias adequadas e o respeito &agrave; diversidade e cultura locais perpassam os processos educativos, fortalecendo o polo contra-hegem&ocirc;nico. Entretanto, como se ver&aacute; no pr&oacute;ximo cap&iacute;tulo, o polo hegem&ocirc;nico utiliza todo seu poderio para conformar a educa&ccedil;&atilde;o nacional.</p>


<div id="recursos-azul">
<div id="box-refletir">
<div class="box-refletir-blue">
<div class="header-box-refletir">
<p class="caixa-de-destaque-titulo titulo">Para refletir: sua experi&ecirc;ncia hist&oacute;rica</p>
</div>
<div class="box-refletir-container">

<p class="paragrafo">Agora que voc&ecirc; j&aacute; estudou a origem da legisla&ccedil;&atilde;o sobre o Trabalho, a Educa&ccedil;&atilde;o e a EPT, analise e responda &agrave;s perguntas, para compor o seu memorial.&nbsp;</p>


<ul>
<li class="paragrafo">Voc&ecirc; vivenciou como estudante, docente ou gestor as etapas hist&oacute;ricas abordadas neste t&oacute;pico? Quais delas?</li>
<li class="paragrafo">Qual sua avalia&ccedil;&atilde;o da pol&iacute;tica, do processo e da sua participa&ccedil;&atilde;o?</li>
<li class="paragrafo">Voc&ecirc; participou ou tem not&iacute;cia de atividade de forma&ccedil;&atilde;o de docentes e da comunidade escolar voltada para compreens&atilde;o dos direitos, inclusive educacionais?</li>
<li class="paragrafo">Qual sua avalia&ccedil;&atilde;o da exist&ecirc;ncia (ou n&atilde;o exist&ecirc;ncia) deste tipo de forma&ccedil;&atilde;o?</li>
</ul>

</div>
</div>
</div>
</div>
<p class="content paragrafo quote citacao-curta strong"><span style="text-decoration: underline;"><strong>Gloss&aacute;rio</strong></span></p>


<p class="paragrafo"><strong>Instrumentos legais mais utilizados na Educa&ccedil;&atilde;o</strong></p>


<ul>
<li class="paragrafo">A<strong> lei</strong> &eacute; uma norma jur&iacute;dica, aprovada pelo legislativo e sancionada pelo executivo, que estabelece regras e princ&iacute;pios que devem ser seguidos pela sociedade em geral e pelos servidores e agentes p&uacute;blicos em geral. No contexto da Educa&ccedil;&atilde;o, as leis regulam, por exemplo, a organiza&ccedil;&atilde;o do sistema educacional, a forma&ccedil;&atilde;o de professores e a obrigatoriedade do ensino, sendo a principal delas a Lei de Diretrizes e Bases da Educa&ccedil;&atilde;o Nacional (LDBEN), que estabelece as diretrizes gerais da educa&ccedil;&atilde;o no Brasil.</li>
</ul>


<ul>
<li class="paragrafo">O<strong> decreto</strong> &eacute; um ato administrativo emanado de uma autoridade superior, geralmente do executivo (mas que tamb&eacute;m pode ser emanado pelo legislativo e judici&aacute;rio em casos especiais), que regulamenta a aplica&ccedil;&atilde;o de leis ou estabelece normas espec&iacute;ficas. Na Educa&ccedil;&atilde;o, os decretos podem ser utilizados para implementar pol&iacute;ticas educacionais, como a cria&ccedil;&atilde;o de programas ou a regulamenta&ccedil;&atilde;o de procedimentos administrativos dentro das institui&ccedil;&otilde;es de ensino.</li>
</ul>


<ul>
<li class="paragrafo">A<strong> portaria</strong> &eacute; um ato administrativo que cont&eacute;m instru&ccedil;&otilde;es sobre a aplica&ccedil;&atilde;o de leis ou decretos. Na Educa&ccedil;&atilde;o, as portarias s&atilde;o frequentemente emitidas pelo Minist&eacute;rio da Educa&ccedil;&atilde;o e pelas secretarias estaduais e municipais de educa&ccedil;&atilde;o e podem tratar de assuntos como normas de funcionamento das escolas, diretrizes para matr&iacute;cula e outros procedimentos administrativos.</li>
</ul>


<ul>
<li class="paragrafo">A<strong> instru&ccedil;&atilde;o normativa</strong> &eacute; um ato normativo que tem como objetivo orientar a aplica&ccedil;&atilde;o de leis e regulamentos, sem criar novas obriga&ccedil;&otilde;es. Constituem &ldquo;manuais&rdquo; de execu&ccedil;&atilde;o dos programas, por&eacute;m com valor normativo. Na Educa&ccedil;&atilde;o, as instru&ccedil;&otilde;es normativas s&atilde;o utilizadas para detalhar procedimentos e diretrizes que devem ser seguidos pelas institui&ccedil;&otilde;es de ensino e pelos profissionais da educa&ccedil;&atilde;o, assegurando a conformidade com as normas existentes.</li>
</ul>


<ul>
<li class="paragrafo">O<strong> parecer </strong>&eacute; um documento que expressa a opini&atilde;o t&eacute;cnica ou jur&iacute;dica sobre um determinado assunto. Na Educa&ccedil;&atilde;o, os pareceres podem ser elaborados por &oacute;rg&atilde;os consultivos (Conselhos e F&oacute;runs de Educa&ccedil;&atilde;o) e servir como base para a tomada de decis&otilde;es administrativas, como a an&aacute;lise de recursos ou a interpreta&ccedil;&atilde;o de normas educacionais.</li>
</ul>


<ul>
<li class="paragrafo">A<strong> resolu&ccedil;&atilde;o</strong>&nbsp;&eacute; uma norma jur&iacute;dica que disciplina assuntos decorrentes de um parecer ou de interesse interno de um &oacute;rg&atilde;o ou entidade. No &acirc;mbito educacional, as resolu&ccedil;&otilde;es podem estabelecer diretrizes para a implementa&ccedil;&atilde;o de pol&iacute;ticas educacionais, como a cria&ccedil;&atilde;o de comiss&otilde;es ou a defini&ccedil;&atilde;o de crit&eacute;rios para a avalia&ccedil;&atilde;o de institui&ccedil;&otilde;es de ensino.</li>
</ul>

<p class="paragrafo"><strong>Divis&otilde;es internas das leis</strong></p>


<ul>
<li class="paragrafo"><strong>Artigo </strong>(abrevia&ccedil;&atilde;o art.) &eacute; a divis&atilde;o em um texto legal que permite que se encontre uma informa&ccedil;&atilde;o; separa assuntos distintos, sendo utilizados numerais ordinais partindo do 1&ordm; at&eacute; o quanto seja necess&aacute;rio.</li>
</ul>


<ul>
<li class="paragrafo"><strong>Caput </strong>(&ldquo;cabe&ccedil;a&rdquo;, em latim) indica a parte principal de um artigo, para diferenci&aacute;-la de par&aacute;grafos, incisos e al&iacute;neas.</li>
</ul>


<ul>
<li class="paragrafo"><strong>Par&aacute;grafo </strong>&eacute; o desdobramento de um artigo, que complementa o que est&aacute; sendo exposto na lei ou casos de exce&ccedil;&atilde;o &agrave; regra, sendo utilizado o s&iacute;mbolo &ldquo;&sect;&rdquo;, seguido de numerais ordinais quando houver mais de um &sect; no artigo e &ldquo;par&aacute;grafo &uacute;nico&rdquo; caso tenha apenas um;</li>
</ul>


<ol>
<li class="paragrafo"><strong>Inciso </strong>&eacute; a divis&atilde;o de um artigo ou par&aacute;grafo que detalha o que est&aacute; sendo exposto, sendo representados por numerais romanos (I,II,III etc.).</li>
</ol>


<ul>
<li class="paragrafo"><strong>Al&iacute;nea </strong>&eacute; a subdivis&atilde;o dos incisos ou par&aacute;grafos que lista as partes do que est&aacute; sendo exposto, sendo escrita com letras min&uacute;sculas e par&ecirc;nteses { a), b), c)&hellip;g)&hellip;.}.</li>
</ul>


<ul>
<li class="paragrafo"><strong>Item</strong> &eacute; a subdivis&atilde;o da al&iacute;nea, sendo representada por algarismos cardinais (1., 2.,3. etc.).</li>
</ul>


<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_16.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_19.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 14 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>