<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->
<p class="content paragrafo quote citacao-curta strong"><strong>Tempos amb&iacute;guos</strong></p>


<p class="paragrafo">O avan&ccedil;o da concep&ccedil;&atilde;o e dos programas emancipat&oacute;rios n&atilde;o se deu sem percal&ccedil;os, e as for&ccedil;as hegem&ocirc;nicas conservadoras atuaram em tr&ecirc;s dire&ccedil;&otilde;es: preservar suas estruturas, desqualificar as a&ccedil;&otilde;es mais avan&ccedil;adas e estabelecer pontes, media&ccedil;&otilde;es e &ldquo;consensos&rdquo;, sempre baseados em suas premissas. Nesse movimento, nota-se a ambiguidade: <span style="background-color: #bfedd2;">a continuidade de iniciativas emancipat&oacute;rias acontece junto de novas iniciativas &ldquo;hibridas&rdquo;, ou seja, que apresentam elementos emancipat&oacute;rios, mas permitem a perman&ecirc;ncia da subalterniza&ccedil;&atilde;o.</span></p>


<p class="paragrafo">O desejo de continuidade das pol&iacute;ticas sociais do governo sustentou, por um tempo, as iniciativas emancipat&oacute;rias &ndash; afinal, os avan&ccedil;os sociais foram significativos, como a redu&ccedil;&atilde;o da pobreza e a expans&atilde;o do acesso &agrave; sa&uacute;de e &agrave; educa&ccedil;&atilde;o. Neste sentido, <span class="primary-color"><strong>continuou-se com a expans&atilde;o das redes p&uacute;blicas</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="A expans&atilde;o da EPT e outras a&ccedil;&otilde;es no campo educacional foram apresentadas no Plano de Desenvolvimento da Educa&ccedil;&atilde;o (2007)."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>, levando-as a <strong>superar, pela primeira vez, a oferta privada</strong> de cursos t&eacute;cnicos de n&iacute;vel m&eacute;dio. O processo de expans&atilde;o da rede federal foi iniciado com a cria&ccedil;&atilde;o de escolas t&eacute;cnicas federais (depois transformadas em IFs) nos estados do Acre, Amap&aacute; e Mato Grosso do Sul, bem como no Distrito Federal, por meio da <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_ato2007-2010/2007/lei/l11534.htm" target="_blank">Lei n&ordm; 11.534/2007</a>. Do ponto de vista da interioriza&ccedil;&atilde;o, os IFs e as escolas t&eacute;cnicas estaduais formaram uma malha significativa, muito superior &agrave; privada. Em sucessivas fases de expans&atilde;o, as unidades federais (IFs e seus campi) passaram de 140 a 685, sendo a &uacute;ltima fase iniciada em 2011.</p>


<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.4_FT_4.jpg" alt="card do curso" width="100%" /></p>
<p class="legenda" style="text-align: center;"><strong>Fonte: </strong>Sch&uuml;ler (2023).</p>


<p class="paragrafo">A amplia&ccedil;&atilde;o da <strong>participa&ccedil;&atilde;o da sociedade </strong>na elabora&ccedil;&atilde;o, no acompanhamento e na avalia&ccedil;&atilde;o de pol&iacute;ticas p&uacute;blicas de educa&ccedil;&atilde;o incluiu consultas por meio de audi&ecirc;ncias p&uacute;blicas, envolvendo movimentos sociais, representantes de trabalhadores e empres&aacute;rios, al&eacute;m dos usu&aacute;rios das pol&iacute;ticas. A Educa&ccedil;&atilde;o Profissional p&uacute;blica teve forte presen&ccedil;a em eventos gerais e espec&iacute;ficos, como a Confer&ecirc;ncia Nacional da Educa&ccedil;&atilde;o B&aacute;sica (2008), as Confer&ecirc;ncias Nacionais de Educa&ccedil;&atilde;o (2010 e 2014), o 1&ordm; Semin&aacute;rio Nacional de Educa&ccedil;&atilde;o Profissional (2003), a 1&ordf; Confer&ecirc;ncia Nacional de Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (2006), o 3&ordm; e o 4&ordm; F&oacute;rum Mundial de Educa&ccedil;&atilde;o (2004 e 2009) e os tr&ecirc;s F&oacute;runs Mundiais de Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica (2009, 2012, 2015).</p>


<p class="paragrafo">O Conselho Nacional dos Institutos Federais (CONIF), o F&oacute;rum Nacional de Gestores Estaduais de Educa&ccedil;&atilde;o Profissional (FONAGEP), o Conselho Deliberativo do Fundo de Amparo ao Trabalhador (CODEFAT) e Comiss&otilde;es Tripartite de emprego estaduais foram fortalecidos e frequentemente consultados sobre a&ccedil;&otilde;es relacionadas &agrave; Educa&ccedil;&atilde;o Profissional, buscando alinhamento da oferta de cursos aos projetos de desenvolvimento nacional. A crescente demanda pela Educa&ccedil;&atilde;o Profissional, impulsionada pelo crescimento econ&ocirc;mico e programas de inclus&atilde;o social, como Fome Zero e Bolsa Fam&iacute;lia, destacou a necessidade de aprimorar a efic&aacute;cia e efetividade das pol&iacute;ticas de Educa&ccedil;&atilde;o Profissional e Tecnol&oacute;gica.</p>


<p class="paragrafo">Como resultado das consultas e das press&otilde;es do campo educacional, foram introduzidos na LDBEN avan&ccedil;os importantes relativos &agrave; educa&ccedil;&atilde;o em geral, por meio da <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_Ato2011-2014/2013/Lei/L12796.htm" target="_blank">Lei n&ordm; 12.796/2013</a>, retomando elementos das discuss&otilde;es dos anos 1990 e indo al&eacute;m. Algumas destas importantes modifica&ccedil;&otilde;es est&atilde;o listadas a seguir:</p>



<div id="recursos-azul" class="feat-box-foto">
<ol style="list-style-type: lower-alpha;">
<li class="paragrafo">Educa&ccedil;&atilde;o b&aacute;sica obrigat&oacute;ria e gratuita dos 4 (quatro) aos 17 (dezessete) anos de idade, ou seja, da Educa&ccedil;&atilde;o Infantil ao Ensino M&eacute;dio;</li>
<li class="paragrafo">O acesso &agrave; Educa&ccedil;&atilde;o B&aacute;sica obrigat&oacute;ria como direito p&uacute;blico subjetivo;</li>
<li class="paragrafo">A Educa&ccedil;&atilde;o Infantil como primeira etapa da Educa&ccedil;&atilde;o B&aacute;sica;</li>
<li class="paragrafo">A amplia&ccedil;&atilde;o do atendimento aos educandos com defici&ecirc;ncia, na pr&oacute;pria rede p&uacute;blica regular de ensino (educa&ccedil;&atilde;o inclusiva);</li>
<li class="paragrafo">A forma&ccedil;&atilde;o inicial de docentes para atuar na Educa&ccedil;&atilde;o B&aacute;sica estabelecida em n&iacute;vel superior, em curso de licenciatura, de gradua&ccedil;&atilde;o plena, complementada por meio de cursos de conte&uacute;do t&eacute;cnico-pedag&oacute;gico, em n&iacute;vel m&eacute;dio ou superior, incluindo habilita&ccedil;&otilde;es tecnol&oacute;gicas;&nbsp;</li>
<li class="paragrafo">Al&eacute;m da garantia da forma&ccedil;&atilde;o continuada para os profissionais no local de trabalho ou em institui&ccedil;&otilde;es de Educa&ccedil;&atilde;o B&aacute;sica e superior, incluindo cursos de Educa&ccedil;&atilde;o Profissional, cursos superiores de gradua&ccedil;&atilde;o plena ou tecnol&oacute;gicos e de p&oacute;s-gradua&ccedil;&atilde;o.</li>
</ol>

</div>

<p class="paragrafo">Foi muito importante, especificamente para a Educa&ccedil;&atilde;o Profissional, a aprova&ccedil;&atilde;o da Resolu&ccedil;&atilde;o <a rel="noopener" href="http://portal.mec.gov.br/index.php?option=com_docman&amp;view=download&amp;alias=9917-rceb002-12-1&amp;Itemid=30192" target="_blank">CNE/CEB n&ordm; 02/2012</a> acerca das <strong>Diretrizes Curriculares Nacionais para o Ensino M&eacute;dio</strong> (que estabelecia pontes com o Ensino M&eacute;dio integrado &agrave; Educa&ccedil;&atilde;o Profissional) e da <a rel="noopener" href="https://www.gov.br/mec/pt-br/media/seb-1/pdf/leis/resolucoes_cne/rceb006_12.pdf" target="_blank">Resolu&ccedil;&atilde;o CNE/CP n&ordm; 06/2012</a>, que define as <span class="primary-color"><strong>Diretrizes Curriculares Nacionais para a Educa&ccedil;&atilde;o Profissional T&eacute;cnica de N&iacute;vel M&eacute;dio</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Elementos destas resolu&ccedil;&otilde;es e da resolu&ccedil;&atilde;o da EPT vigente ser&atilde;o pontuados no cap&iacute;tulo 5."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>.</p>


<p class="paragrafo">Apesar de haver uma crise econ&ocirc;mica estava no horizonte, o cen&aacute;rio para a Educa&ccedil;&atilde;o Profissional antes de 2016 ainda era promissor. O aumento dos investimentos estatais na educa&ccedil;&atilde;o em rela&ccedil;&atilde;o ao PIB, o fundo soberano do pr&eacute;-sal e a consolida&ccedil;&atilde;o do FUNDEB assegurariam o financiamento necess&aacute;rio para um passo decisivo que institucionalizaria as pol&iacute;ticas de Educa&ccedil;&atilde;o Profissional: <strong>o Plano Nacional de Educa&ccedil;&atilde;o 2014-2024 e a implementa&ccedil;&atilde;o do Sistema Nacional</strong>. Este sistema contaria com controle social garantido pela realiza&ccedil;&atilde;o peri&oacute;dica das Confer&ecirc;ncias Nacionais de Educa&ccedil;&atilde;o e pela cria&ccedil;&atilde;o do F&oacute;rum Nacional de Educa&ccedil;&atilde;o. Todavia, <span class="primary-color"><strong>infelizmente, n&atilde;o ocorreu como previsto</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Estas quest&otilde;es ser&atilde;o discutidas no cap&iacute;tulo 5."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>.</p>


<p class="paragrafo">Dessa maneira, a crise pol&iacute;tica e institucional iniciada em 2013 exigiu a forma&ccedil;&atilde;o de novas alian&ccedil;as, inclusive para ampliar novas iniciativas, de forte impacto e de alto valor simb&oacute;lico para a popula&ccedil;&atilde;o. Tais iniciativas envolveram agentes do polo hegem&ocirc;nico, como os Servi&ccedil;os Nacionais de Aprendizagem, unificados sob a nomenclatura de &ldquo;Sistema S&rdquo; (uma fic&ccedil;&atilde;o institucional, pois tais estruturas t&ecirc;m diferentes origens, tamanhos, legisla&ccedil;&atilde;o espec&iacute;fica e autonomia, embora convirjam em gest&atilde;o e origem dos recursos).</p>


<p class="paragrafo">Estas institui&ccedil;&otilde;es paraestatais, embora tenham uma gest&atilde;o privada, s&atilde;o mantidas com recursos da contribui&ccedil;&atilde;o compuls&oacute;ria, de 2,5% na &eacute;poca, sobre a folha de pagamento das empresas de cada setor. Como essa contribui&ccedil;&atilde;o &eacute; inclu&iacute;da no pre&ccedil;o dos produtos das empresas e, portanto, repassada ao consumidor, reafirma-se o fato de tais institui&ccedil;&otilde;es serem mantidas com recurso p&uacute;blico.</p>


<p class="paragrafo">As a&ccedil;&otilde;es do governo, no sentido de alinhar as entidades sob gest&atilde;o empresarial ao desenvolvimento nacional, inclu&iacute;ram negociar <strong>maior participa&ccedil;&atilde;o do governo e trabalhadores</strong>&nbsp;nos conselhos (mas ainda em minoria absoluta) dos Servi&ccedil;os de Aprendizagem e Servi&ccedil;os Sociais (2006) e estabelecer os <strong>&ldquo;acordos de gratuidade&ldquo;</strong>&nbsp;(2008), que aumentariam a oferta de cursos de qualifica&ccedil;&atilde;o para os estudantes da rede p&uacute;blica (R$4,8 bilh&otilde;es, at&eacute; 2014). Entretanto, a gest&atilde;o, as estruturas, os conte&uacute;dos, as metodologias e principalmente os objetivos da forma&ccedil;&atilde;o voltados para o mercado e para a subalterniza&ccedil;&atilde;o permaneceram intactos.</p>


<p class="paragrafo">A partir de premissas consistentes (demanda concreta de qualifica&ccedil;&atilde;o, pulveriza&ccedil;&atilde;o das a&ccedil;&otilde;es entre diferentes minist&eacute;rios e necessidade de alinhamento dos provedores de cursos de EPT &agrave;s pol&iacute;ticas de desenvolvimento inclusivo), foi institu&iacute;do o <strong>Programa Nacional de Acesso ao Ensino T&eacute;cnico e Emprego (PRONATEC)</strong> pela <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_ato2011-2014/2011/lei/L12513compilado.htm" target="_blank">Lei n&ordm; 12.513/2011</a>. Al&eacute;m disso, sob forte press&atilde;o por solu&ccedil;&otilde;es de combate ao desemprego, em particular da juventude, foram elaboradas e promulgadas tanto a Lei n&ordm; 12.513/2011, supramencionada, quanto a <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_ato2011-2014/2013/lei/l12816.htm" target="_blank">Lei n&ordm; 12.816/2013</a>, que atualizou o PRONATEC, e, posteriormente, o <a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/_ato2011-2014/2014/decreto/d8268.htm" target="_blank">Decreto n&ordm; 8.268/2014</a>, que modifica o <a rel="noopener" href="https://www2.camara.leg.br/legin/fed/decret/2004/decreto-5154-23-julho-2004-533121-normaatualizada-pe.pdf" target="_blank">Decreto n&ordm; 5.154/2004</a>. Essas leis exemplificam a atua&ccedil;&atilde;o h&iacute;brida citada anteriormente.</p>


<p class="paragrafo">O PRONATEC integrou iniciativas bem-sucedidas, como a amplia&ccedil;&atilde;o da rede federal e o Programa Brasil Profissionalizado (acordo de gratuidade), entre outras a&ccedil;&otilde;es, e foi iniciado com a participa&ccedil;&atilde;o das redes p&uacute;blicas e dos Servi&ccedil;os Nacionais de Aprendizagem. Neste momento, o foco era a EP t&eacute;cnica de n&iacute;vel m&eacute;dio, pactuada entre secretarias estaduais de educa&ccedil;&atilde;o (&ldquo;demandantes&rdquo;) e redes provedoras (&ldquo;ofertantes&rdquo;), o que &eacute;, sem d&uacute;vida, uma inova&ccedil;&atilde;o na forma de fazer EPT no Brasil.</p>


<p class="paragrafo">Entretanto, a estrat&eacute;gia de implanta&ccedil;&atilde;o e as diretrizes operacionais foram no sentido contr&aacute;rio. Os provedores privados assumiram o protagonismo, captando recursos e exigindo contrapartidas, como a autonomia de criar cursos sem a autoriza&ccedil;&atilde;o dos Conselhos Estaduais de Educa&ccedil;&atilde;o e financiamento subsidiado de infraestrutura. O foco, ent&atilde;o, se deslocou para <strong>cursos de curta dura&ccedil;&atilde;o</strong> e, posteriormente, foram inclu&iacute;das as institui&ccedil;&otilde;es de ensino superior t&eacute;cnico privado e redes privadas.</p>


<p class="paragrafo"><span style="background-color: #bfedd2;">Embora os valores e n&uacute;meros sejam significativos, os limites logo se revelaram: baixa capacidade de execu&ccedil;&atilde;o dos ofertantes, distribui&ccedil;&atilde;o regional de recursos assim&eacute;trica e falta de comprometimento com os objetivos do programa. Simultaneamente, foi percebida a aus&ecirc;ncia de estudos consistentes sobre demanda, a influ&ecirc;ncia do setor privado nas tomadas de decis&atilde;o (enquanto demandante e ofertante), disputas sobre metodologias educacionais e a aus&ecirc;ncia de um sistema eficaz para avaliar a qualidade dos cursos.</span></p>


<p class="paragrafo">N&atilde;o houve tempo de corrigir o rumo. As mudan&ccedil;as decorrentes da destitui&ccedil;&atilde;o do governo legitimamente eleito preparam o terreno para as contrarreformas autorit&aacute;rias &ndash; no caso da educa&ccedil;&atilde;o, as Leis n&ordm; 13.415/2017 e n&ordm; 14.945/2024, que reformam o Ensino M&eacute;dio, e a Lei n&ordm; 14.645/2023, que adequa a EPT &agrave;s <span class="primary-color"><strong>reformas</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Os impactos dessas leis ser&atilde;o discutidos no cap&iacute;tulo 5."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>.</p>


<div id="recursos-azul">
<div id="box-refletir">
<div class="box-refletir-blue">
<div class="header-box-refletir">
<p class="caixa-de-destaque-titulo titulo">Para refletir: suas viv&ecirc;ncias em pol&iacute;ticas e programas</p>
</div>
<div class="box-refletir-container">

<p class="paragrafo">Para refletir sobre as suas viv&ecirc;ncias em rela&ccedil;&atilde;o &agrave;s pol&iacute;ticas e programas apresentados, responda por favor, as perguntas a seguir, cujas respostas poder&atilde;o compor o seu Memorial:</p>


<ul>
<li class="paragrafo">Voc&ecirc; conhecia todas estas normativas?&nbsp;</li>
<li class="paragrafo">Quais voc&ecirc; considera as mais importantes para seu cotidiano?&nbsp;</li>
<li class="paragrafo">Quais voc&ecirc; as modificaria? O que voc&ecirc; modificaria nelas? Porqu&ecirc;?</li>
<li class="paragrafo">Voc&ecirc; vivenciou o per&iacute;odo de debate e promulga&ccedil;&atilde;o dessas leis e a implanta&ccedil;&atilde;o dos programas?&nbsp;</li>
<li class="paragrafo">Houve debate na escola ou em outro espa&ccedil;o? Promovidos por quais entidades?&nbsp;</li>
<li class="paragrafo">Voc&ecirc; conhece as opini&otilde;es de seus colegas sobre elas? Elas coincidem com as suas?</li>
</ul>

</div>
</div>
</div>
</div>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_32.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_35.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 25 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>