<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Campo qualifica&ccedil;&atilde;o: o lugar da EPT</strong></p>

<p><span style="font-weight: 400;">A EPT &eacute; um terreno que se situa no espa&ccedil;o de lutas em prol da forma&ccedil;&atilde;o de trabalhadores e trabalhadoras, que, na teoria de Bordieu, pertence ao </span><strong>campo qualifica&ccedil;&atilde;o</strong><span style="font-weight: 400;">, caracterizando-se como interse&ccedil;&atilde;o e ao mesmo tempo resultante (&ldquo;vertente&rdquo;) das lutas nos campos da Produ&ccedil;&atilde;o</span><span style="font-weight: 400;">, da </span><span style="font-weight: 400;">Educa&ccedil;&atilde;o e do Estado. As trocas simb&oacute;licas que ocorrem nesses espa&ccedil;os s&atilde;o ressignificadas para dar conta dos debates espec&iacute;ficos envolvendo qualifica&ccedil;&atilde;o, ou seja, aspectos concretos das rela&ccedil;&otilde;es entre trabalho e educa&ccedil;&atilde;o.&nbsp;</span></p>
<p><span style="font-weight: 400;">No campo qualifica&ccedil;&atilde;o, est&atilde;o em disputa:&nbsp;</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O </span><strong>objetivo</strong><span style="font-weight: 400;">&nbsp;da qualifica&ccedil;&atilde;o (incluindo concep&ccedil;&atilde;o, objetivos gerais e espec&iacute;ficos);<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;"><strong>As</strong> </span><strong>estrat&eacute;gias, os conte&uacute;dos e as metodologias</strong><span style="font-weight: 400;"> (incluindo p&uacute;blico, espa&ccedil;os, curr&iacute;culos, artefatos pedag&oacute;gicos e normativas);&nbsp;&nbsp;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O </span><strong>financiamento</strong><span style="font-weight: 400;"> da qualifica&ccedil;&atilde;o, particularmente o que envolve pol&iacute;ticas e recursos p&uacute;blicos.&nbsp;</span></li>
</ul>
<p><span style="font-weight: 400;">Destes tr&ecirc;s conjuntos de quest&otilde;es nasce a grande maioria das premissas que embasam cada um e o conjunto das decis&otilde;es governamentais, seja de forma expl&iacute;cita ou impl&iacute;cita. E, nas &ldquo;batalhas campais&rdquo;, a vit&oacute;ria passa por exercer a hegemonia, por meio da viol&ecirc;ncia simb&oacute;lica, pelo convencimento ou mesmo pela coa&ccedil;&atilde;o &ndash; aqui inclu&iacute;do tentar &ldquo;aniquilar&rdquo; o inimigo pelo afastamento f&iacute;sico, pela detra&ccedil;&atilde;o das concep&ccedil;&otilde;es e a&ccedil;&otilde;es &ndash; e por meio das trocas simb&oacute;licas.</span></p>
<p><span style="font-weight: 400;">Apesar da disputa de concep&ccedil;&otilde;es e narrativas ser um processo cont&iacute;nuo nos campos sociais, em tempos de crise, a </span><strong>luta simb&oacute;lica</strong><span style="font-weight: 400;"> se acirra, tanto no sentido de manter (ou impor) uma nova concep&ccedil;&atilde;o hegem&ocirc;nica quanto na perspectiva contra-hegem&ocirc;nica de questionar o estabelecido e defender os terrenos conquistados em lutas anteriores.</span></p>
<p><span style="font-weight: 400;">Neste acirramento ocorrem intensas </span><strong>trocas simb&oacute;licas</strong><span style="font-weight: 400;">, nas quais nada &eacute; por acaso. Mesmo a aparente neutralidade e/ou ingenuidade serve a um dos lados. No infogr&aacute;fico abaixo &eacute; poss&iacute;vel observar alguns exemplos comuns dessas trocas.</span></p>

<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.5_INF_3 final.png" alt="" width="90%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo:&nbsp;</strong><span style="font-weight: 400;">Pr&aacute;ticas comuns de trocas simb&oacute;licas<br /></span><strong>Fonte: </strong><span style="font-weight: 400;">Prosa (2025d).</span></p>
<p><span style="font-weight: 400;">Entretanto, &eacute; imposs&iacute;vel conciliar antagonismos sociais sem perder a ess&ecirc;ncia e a identidade contra-hegem&ocirc;nicas. Exemplificando as lutas e trocas simb&oacute;licas no Campo Qualifica&ccedil;&atilde;o, apresentam-se teorias que advogam &ldquo;o fim do trabalho&rdquo; e/ou sua perda de centralidade na vida social. <span style="background-color: #bfedd2;">No campo educacional, a rejei&ccedil;&atilde;o ao papel do trabalho na socializa&ccedil;&atilde;o e na constru&ccedil;&atilde;o das identidades sociais decorre, por desconhecimento ou ret&oacute;rica, de opor-se a &ldquo;profissionaliza&ccedil;&atilde;o tecnicista&rdquo; (atribu&iacute;da &agrave; EPT) &agrave; &ldquo;forma&ccedil;&atilde;o humanista&rdquo; (foco da Educa&ccedil;&atilde;o B&aacute;sica).</span> Isso tem dificultado o entendimento do significado de uma Educa&ccedil;&atilde;o Profissional emancipat&oacute;ria.&nbsp;</span></p>
<p><span style="font-weight: 400;">A concep&ccedil;&atilde;o emancipat&oacute;ria da Educa&ccedil;&atilde;o Profissional em nada contradiz a perspectiva de uma forma&ccedil;&atilde;o humana. Ao contr&aacute;rio, para determinados educadores falta a compreens&atilde;o de que n&atilde;o pode existir educa&ccedil;&atilde;o integral sem que a dimens&atilde;o do trabalho seja considerada. Assim, a Educa&ccedil;&atilde;o Profissional deve ser </span><span style="font-weight: 400;">considerada em seus aspectos filos&oacute;ficos e sociol&oacute;gicos (nos anos finais do Ensino Fundamental e no Ensino M&eacute;dio proped&ecirc;utico), acrescida dos aspectos cient&iacute;ficos, tecnol&oacute;gicos e &eacute;ticos (na Educa&ccedil;&atilde;o Profissional integrada, concomitante ou subsequente ao Ensino M&eacute;dio e &agrave; Educa&ccedil;&atilde;o de Jovens e Adultos (EJA) no n&iacute;vel fundamental e m&eacute;dio).</span></p>
<p><span style="font-weight: 400;">Outro exemplo s&atilde;o as </span><strong>Diretrizes Curriculares Nacionais (DCN) espec&iacute;ficas</strong>,<span style="font-weight: 400;"> &ldquo;atualizadas&rdquo; pelo </span><strong>Conselho Nacional de Educa&ccedil;&atilde;o (CNE)</strong><span style="font-weight: 400;">. A partir delas, o curr&iacute;culo da maioria dos cursos de Pedagogia, por exemplo, atesta o afastamento da dimens&atilde;o trabalho na forma&ccedil;&atilde;o desses profissionais da Educa&ccedil;&atilde;o.</span></p>
<p><span style="font-weight: 400;">Consequentemente, estes passam a desconhecer como as injun&ccedil;&otilde;es do mundo do trabalho interferem na estrutura educacional e no curr&iacute;culo, bem como na organiza&ccedil;&atilde;o de seu trabalho e nas pr&aacute;ticas pedag&oacute;gicas cotidianas.&nbsp;</span></p>
<p><span style="font-weight: 400;">Do mesmo modo, as DCN para a EPT e para a EJA, no bojo da contrarreforma do Ensino M&eacute;dio, espelham um retrocesso conceitual e pol&iacute;tico. Isso ocorre ap&oacute;s duas d&eacute;cadas de discuss&otilde;es e avan&ccedil;os gradativos. As &ldquo;novas&rdquo; diretrizes enfatizam os aspectos pragm&aacute;ticos e t&eacute;cnico-instrumentais, ao tempo que oferecem um curr&iacute;culo fragmentado e superficial.</span></p>
<p><span style="font-weight: 400;">Veja, abaixo, algumas premissas e no&ccedil;&otilde;es no debate acad&ecirc;mico e nos discursos e documentos oficiais sobre pol&iacute;ticas educacionais e de trabalho, emprego e renda (retomando a discuss&atilde;o conceitual do cap&iacute;tulo 1):</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Centralidade no indiv&iacute;duo e </span><strong>elogio &agrave; meritocracia</strong><span style="font-weight: 400;"> em contraposi&ccedil;&atilde;o aos valores da solidariedade, empatia, equidade, justi&ccedil;a social etc.;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>Mito da gest&atilde;o privada superior &agrave; gest&atilde;o p&uacute;blica</strong><span style="font-weight: 400;">, implicando na perda de autonomia e na transfer&ecirc;ncia de recursos que poderiam ser retroalimentados nas universidades, institui&ccedil;&otilde;es e &oacute;rg&atilde;os p&uacute;blicos;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">As </span><strong>tentativas de domesticar o que &eacute; emancipat&oacute;rio</strong><span style="font-weight: 400;">. Um exemplo &eacute; a rela&ccedil;&atilde;o com o pensamento libertador do pedagogo <span class="modal-button button" data-toggle="modal" data-target="#modal-1">Paulo Freire</span></span><span style="font-weight: 400;"><span style="font-weight: 400;"><span style="font-weight: 400;"><span style="font-weight: 400;">, cuja for&ccedil;a pol&iacute;tica &eacute; atenuada em pretensas homenagens e lembran&ccedil;as de ditos de sua autoria, quase sempre descontextualizados e fragmentados, enquanto a proposta pol&iacute;tico-pedag&oacute;gica freireana, apesar de citada, quase nunca &eacute; colocada em pr&aacute;tica.</span></span></span></span>

<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Paulo Freire</h5>
</div>
<div class="modal-body nota">Paulo Freire (1921-1997) foi um educador e fil&oacute;sofo brasileiro, nascido em Recife. Reconhecido como Patrono da Educa&ccedil;&atilde;o Brasileira, Freire &eacute; conhecido principalmente por sua obra <em>Pedagogia do Oprimido</em> e pelo desenvolvimento de um m&eacute;todo inovador de alfabetiza&ccedil;&atilde;o de adultos, focado no di&aacute;logo e na conscientiza&ccedil;&atilde;o cr&iacute;tica. O brasileiro se consagrou como um dos pensadores mais conceituados na hist&oacute;ria da pedagogia mundial, tendo influenciado o movimento da Pedagogia Cr&iacute;tica ao redor do mundo e se tornado refer&ecirc;ncia internacional. Apesar disso, sua teoria e m&eacute;todo nunca foram aplicados em larga escala no Brasil. <br /><img style="max-width: 100%; padding: 10px;" src="medias/EJA.1_MNT_1.png" alt="" /><strong>T&iacute;tulo: </strong>Paulo Freire <strong>Fonte:</strong> Novo Horizonte de Economia Solid&aacute;ria (2011). <strong>Elabora&ccedil;&atilde;o:</strong> Prosa (2024).
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<span style="font-weight: 400;"><span style="font-weight: 400;"><span style="font-weight: 400;"><span style="font-weight: 400;"><!-- Fim nota modal --></span></span></span></span>

<span style="font-weight: 400;"><span style="font-weight: 400;"><span style="font-weight: 400;"><br /></span></span></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>No&ccedil;&atilde;o e modelo de compet&ecirc;ncias </strong><span style="font-weight: 400;">constru&iacute;do como matriz formativa fundante do <strong>perfil do sujeito trabalhador &ldquo;empreg&aacute;vel&rdquo;</strong>;<br /><br /></span></li>
<li><strong>Empregabilidade como atributo e responsabilidade </strong><span style="font-weight: 400;">do sujeito trabalhador, em detrimento da no&ccedil;&atilde;o de seguridade social coletiva;<br /></span></li>
<li><strong>Empreendedorismo enquanto projeto de vida</strong><span style="font-weight: 400;">&nbsp;e solu&ccedil;&atilde;o para o desemprego, que emula o &ldquo;esp&iacute;rito capitalista&rdquo; em detrimento de a&ccedil;&otilde;es associativas e solid&aacute;rias;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><strong>Metodologias &ldquo;ativas&rdquo;</strong><span style="font-weight: 400;">, em oposi&ccedil;&atilde;o &agrave; did&aacute;tica de base hist&oacute;rico-cr&iacute;tica, dial&eacute;tica e dial&oacute;gica.</span></li>
</ul>
<p><span style="font-weight: 400;">Obviamente tais quest&otilde;es n&atilde;o s&atilde;o novas, mas s&atilde;o apresentadas como &ldquo;inova&ccedil;&otilde;es&rdquo;, quando na pr&aacute;tica representam mais do mesmo: &ldquo;velhas novidades&rdquo;. Emolduradas por belas express&otilde;es e frases de efeito, passam a frequentar as falas de pessoas tanto do polo hegem&ocirc;nico quanto do contra-hegem&ocirc;nico.&nbsp;</span></p>
<p><span style="font-weight: 400;">Quaisquer tentativas de distinguir o sentido desses termos, t&atilde;o potentes do ponto de vista simb&oacute;lico, e recoloc&aacute;-los em seu devido contexto e significado resulta em ataques, sendo o discurso contra-hegem&ocirc;nico acusado de &ldquo;academicismo&rdquo;, &ldquo;discurso ideol&oacute;gico&rdquo; ou algo do g&ecirc;nero. A desqualifica&ccedil;&atilde;o do opositor como m&eacute;todo vai desde os &ldquo;suaves&rdquo; apelidos (&ldquo;freireanos rom&acirc;nticos&rdquo;, &ldquo;marxistas ultrapassados&rdquo; etc.) a a&ccedil;&otilde;es bem mais graves como &ldquo;cancelamentos&rdquo; em redes sociais, a&ccedil;&otilde;es judiciais, execra&ccedil;&atilde;o p&uacute;blica, ou seja, em tudo semelhante a um tribunal de inquisi&ccedil;&atilde;o. Ali&aacute;s, n&atilde;o &eacute; esse o significado e pr&aacute;tica do &ldquo;movimento escola sem partido&rdquo;? Docentes n&atilde;o est&atilde;o sendo filmados e constrangidos em sala de aula, acusados injustamente, amea&ccedil;ados, perseguidos e atacados tanto no espa&ccedil;o virtual como no real?</span></p>
<p><span style="font-weight: 400;">Um exemplo diretamente ligado &agrave; EPT &eacute; a utiliza&ccedil;&atilde;o frequente do termo &ldquo;ensino profissionalizante&rdquo; como sin&ocirc;nimo de Educa&ccedil;&atilde;o Profissional. Parece algo trivial e inocente, ou apenas uma quest&atilde;o sem&acirc;ntica ou terminol&oacute;gica, entretanto tem exercido papel importante na luta simb&oacute;lica. </span><span style="font-weight: 400;">Mesmo n&atilde;o sendo encontrado nas principais legisla&ccedil;&otilde;es educacionais (estudadas nos cap&iacute;tulos 2 e 4), tornou-se de uso corrente. </span></p>
<p><span style="font-weight: 400;">Geralmente, esse termo refere-se a cursos de curta dura&ccedil;&atilde;o (qualifica&ccedil;&atilde;o profissional ou forma&ccedil;&atilde;o inicial e continuada &ndash; FIC), n&atilde;o vinculados &agrave; escolaridade e centrados no </span><strong style="font-size: 1em;">&ldquo;saber fazer"</strong><span style="font-weight: 400;">, com foco no mercado de trabalho imediato e, ainda, utilizados como pol&iacute;tica compensat&oacute;ria. Historicamente, esse tipo de oferta, no Brasil, est&aacute; associado a uma educa&ccedil;&atilde;o voltada para as classes subalternas, com o objetivo de capacitar m&atilde;o de obra para a ind&uacute;stria, com&eacute;rcio e servi&ccedil;os, na maioria das vezes em </span><strong style="font-size: 1em;">empregos prec&aacute;rios e/ou mal remunerados</strong><span style="font-weight: 400;">.</span></p>
<p><span style="font-weight: 400;">Como foi visto, a </span><a rel="noopener" href="https://www.planalto.gov.br/ccivil_03/Leis/L5692.htm" target="_blank"><span style="font-weight: 400;">Lei n&ordm; 5.692/71</span></a><span style="font-weight: 400;">&nbsp;estabeleceu a profissionaliza&ccedil;&atilde;o como finalidade obrigat&oacute;ria para o Ensino M&eacute;dio, fazendo com que os cursos se expandissem para al&eacute;m das unidades escolares especializadas (escolas t&eacute;cnicas). Centrado na ideia de &ldquo;ensino&rdquo;, sem projeto pedag&oacute;gico, laborat&oacute;rios e docentes, o projeto foi um grande fracasso.</span></p>
<p><span style="font-weight: 400; background-color: #bfedd2;">O termo &ldquo;Educa&ccedil;&atilde;o Profissional<span style="font-weight: 400;">&rdquo;</span>, ao qual foi acrescentado posteriormente o termo &ldquo;Tecnol&oacute;gica<span style="font-weight: 400;">&rdquo;</span>, &eacute; mais amplo, abrangente e consistente.</span><span style="font-weight: 400;"> A LDBEN/96 (e suas altera&ccedil;&otilde;es), ao definir a EPT como &ldquo;educa&ccedil;&atilde;o&rdquo; e n&atilde;o apenas &ldquo;ensino&rdquo;, apontou para o reconhecimento de algumas quest&otilde;es:</span></p>
<ul>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">As especificidades da modalidade e de sua rela&ccedil;&atilde;o indissol&uacute;vel com a Educa&ccedil;&atilde;o B&aacute;sica, podendo ser oferecida de forma integrada ou concomitante ao Ensino Fundamental e M&eacute;dio e &agrave; EJA;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A necessidade de uma carreira docente espec&iacute;fica, com respectiva forma&ccedil;&atilde;o inicial e continuada, incluindo a p&oacute;s-gradua&ccedil;&atilde;o;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A import&acirc;ncia das institui&ccedil;&otilde;es especializadas em EPT: IFs, Centros, Escolas T&eacute;cnicas etc.;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A possibilidade de articula&ccedil;&atilde;o com as universidades para atividades de pesquisa e extens&atilde;o e de <span class="modal-button button" data-toggle="modal" data-target="#modal-2">verticaliza&ccedil;&atilde;o</span></span><span style="font-weight: 400;"><span style="font-weight: 400;">&nbsp;da Educa&ccedil;&atilde;o B&aacute;sica para a Superior;</span></span>

<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-2" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Verticaliza&ccedil;&atilde;o</h5>
</div>
<div class="modal-body nota">A verticaliza&ccedil;&atilde;o &eacute; uma forma de prosseguimento de estudos na qual h&aacute; um ac&uacute;mulo de conhecimentos espec&iacute;ficos, os quais podem ser aproveitados na etapa ou no n&iacute;vel educacional seguinte. Para um profissional da Enfermagem, por exemplo, a ordem dessas etapas seria: 1. T&eacute;cnico em enfermagem (n&iacute;vel m&eacute;dio) 2. Gradua&ccedil;&atilde;o em Enfermagem (n&iacute;vel superior) 3. P&oacute;s-gradua&ccedil;&atilde;o dentro da enfermagem.</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<span style="font-weight: 400;"><span style="font-weight: 400;"><!-- Fim nota modal --></span></span>

<span style="font-weight: 400;"><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Na perspectiva da educa&ccedil;&atilde;o integral dos estudantes, docentes e funcion&aacute;rios, o aprofundamento dos estudos em Filosofia, Sociologia, Psicologia e Hist&oacute;ria da Educa&ccedil;&atilde;o Profissional, al&eacute;m da did&aacute;tica e de metodologias espec&iacute;ficas para a modalidade;<br /><br /></span></li>
<li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Al&eacute;m da forma&ccedil;&atilde;o </span><em><span style="font-weight: 400;">da</span></em><span style="font-weight: 400;"> pessoa e </span><em><span style="font-weight: 400;">para </span></em><span style="font-weight: 400;">a cidadania, a forma&ccedil;&atilde;o para o mundo do trabalho, na compreens&atilde;o da sua totalidade, complexidade e contradi&ccedil;&otilde;es.</span></li>
</ul>
<p><span style="font-weight: 400;">Por isso, </span><span style="font-weight: 400; background-color: #bfedd2;">travar um combate eficiente no plano simb&oacute;lico deve ser uma tarefa coletiva</span><span style="font-weight: 400;"><span style="background-color: #bfedd2;">:</span> passa pela coragem de discordar dos falsos consensos, por desvelar o que est&aacute; nas entrelinhas e n&atilde;o aceitar a injusti&ccedil;a epist&ecirc;mica (na qual a fala da autoridade desqualifica o interlocutor subalterno). &Eacute;, tamb&eacute;m, alicer&ccedil;ar uma forma&ccedil;&atilde;o s&oacute;lida com teorias emancipat&oacute;rias e, sobretudo, perceber que a pr&aacute;tica &eacute; o mais eficiente crit&eacute;rio da verdade.</span></p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_37.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_39.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 29 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>