<!DOCTYPE html>
<html lang="pt-br">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    
    <title>Núcleo específico</title>
  
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link href="https://fonts.google.com/icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Merriweather+Sans:ital,wght@0,300..800;1,300..800&display=swap" rel="stylesheet">
    <link rel="stylesheet" type="text/css" href="css/main.css">
    <link rel="stylesheet" href="https://netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" class="holderjs">
    <link href="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/css/swiffy-slider.min.css" rel="stylesheet" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/swiffy-slider@1.6.0/dist/js/swiffy-slider.min.js" crossorigin="anonymous" defer=""></script>


    <script>
      paginaAtual = 1;
    </script>

    <script src="//code.iconify.design/1/1.0.6/iconify.min.js"></script>
    <script src="js/main.js"></script>
  </head>

<body id="body">

    <header id="header" class="nav-down">
  <div class="header-1">
    <nav class="navbar">
      <ul class="options navbar-nav mr-auto text-left">
        
        <li class="nav-item">
          <a class="nav-link" id="acessilibityScrollTop" href="#">Ir para o topo</a>
        </li>

        <li class="nav-item">
          <a class="nav-link" id="acessilibityFooter" href="#footer">Ir para o rodapé</a>
        </li>
      </ul>

      <ul class="navbar-nav menu-acessibilidade">
        <li class="nav-item">
          <a class="nav-link" target="_blank" href="./acessibilidade.html">Acessibilidade</a>
        </li>
      </ul>
    </nav>
  </div>

  <div class="header-2">
    <nav class="navbar">
      <a class="navbar-brand" href="./index.html">
        <img alt="Logotipo" height="35" src="imagens/ept.svg">

        <div class="navbar-brand-mg">
          <p class="">
            <strong>Formação de Profissionais</strong>
          </p>

          <p>
            <strong>para a EPT</strong>
          </p>
        </div>
      </a>

      <div class="navbar-content">
        <div class="navbar-content-row">
          <div class="navbar-title thematic-title">
              
          </div>
        </div>

        <div class="navbar-content-row">
          <div class="navbar-chapter page-title">
          Núcleo específico - Políticas Públicas e Legislação para a Educação Profissional e Tecnológica
          </div>
        </div>
      </div>
    </nav>
  </div>
</header>
  <!-- Sumário - telas maiores-->
<div id="sidebar-desktop">
  <!-- Botão sumário fechado -->
  <button class="sidebar-open">
    Sumário
    <span class="iconify" data-icon="mdi-forwardburger" data-rotate="90deg"></span>
  </button>

  <nav class="sidebar sidebar-close" role="navigation">
    <!-- Botão sumário aberto -->
    <div class="sidebar-header">
      <div class="sidebar-title">
        Sumário
      </div>
      <button class="sidebar-close-btn">
        <span class="iconify" data-icon="mdi-backburger"></span>
      </button>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui 
      </ul>-->
    </div>
  </nav>
</div>    

<!-- Sumário - telas pequenas -->
<div id="sidebar-mobile" class="d-md-none">
  <nav class="sidebar sidebar-close" role="navigation">
    <div class="sidebar-header">
      <div class="label">
        Sumário
      </div>
    </div>

    <div class="sidebar-body">
      <ul class="sidebar-nav" id="sidebar-nav">
        <!-- Itens do menu serão inseridos aqui -->
      </ul>
    </div>

    <div class="sidebar-header-tow">
      <div class="sidebar-title">
      </div>
    </div>
    
    <div class="sidebar-body-tow">
      <!--<ul class="sidebar-nav" id="sidebar-nav">
         Itens do menu serão inseridos aqui
      </ul> -->
    </div>
  </nav>
</div>
  <div id="recursos-azul">
<div id="content">
<div id="main" class="main">
<div class="container-fluid">
<div class="row">
<div class="col-md-6 offset-md-3 content-page"><!-- Texto Conteúdo -->

<p class="content paragrafo quote citacao-curta strong"><strong>Globaliza&ccedil;&atilde;o excludente</strong></p>


<p class="paragrafo"><span style="background-color: #bfedd2;">A globaliza&ccedil;&atilde;o &eacute; um fen&ocirc;meno complexo e multidimensional que envolve a integra&ccedil;&atilde;o econ&ocirc;mica, social, cultural e pol&iacute;tica entre pa&iacute;ses e regi&otilde;es em escala mundial.</span>&nbsp;Alguns aspectos-chave da globaliza&ccedil;&atilde;o incluem:</p>


<ol style="list-style-type: lower-alpha;">
<li class="paragrafo">A <strong>integra&ccedil;&atilde;o</strong>&nbsp;dos mercados financeiros e de bens e servi&ccedil;os em n&iacute;vel global, com a redu&ccedil;&atilde;o de barreiras comerciais e um maior fluxo de capitais, mercadorias e pessoas entre pa&iacute;ses;</li>
<li class="paragrafo">A utiliza&ccedil;&atilde;o do <strong>avan&ccedil;o das tecnologias</strong>&nbsp;de informa&ccedil;&atilde;o e comunica&ccedil;&atilde;o, que permitem uma maior interconectividade e a circula&ccedil;&atilde;o mais r&aacute;pida de informa&ccedil;&otilde;es, ideias e conhecimento;</li>
<li class="paragrafo">A emerg&ecirc;ncia de institui&ccedil;&otilde;es e acordos internacionais que regulam e coordenam as <strong>rela&ccedil;&otilde;es entre pa&iacute;ses</strong>, como a Organiza&ccedil;&atilde;o Mundial do Com&eacute;rcio (OMC), o Fundo Monet&aacute;rio Internacional (FMI), o Banco Internacional para Reconstru&ccedil;&atilde;o e Desenvolvimento (Banco Mundial), acordos de livre com&eacute;rcio etc.;</li>
<li class="paragrafo">Maior difus&atilde;o de <strong>valores, estilos de vida e pr&aacute;ticas culturais</strong>&nbsp;dos pa&iacute;ses ocidentais em escala global;&nbsp;</li>
<li class="paragrafo">O surgimento de <strong>problemas globais</strong>&nbsp;que requerem solu&ccedil;&otilde;es cooperativas entre pa&iacute;ses, como mudan&ccedil;as clim&aacute;ticas, pandemias, terrorismo etc.</li>
</ol>


<p class="paragrafo">A globaliza&ccedil;&atilde;o gera oportunidades e vantagens e produz riqueza. Entretanto, sob o controle das megacorpora&ccedil;&otilde;es dos &ldquo;pa&iacute;ses centrais&rdquo; (ou &ldquo;ricos&rdquo;), tem sido duramente criticada &ndash; com raz&atilde;o &ndash; por gerar desigualdades e exclus&atilde;o social. Essa globaliza&ccedil;&atilde;o excludente fica expl&iacute;cita na medida em que os benef&iacute;cios da integra&ccedil;&atilde;o global s&atilde;o concentrados em uma pequena parcela da popula&ccedil;&atilde;o, enquanto os grandes contingentes ficam &agrave; margem. Al&eacute;m disso, h&aacute; uma polariza&ccedil;&atilde;o crescente entre &ldquo;ricos globalizados e pobres localizados&rdquo;, com os &uacute;ltimos ficando estagnados aos contextos locais e sem acesso &agrave;s oportunidades da globaliza&ccedil;&atilde;o. Deste modo, as empresas transnacionais e institui&ccedil;&otilde;es financeiras globais adquirem grande poder de influenciar as pol&iacute;ticas p&uacute;blicas em detrimento dos interesses da maioria.</p>


<p class="paragrafo">Estes efeitos s&atilde;o agravados pelas pol&iacute;ticas neoliberais de desregulamenta&ccedil;&atilde;o econ&ocirc;mica, privatiza&ccedil;&atilde;o e redu&ccedil;&atilde;o do papel do Estado, movimentos que aprofundam as desigualdades e enfraquecem os mecanismos de prote&ccedil;&atilde;o social. Diante desses problemas, autores renomados, como o ge&oacute;grafo brasileiro Milton Santos, e movimentos sociais (articulados no <span class="primary-color"><strong>F&oacute;rum Social Mundial</strong> <button class="btn-icon-small btn-primary-lighter" title="" data-toggle="tooltip" data-placement="bottom" data-original-title="Evento global que re&uacute;ne movimentos sociais, ONGs e ativistas para debater alternativas ao modelo econ&ocirc;mico e social dominante."> <em class="fa fa-plus-square" aria-hidden="true"></em> </button></span>) prop&otilde;em uma <strong>"outra globaliza&ccedil;&atilde;o"</strong>, baseada em princ&iacute;pios como justi&ccedil;a social e equidade, com uma distribui&ccedil;&atilde;o mais justa dos benef&iacute;cios da globaliza&ccedil;&atilde;o e coopera&ccedil;&atilde;o internacional baseada na solidariedade e no respeito &agrave; soberania dos povos, em contraposi&ccedil;&atilde;o &agrave; l&oacute;gica do mercado e do lucro.</p>


<div id="recursos-azul"><!-- Modal aberto-->
<div id="modal-1" class="modal fade" role="dialog" aria-labelledby="exampleModalCenterTitle" aria-hidden="true">
<div class="modal-dialog modal-dialog-centered" role="document">
<div class="modal-content">
<div class="modal-header">
<h5 id="exampleModalLongTitle" class="modal-title caixa-de-destaque-titulo">Milton Santos</h5>
</div>
<div class="modal-body nota">
<p>&nbsp;</p>
</div>
<div class="modal-footer"><button class="btn btn-link" data-dismiss="modal" type="button"> <a class="btn button btn-lg btn-nav-prev"> Fechar Nota </a> </button></div>
</div>
</div>
</div>
</div>
<p><!-- Fim nota modal --></p>


<p class="paragrafo">Al&eacute;m disso, reivindicam a urg&ecirc;ncia do respeito &agrave; diversidade cultural e aos direitos humanos, combatendo a homogeneiza&ccedil;&atilde;o cultural e a discrimina&ccedil;&atilde;o e, ainda, defendendo a sustentabilidade ambiental, a partir de um modelo de desenvolvimento que preserve os recursos naturais e o equil&iacute;brio ecol&oacute;gico. Para tanto, <span style="background-color: #bfedd2;">exigem a democratiza&ccedil;&atilde;o das institui&ccedil;&otilde;es globais e maior participa&ccedil;&atilde;o da sociedade civil nos processos de tomada de decis&atilde;o</span>.</p>


<p><img class="card-curso-topo-image" style="display: block; margin-left: auto; margin-right: auto;" src="medias/PP.3_INF_3.png" alt="card do curso" width="90%" /></p>
<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: </strong>Uma outra globaliza&ccedil;&atilde;o<br /><strong>Fonte: </strong>Prosa (2025c).</p>

<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura --></div>
<p class="content paragrafo quote citacao-curta strong"><span style="font-size: 24pt;"><strong>Reforma do Estado</strong></span></p>


<p class="paragrafo">A an&aacute;lise do Estado nas sociedades capitalistas contempor&acirc;neas n&atilde;o deve se limitar ao seu papel instrumental, mas considerar sua complexidade e autonomia. O Estado &eacute; influenciado pelas lutas sociais, apresentando diferentes formas ao longo da hist&oacute;ria, como o Estado liberal e o Estado de bem-estar social.</p>


<p class="paragrafo">No Brasil, o Estado n&atilde;o se consolidou plenamente como liberal ou de bem-estar, mantendo caracter&iacute;sticas patrimonialistas que resultam em um Estado &ldquo;protetor de privil&eacute;gios&rdquo;. As pol&iacute;ticas sociais s&atilde;o secund&aacute;rias, e as elites buscam conter a crescente press&atilde;o por participa&ccedil;&atilde;o de setores populares que apresentam suas reivindica&ccedil;&otilde;es e, assim, tentam estabelecer regras duradouras a seu favor.</p>


<p class="paragrafo">Neste sentido, movimentos sociais no Brasil e no mundo t&ecirc;m proposto alternativas de desenvolvimento baseadas na <strong>sustentabilidade </strong>e na <strong>solidariedade</strong>, visando &agrave; defesa dos microssistemas locais que funcionam em articula&ccedil;&atilde;o com as pol&iacute;ticas p&uacute;blicas de &acirc;mbito regional e nacional. A solidariedade &eacute; um acr&eacute;scimo necess&aacute;rio, n&atilde;o apenas para distinguir esta alternativa de outras, estimuladas por &oacute;rg&atilde;os governamentais e pelas grandes corpora&ccedil;&otilde;es empresariais, mas para reafirmar que o objetivo central do desenvolvimento &eacute; o ser humano e n&atilde;o o mercado.</p>


<p class="paragrafo"><span style="background-color: #bfedd2;">A reforma do Estado &eacute; um processo de transforma&ccedil;&atilde;o das estruturas e fun&ccedil;&otilde;es do Estado, visando adapt&aacute;-lo a novos desafios e demandas sociais.</span> No contexto da ascens&atilde;o do neoliberalismo, a partir da d&eacute;cada de 1970, a reforma do Estado esteve intimamente relacionada a esse movimento ideol&oacute;gico e pol&iacute;tico. Al&eacute;m disso, o processo de reforma tamb&eacute;m se articula com a reestrutura&ccedil;&atilde;o produtiva e a globaliza&ccedil;&atilde;o.</p>


<p class="paragrafo">Al&eacute;m disso, o processo de reforma tamb&eacute;m se articula com a reestrutura&ccedil;&atilde;o produtiva e a globaliza&ccedil;&atilde;o. Dessa maneira, a reforma do Estado envolve mudan&ccedil;as em diversos aspectos, tais como a redefini&ccedil;&atilde;o do papel e das fun&ccedil;&otilde;es do Estado, a descentraliza&ccedil;&atilde;o e desconcentra&ccedil;&atilde;o do poder e, ainda, a ado&ccedil;&atilde;o de mecanismos de mercado na gest&atilde;o p&uacute;blica.</p>


<p class="paragrafo">O argumento &eacute; que tal reforma contribuiria para maior efici&ecirc;ncia, efic&aacute;cia e qualidade dos servi&ccedil;os p&uacute;blicos, bem como maior transpar&ecirc;ncia e controle social sobre o Estado. Mas na pr&aacute;tica se trata de &ldquo;blindar&rdquo; o Estado das reivindica&ccedil;&otilde;es sociais, mantendo seu foco no financiamento da reestrutura&ccedil;&atilde;o produtiva.</p>


<p class="paragrafo">O <strong>neoliberalismo</strong> &eacute; uma doutrina econ&ocirc;mica que defende a m&iacute;nima interven&ccedil;&atilde;o estatal na economia e a liberdade de mercado como os motores do crescimento. O neoliberalismo se destaca mais como uma ideologia do que por seus resultados econ&ocirc;micos. Assim, apesar de n&atilde;o ter implementado completamente suas diretrizes nos pa&iacute;ses centrais, conseguiu enfraquecer os Estados-na&ccedil;&atilde;o e promover um modelo globalizado e centralizado. Os tr&ecirc;s aspectos centrais do neoliberalismo, portanto, s&atilde;o (1) a privatiza&ccedil;&atilde;o, a qual facilita a globaliza&ccedil;&atilde;o do capital industrial e de servi&ccedil;os; (2) a desregulamenta&ccedil;&atilde;o econ&ocirc;mica, que promove a globaliza&ccedil;&atilde;o do capital financeiro e comercial e, por fim; (3) a revers&atilde;o da prote&ccedil;&atilde;o social, que contribui para a globaliza&ccedil;&atilde;o do trabalho.</p>


<p class="paragrafo">O neoliberalismo se caracteriza por:</p>


<ul>
<li class="paragrafo"><strong>Redu&ccedil;&atilde;o do papel do Estado</strong>: defende a diminui&ccedil;&atilde;o da interven&ccedil;&atilde;o estatal na economia, promovendo a privatiza&ccedil;&atilde;o de empresas estatais e a desregulamenta&ccedil;&atilde;o de mercados;</li>
<li class="paragrafo"><strong>Liberdade econ&ocirc;mica</strong>: enfatiza a liberdade de com&eacute;rcio e a circula&ccedil;&atilde;o de capitais, acreditando que o mercado livre &eacute; o melhor mecanismo para alocar recursos e gerar riqueza.</li>
<li class="paragrafo"><strong>Globaliza&ccedil;&atilde;o</strong>: est&aacute; intimamente ligado &agrave; globaliza&ccedil;&atilde;o econ&ocirc;mica, promovendo a abertura de mercados e a integra&ccedil;&atilde;o econ&ocirc;mica entre pa&iacute;ses.</li>
<li class="paragrafo"><strong>Pol&iacute;ticas de oferta</strong>: prop&otilde;e que a implementa&ccedil;&atilde;o de pol&iacute;ticas voltadas para a oferta, como a redu&ccedil;&atilde;o de impostos e a desregulamenta&ccedil;&atilde;o, aumentar&aacute; a produtividade e a competitividade.</li>
</ul>


<div id="recursos-azul" class="feat-box-foto">

<p>No Brasil, com um sistema de prote&ccedil;&atilde;o social em constru&ccedil;&atilde;o, a ado&ccedil;&atilde;o da perspectiva neoliberal resultou no aumento da desigualdade, na desindustrializa&ccedil;&atilde;o e precariza&ccedil;&atilde;o do trabalho, por meio da desestatiza&ccedil;&atilde;o, na desregulamenta&ccedil;&atilde;o econ&ocirc;mica e na nega&ccedil;&atilde;o da universaliza&ccedil;&atilde;o das pol&iacute;ticas sociais, enfrentando resist&ecirc;ncia dos movimentos populares.</p>

</div>


<p class="paragrafo">Em resumo, tanto a reforma do Estado quanto a ado&ccedil;&atilde;o do neoliberalismo no Brasil revelam uma complexa intera&ccedil;&atilde;o entre interesses sociais, econ&ocirc;micos e pol&iacute;ticos, com implica&ccedil;&otilde;es significativas para o desenvolvimento e para as pol&iacute;ticas p&uacute;blicas no pa&iacute;s, em que se intercruzam com os processos de globaliza&ccedil;&atilde;o e reestrutura&ccedil;&atilde;o produtiva.&nbsp;</p>


<p class="paragrafo">Isso acontece por diversos motivos, dentre eles pela reestrutura&ccedil;&atilde;o produtiva, que, com a ado&ccedil;&atilde;o de novas tecnologias e modelos de gest&atilde;o, demandou uma reforma do Estado para criar um ambiente favor&aacute;vel aos neg&oacute;cios. Al&eacute;m disso, a globaliza&ccedil;&atilde;o, com a integra&ccedil;&atilde;o dos mercados, exigiu que os Estados se adaptassem para atrair investimentos e se inserir competitivamente no cen&aacute;rio internacional. E, juntamente a tudo isso, as reformas administrativas, como a descentraliza&ccedil;&atilde;o e a flexibiliza&ccedil;&atilde;o, buscaram tornar o Estado mais &aacute;gil e adapt&aacute;vel &agrave;s r&aacute;pidas mudan&ccedil;as do contexto global.</p>


<p class="paragrafo">Entretanto, as elites n&atilde;o atuam sozinhas. A crescente participa&ccedil;&atilde;o de setores populares da sociedade civil, se n&atilde;o conseguiu at&eacute; o momento, pelo menos tenta estabelecer regras e normas para que as condi&ccedil;&otilde;es s&oacute;cio-hist&oacute;ricas possam, adiante, inclinar-se a seu favor.</p>


<div id="webstories-placeholder" style="display: none; text-align: center; padding: 20px; border: 1px dashed #ccc;">O WebStorie est&aacute; oculto neste ambiente.</div>
<div id="webstories" class="container">
<div class="row justify-content-center justify-content-md-start">
<div class="col-12 col-sm-12 col-md-12 col-lg-12 col-xl-12" style="padding-top: 15px; padding-bottom: 15px;">
<div id="swiffy-animation" class="swiffy-slider slider-item-ratio slider-item-ratio-16x9 slider-nav-visible slider-nav-animation slider-nav-animation-fadein slider-item-first-visible" style="height: 600px;">
<ul id="container1" class="slider-container">
<li id="slide1" class="slide-visible"><img style="object-fit: contain;" src="medias/PP.3_WEB_6 (1).png" alt="..." width="200" /></li>
<li id="slide2"><img style="object-fit: contain;" src="medias/PP.3_WEB_6 (2).png" alt="..." width="200" /></li>
<li id="slide3"><img style="object-fit: contain;" src="medias/PP.3_WEB_6 (3).png" alt="..." width="200" /></li>
<li id="slide4"><img style="object-fit: contain;" src="medias/PP.3_WEB_6 (4).png" alt="..." width="200" /></li>
<li id="slide5"><img style="object-fit: contain;" src="medias/PP.3_WEB_6 (5).png" alt="..." width="200" /></li>
<li id="slide6"><img style="object-fit: contain;" src="medias/PP.3_WEB_6 (6).png" alt="..." width="200" /></li>
<li id="slide7"><img style="object-fit: contain;" src="medias/PP.3_WEB_6 (7).png" alt="..." width="200" /></li>
<li id="slide8"><img style="object-fit: contain;" src="medias/PP.3_WEB_6 (8).png" alt="..." width="200" /></li>
<li id="slide9"><img style="object-fit: contain;" src="medias/PP.3_WEB_6 (9).png" alt="..." width="200" /></li>
</ul>
<button class="slider-nav" style="--swiffy-slider-nav-light: #525AD2; outline: none;" aria-label="Go to previous" type="button"></button> <button class="slider-nav slider-nav-next" style="--swiffy-slider-nav-light: #525AD2; outline: none;" aria-label="Go to next" type="button"></button>
<div class="slider-indicators"><button class="active" aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button> <button aria-label="Go to slide"></button></div>
</div>
</div>
</div>
</div>


<p class="legenda" style="text-align: center;"><strong>T&iacute;tulo: <span style="font-weight: 400;">Argumentos a favor e contra o neoliberalismo</span></strong><br /><strong>Fonte: </strong>Sch&uuml;ler (2023).<br /><strong>Elabora&ccedil;&atilde;o: </strong>Prosa (2025d).</p>

<p>&nbsp;</p>
<div class="nav-pagination"><!-- Botões 'Voltar' e 'Avançar' na leitura -->
<div class="nav-buttons"><a class="btn button btn-lg btn-secondary btn-nav-prev" href="pagina_21.html"> Voltar </a> <a class="btn button btn-lg btn-primary btn-nav-next" href="pagina_025.html">Avan&ccedil;ar Leitura</a></div>
<p class="nav-marker">P&aacute;gina 18 de 38</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  <footer id="footer">
  <div class="container p-0">
    <div class="footer-row row m-0 text-center">
      <div class="footer-img text-left">
        <a alt="Acesso à informação" href="http://www.acessoainformacao.gov.br/" target="_blank">
          <img src="imagens/acesso-a-informacao.png">
        </a>
      </div>
    
      <div class="footer-links">
        <ul class="list-inline list-links">
          <li class="list-inline-item">2024| </li>
          <li class="list-inline-item">SETEC-MEC | </li>
          <li class="list-inline-item">LANTEC/PROSA-UFSC.</li>
          <li class="list-inline-item">Todos os direitos reservados.</li>
        </ul>
      </div>

      <div class="footer-img text-right">
        <a alt="Governo Federal" href="http://www.brasil.gov.br/" target="_blank">
          <img src="imagens/governo-federal-brasil.png">
        </a>
      </div>
    </div>
  </div>
</footer>






  
  

  <script>
    document.addEventListener('DOMContentLoaded', function () {
    // Carregar o arquivo JSON usando fetch
    fetch('topics.json')
        .then(response => {
            if (!response.ok) {
                throw new Error('Erro ao carregar o arquivo JSON');
            }
            return response.json();
        })
        .then(jsonData => {
            populateMenu(jsonData);
        })
        .catch(error => {
            console.error('Erro:', error);
        });
});

// Função para verificar se a propriedade 'show' é verdadeira
function shouldShowPage(pageProperties) {
    if (Array.isArray(pageProperties) && pageProperties.length > 0) {
        return pageProperties.some(property => property.show === true);
    }
    return false; // Não mostrar se não houver propriedades ou se todas forem false
}

// Função para inserir itens no menu
function populateMenu(jsonData) {
    const sidebarNavElements = document.querySelectorAll('#sidebar-nav');

    sidebarNavElements.forEach(navElement => {
        jsonData.forEach(item => {
            if (shouldShowPage(item.page_properties)) {  // Verifica se o item deve ser mostrado com base em page_properties
                const listItem = document.createElement('li');
                listItem.className = 'nav-item';

                const linkItem = document.createElement('a');
                linkItem.className = 'nav-link';
                linkItem.href = item.url;
                linkItem.textContent = item.title;

                const dotDiv = document.createElement('div');
                dotDiv.className = 'dot';

                listItem.appendChild(dotDiv);
                listItem.appendChild(linkItem);

                navElement.appendChild(listItem);
            }
        });
    });
}
  </script>

</body>
</html>